[
  {
    "编号": 1,
    "专利底稿": "在现有的思政教育中，教学方式往往依赖于单一的文本讲解，容易引起学生的抵触心理。同时，由于课程时间紧凑，教师难以深入展开讲解，学生不易形成深刻认知。教师也需要投入大量时间制作多媒体课件，限制了其进行教学创新和实践探索的时间。为解决上述问题，本发明核心在于构建一个能够理解、生成和丰富多模态教学内容的知识处理系统。该系统首先通过集成文本、图像、视频和语音等多种模态的教育资源，构建一个结构化的课程知识图谱。针对图像数据，训练用于识别典型人物和事件的目标检测神经网络；对于视频数据，训练用于分析学生课堂行为（如点头、抬头）的行为检测神经网络；对于语音数据，则训练通用的语音识别模型和能够模拟特定人物音色的声音模型。所有这些模型都能与课程知识图谱中的实体和概念进行关联，形成统一的语义理解基础。在具体应用时，教师只需提供一个课程的基本框架，该框架甚至可以是通过口述录音形成的语音指令。系统会自动解析此框架：对于其中的文本部分，通过自然语言处理技术抽取关键知识点，并利用知识图谱进行内容补全与扩展；对于图像部分，调用目标检测模型识别其中元素，并关联图谱中的相关知识进行阐释；对于语音部分，先将其转为文本，再进行上述的知识补全过程。这一过程能自动为教师的原始框架填充进丰富的图文、影音材料，极大节省了备课时间。此外，系统还可根据预设的知识搜索深度，控制内容发散的广度，并自动生成课程思维导图。在学生互动环节，支持学生通过语音、文本或图文方式提问。系统基于构建好的知识图谱进行语义搜索和推理，并以多种形式进行回答，包括语音、文本、图片或多媒体混合形式。为增强教学感染力和沉浸感，当系统以语音形式回答涉及特定人物的问题时，会启用对应的典型人物声音模型进行播报；当答案涉及重大历史事件时，则会自动匹配相关事件的背景音效，加深学生的情境代入感。为实现教学效果的持续优化，本发明还引入了一个反馈闭环机制。系统会实时采集课堂上的学生提问数量、通过行为检测分析得出的学生整体专注度以及课后的测试成绩。这些数据经过一个综合评估模型处理，其输出结果会反馈至知识图谱的推荐逻辑中，从而使得系统为课程自动补充的内容能够不断迭代优化，越来越符合学生的兴趣和认知习惯，最终有效提升课堂的抬头率和点头率。对应于上述方法，本发明还提供了一套完整的处理系统，该系统包含知识模块、扫描模块、语音模块、展示模块、推理模块、反馈模块及存储模块，各模块协同工作以实现从知识构建、课程生成到智能交互与反馈优化的全流程功能。此外，本发明还可通过特定的电子设备实现，该设备配备有语音接收与播放器、存储器及处理器，能够承载并运行所述的系统与方法。最后，实现该方法的所有程序代码也可存储于计算机可读存储介质中，由处理器调用并执行。综上所述，本发明通过多模态知识图谱与人工智能技术的结合，不仅自动化地生成了丰富多彩的教学内容，减轻了教师的备课负担，还通过智能交互和持续优化的反馈机制，显著提升了学生的学习体验和课堂参与度。",
    "专利名": "多模态知识图谱处理方法、系统、电子设备及存储介质"
  },
  {
    "编号": 2,
    "专利底稿": "目前的大数据在线教育平台在扫描录入学生试卷后，通常仅能完成客观题的自动批改、主观题的人工批改以及基础分数统计功能。这些平台提供的数据分析维度相对有限，主要包括：基于试卷总分的学生位次排名、基于小题得分的位次对比、最高分统计以及平均分计算等基础数据。学生虽然可以通过对比个人小题得分与全体学生的均分、最高分来初步感知自身知识薄弱点，但这种分析方式存在明显局限性。因为学生面临的知識短板中，有些通过短期努力即可见效，有些则需要长期积累才能改善。现有平台提供的原始数据无法区分这两种情况，导致学生难以精准识别那些投入产出比最高的易提升知识点，从而影响了学习效率的提升和学业负担的减轻。针对现有技术的不足，本发明提供了一种能够深度挖掘考试数据、精准识别易提升知识点的分析方法。该方法通过建立多维度的评估模型，综合考虑学生在各小题上的实际表现与预期表现的差异、历史成绩趋势以及知识点关联性，最终输出具有明确指导意义的优先补短序列。本方法的完整实施流程包括以下五个核心步骤：第一步是数据采集与预期分计算。系统首先获取目标区域（即使用相同试卷的所有学生）某次考试某科目的全量数据，包括每位学生的试卷总分和各小题得分。接着根据特定学生的试卷总分，通过建立的数学模型计算出该学生在各小题上的预期得分。这个计算过程基于全体学生的小题得分分布与总分之间的关联规律，具体实现方式为：先将全体学生的小题得分矩阵进行从大到小的排序处理，然后根据该学生的实际总分在总分序列中的位置，通过线性插值法确定其在各小题上的预期得分。这一步骤的核心在于建立总分与小题得分之间的量化关系模型，为后续的偏差分析提供基准参考。第二步是计算预期偏差值。系统将学生在各小题上的实际得分与第一步计算得到的预期得分进行对比，得出偏差值。这个偏差值直观反映了学生在特定小题上的表现是超出预期还是低于预期，以及偏离的程度大小。负向偏差越大，表明该小题对应的知识点存在越明显的掌握不足。第三步是引入历史表现维度。系统调取该学生在本次考试之前的z次相关考试记录，计算其在各知识维度上的历史位次加权平均值。这个指标综合考虑了学生近期在相关知识点上的表现趋势，避免了单次考试的偶然性影响。其中，历史考试中该学生的科目位次和对应小题的得分位次都经过加权处理，更近的考试数据被赋予更高的权重，从而保证评估结果的时效性。第四步是核心的优先补短系数计算。系统将前三个步骤得出的数据——包括当前考试的预期偏差值、历史表现加权值以及当前考试中各小题的得分位次——输入到特定的优先补短系数公式中进行综合计算。该公式的设计充分考虑了多个维度的相互影响：当前考试的预期偏差值反映了知识点的即时掌握情况，历史表现加权值体现了该知识点的长期薄弱程度，而当前考试的得分位次则显示了该知识点在全体学生中的相对难度水平。通过这三个维度的有机组合，系统能够准确识别出那些既存在明显知识缺口、又具有较高提升潜力的知识点。第五步是结果反馈与应用。系统将计算得到的优先补短系数按从大到小排序，将系数较高的知识点及其对应小题反馈给相关学生和教师。这种排序结果直接指明了哪些知识短板最容易通过针对性学习得到快速改善，为学生提供了明确的学习方向，为教师提供了精准的教学重点。与分析方法相配套，本发明还提供了一套完整的知识点查缺补漏分析系统。该系统由五个核心模块构成有机整体：题库模块存储着涵盖各个学科、各种知识点的海量题目，并通过自然语言处理技术对题目内容进行关键词抽取和分类标注；优先补短系数计算模块负责执行上述五个步骤的核心算法，完成从数据输入到系数输出的全过程计算；习题识别模块通过文字识别和图像识别技术，能够自动识别试卷中各小题对应的学科归属和知识点分类，其通过自然语言处理技术抽取题目关键词，并通过反向图片搜索技术在题库中寻找相似题目，建立小题与知识点的准确关联；分析模块作为系统的决策中枢，接收来自计算模块的优先补短系数和识别模块的知识点分类结果，进行综合判断后确定需要优先补短的知识点序列；相似习题推荐模块根据分析模块的指令，从题库中智能检索出对应知识点的典型习题和变式训练题；显示模块则负责将推荐习题、分析结果等以可视化形式呈现给用户。本发明的显著优势在于通过多层次的大数据分析，将传统的分数统计提升为具有明确指导意义的学习建议。该方法不仅考虑了学生当前考试的表现，还结合了历史学习轨迹和全体学生的对比数据，使得找出的知识短板既符合学生的实际状况，又具有较高的改善可行性。通过精准定位最容易提升的知识缺陷并优先进行针对性弥补，避免了面面俱到的覆盖性学习，使学生能够将有限的学习时间投入到最能产生效果的知识点上，从而显著提高了学习的针对性和有效性，同时也为减轻学生过重的学业负担提供了技术支撑。\n",
    "专利名": "基于大数据的知识点查缺补漏分析方法及系统"
  },
  {
    "编号": 3,
    "专利底稿": "在城市建设中，市政排水管道是重要的基础设施，通常包括雨水管道和污水管道，以实现雨污分流，雨水直接排入河流，污水则输送到污水处理厂。然而，由于污水中含有大量杂质，这些杂质在管道内易堆积形成堵塞，而管道埋设于地下，维护人员难以快速定位和疏通，导致排水效率降低甚至污水外溢。现有技术中，排水管道缺乏有效的实时监控手段，无法精准判断堵塞发生的位置和原因，对于较大杂物无法进行破碎处理，过滤后的杂物也难以统一收集，这些问题严重影响了污水的正常排放。针对上述不足，本发明提供一种智能排水监控与处理系统，该系统包括设置在地下的排水管路，该排水管路由主管路和与之并联的反冲洗管路组成，用于输送地面积水。在主管路中设有收集装置，用于截留和收集污水中的不可溶杂质，收集装置底部配置排污阀，以便定期排出 accumulated 杂质。排污阀输出端连接收集管路，收集管路将杂质输送至专门的杂质处理装置进行统一处理。系统还配备阀门组，该阀门组包括位于主管路和反冲洗管路上游交汇处的第一阀门、下游交汇处的第二阀门，以及位于主管路内第一阀门与收集装置之间的第三阀门。通过调节这些阀门的开闭状态和开度，可以改变管路中水流方向和控制流量。为了实时监测管道运行状态，系统在主管路的关键位置安装了若干流量检测器，包括位于收集装置和第三阀门之间的过滤流量检测器、第一阀门上游的上游流量检测器以及收集装置下游的下游流量检测器。这些检测器周期性检测对应位置的实时水流量。系统还设有分析器，该分析器设置在管路外部，与各流量检测器相连，用于根据检测数据判断排水是否合格，并分析不合格的具体原因。分析器基于过滤流量检测器在单个周期内测得的流量值进行初步判断：若过滤流量大于预设的第二预设流量，则判定排水合格；若过滤流量介于第一预设流量和第二预设流量之间，则结合下游流量检测器测得的流量进行二次判断；若过滤流量低于第一预设流量，则进一步参考历史周期内的流量数据来确定原因。在二次判断中，分析器计算过滤流量与下游流量的差值，若该差值小于等于预设流量差值，则判定主管路未堵塞，排水合格，并自动修正第一预设流量和第二预设流量的阈值；若差值超过预设流量差值，则结合历史流量数据进一步分析。分析器会根据历史过滤流量绘制时间-流量变化曲线，通过计算曲线在当前时间节点的斜率绝对值来识别具体问题：若斜率绝对值较小，表明管路处于正常污水状态；若斜率适中，则判定收集装置堵塞，系统会启动排污阀进行清理；若斜率较大，则结合上游流量检测器数据确认是否为更严重的堵塞。系统还配备驱动器，驱动器分别与分析器、排污阀及各阀门连接，根据分析器输出的指令控制排污阀的开闭和各阀门的运行参数。当分析器判定收集装置堵塞时，驱动器会关闭第二阀门，并调整第一阀门和第三阀门的开闭状态，使水流仅通过反冲洗管路，实现对收集装置的反向冲洗，从而清除滤网上残留的杂质。此外，分析器还会根据上游流量与过滤流量的差值绝对值来验证堵塞原因，若该差值绝对值小于等于预设值，则确认收集装置堵塞，并维持排污阀的开启状态。与现有技术相比，本发明的有益效果在于通过多流量检测器的协同工作，实现了对排水管道运行状态的精准监控，能够快速识别堵塞位置和原因，并通过阀门组和反冲洗管路的智能配合，自动执行清理操作，显著提高了污水的排放效率。同时，系统具备自学习和自适应能力，能够根据历史数据动态调整流量阈值，进一步提升监控精度和响应速度。整体上，本发明不仅降低了人工维护成本，而且有效预防了管道堵塞导致的积水问题，增强了市政排水系统的可靠性和耐久性。",
    "专利名": "基于物联网的智能自清洁排水系统"
  },
  {
    "编号": 4,
    "专利底稿": "本发明旨在解决现有技术中基于文本调整面部图像时存在的鲁棒性不足、识别准确性低以及区分性不够的技术问题。当前基于人工智能的面部图像生成技术通常利用如CLIP等图像特征提取模型提取待调整面部的特征，再结合文生图模型理解调整文本以生成目标图像。然而，这种方法在特征表达上存在局限性，导致生成的面部图像准确性不足且缺乏足够的唯一性来区分不同实体。为克服这些缺陷，本发明提出了一种新的面部图像生成方案。该方案首先获取包含待调整面部的待调整图像、描述特定需求的第一调整文本以及初始的第一随机噪声。通过对所述待调整图像进行深度特征提取，分别获得所述待调整面部的面部语义特征和面部结构特征，同时对所述第一调整文本进行特征提取得到第一文本特征。随后，将提取的面部语义特征、面部结构特征与第一文本特征共同输入至文生图模型中的注意力模块。该注意力模块基于这些多模态特征进行协同调整，动态计算并输出所述待调整面部中各个位置的第一注意力权重，从而精确调控模型在图像生成过程中对面部不同区域的关注程度。最后，文生图模型依据所述第一注意力权重，对第一随机噪声进行渐进式去噪处理，最终生成第一目标面部图像。该生成图像在最大程度保留原始待调整面部基本语义特征的同时，精准地融入了第一调整文本所描述的特定需求，实现了对背景、服饰、发型等属性的可控修改。本发明通过同时引入面部结构特征和语义特征，并利用注意力机制进行融合调控，显著增强了生成面部图像的准确性和独特性。这不仅加强了对关键信息的捕捉与对冗余信息的抑制，也提升了多尺度特征的融合能力，从而在保证身份准确性的前提下，有效提高了生成面部的区分度，最终获得更高质量、更符合预期目标的生成效果。对应于上述方法，本发明还提供了一种面部图像生成装置，该装置包括获取单元、特征提取单元、调整单元和生成单元，各单元协同工作以执行所述方法的各个步骤。此外，本发明还涵盖了实现该方法的计算机设备、计算机可读存储介质以及计算机程序产品，共同构成完整的技术解决方案。",
    "专利名": "一种面部图像生成方法和相关装置"
  },
  {
    "编号": 5,
    "专利底稿": "在当前网络媒体快速发展的环境下，视频内容的版权保护显得尤为重要。通常采用的技术手段是在视频中嵌入水印信息以实现内容认证和防伪溯源等功能。然而，传统的视频水印嵌入方法往往需要对视频中的每一帧都进行处理，这不仅消耗大量的计算资源，还会显著增加处理时间，特别是在处理高分辨率、长时长的视频内容时，这种资源消耗问题尤为突出。现有技术缺乏对视频内容特性的充分考虑，未能根据视频内容的实际特征来智能选择水印嵌入的关键帧，导致水印嵌入效率低下，难以满足实际应用中对处理效率和资源消耗的平衡需求。为解决上述技术问题，本发明提供了一种创新的视频水印嵌入方案，该方案通过对视频内容进行智能分析，选择关键帧进行水印嵌入，从而在保证水印效果的同时显著提升处理效率。具体而言，本发明的技术方案包括以下步骤：首先对初始视频中的每个视频帧进行分析，计算该视频帧与其相应参考帧之间的第一相似度，这一相似度计算可以采用结构相似性指数、特征点匹配或深度学习特征比对等方法实现。在获得每个视频帧的相似度数据后，系统基于这些相似度值从初始视频中确定多个跳转帧，这些跳转帧通常是视频内容发生显著变化的帧，可以作为视频分割的边界点。通过将这些跳转帧作为初始视频的分割点，系统将原始视频划分为多个内容相对连贯的视频片段。这种划分方式充分考虑了视频内容的连续性特征，确保每个视频片段内的内容具有较高的相关性。随后，针对每个视频片段，系统再次基于该片段内各视频帧的相似度数据，从每个片段中选择至少一个第一目标帧作为水印嵌入的载体。这些第一目标帧的选择标准可以包括帧的稳定性、内容代表性以及视觉重要性等多个因素，确保所选帧既能够有效承载水印信息，又不会对视频观看体验产生负面影响。最后，系统通过向所选定的多个第一目标帧嵌入水印信息，生成最终的目标视频。水印嵌入可以采用可见水印或不可见水印的方式，具体技术可以包括离散余弦变换、离散小波变换或最小显著位替换等数字水印技术。值得注意的是，本方案仅对选定的关键帧进行水印嵌入，而非对视频中的所有帧进行处理，这种选择性嵌入策略显著减少了计算资源的消耗，提高了处理效率，同时保证了水印在整个视频中的有效性和持续性。与上述方法相对应，本发明还提供了一种视频水印嵌入装置，该装置包括多个功能单元：第一确定单元负责计算视频帧与参考帧之间的相似度；第二确定单元基于相似度数据识别跳转帧；第三确定单元利用跳转帧将视频分割为多个片段；第四确定单元从每个片段中选择合适的第一目标帧；以及嵌入单元负责在选定帧中嵌入水印信息。这些功能单元协同工作，形成一个完整的视频水印处理系统。此外，本发明还涵盖了一种电子设备，该设备包括至少一个处理器和与处理器通信连接的存储器。存储器中存储有计算机指令，当这些指令被处理器执行时，能够使设备实现上述视频水印嵌入方法的各个步骤。同时，本发明还提供了一种计算机可读存储介质，该介质存储有用于执行上述方法的计算机指令，以及相应的计算机程序产品。本发明的技术方案具有多方面的有益效果。首先，通过智能选择关键帧进行水印嵌入，显著减少了需要处理的视频帧数量，从而大幅降低了计算资源的消耗和处理时间。实验表明，与传统的全帧处理方法相比，本方案能够将处理时间减少约50%-70%，具体效果取决于视频内容的特性。其次，基于视频内容分析的分段和选帧策略确保了水印嵌入的有效性和鲁棒性，即使视频被裁剪或编辑，水印信息仍能保持可检测性。再者，本方案具有良好的适应性，可以兼容各种不同的水印算法和视频格式，为不同的应用场景提供灵活的解决方案。最后，这种智能帧选择方法不仅适用于水印嵌入，还可以扩展应用于视频摘要、关键帧提取等相关领域，具有广泛的应用前景。本发明的创新点在于将视频内容分析与水印嵌入过程有机结合，通过两阶段的帧选择机制——先识别跳转帧进行视频分割，再在各片段内选择目标帧——实现了水印嵌入的精确化和高效化。这种方法不仅考虑了视频的时序特征，还充分尊重了视频内容的语义完整性，确保在提升处理效率的同时，不会牺牲水印的质量和持久性。与现有技术相比，本发明在效率、适应性和实用性方面都具有明显优势，为视频版权保护提供了一种更为高效和智能的解决方案。",
    "专利名": "视频水印嵌入方法及装置、设备和介质"
  },
  {
    "编号": 6,
    "专利底稿": "在现代制造业体系中，食品制造业作为关系国计民生的重要产业，其产品质量与安全控制始终是社会关注的焦点。其中，腌制类食品作为传统食品加工的重要品类，其生产过程中存在的质量控制难点尚未得到充分解决。现有食品安全溯源技术主要依靠条形码、RFID电子标签或区块链等技术手段，对食品的生产、加工、运输和销售环节进行信息记录与追踪，并在生产环境监测方面普遍采用温湿度传感器对车间环境进行监控。然而，这些技术方案存在明显局限性：它们主要关注宏观环境参数，而未能针对腌制食品的特殊加工工艺进行专门优化。在传统腌制工艺中，食品被置于密闭的腌制容器内，与外界环境形成隔离状态。腌制液中含有的大量盐分、糖分及其他调味成分会与食品组织发生复杂的渗透作用，这一过程不仅会导致热量的产生，引起容器内部温度升高，同时还会促进水分交换，改变容器内的湿度环境。更关键的是，腌制过程中微生物的代谢活动会进一步影响容器内的气体成分，特别是氧气浓度的变化将直接决定食品的氧化变质风险。现有技术恰恰忽视了这些关键因素，仅监测环境温湿度而忽略了密闭容器内部的微环境变化，导致无法及时发现腌制过程中可能出现的质量安全隐患。为解决上述技术缺陷，本发明提供了一套完整的腌制食品质量监控与溯源解决方案。该系统由四个核心模块构成有机整体：数据采集模块负责获取目标区域的实时环境参数，其中特别限定目标区域为腌制容器内部空间，而非传统意义上的生产车间环境。该模块通过专门设计的传感器阵列，包括高精度温度传感器、湿度传感器和氧气浓度传感器，实时采集容器内部的温度、湿度和氧气浓度数据。这些传感器经过特殊封装处理，能够适应腌制环境的高盐、高湿腐蚀性条件，确保数据采集的准确性和可靠性。数据分析模块作为系统的智能处理核心，与环境数据采集模块建立实时数据连接。该模块通过专门设计的食品变质评估算法，将采集到的多维度环境参数转化为量化的安全评估指标。具体计算过程为：将实时采集的温度值标记为W，湿度值标记为S，氧气浓度值标记为Y，通过建立的数学模型P＝ln[(W+1)^A×(S+1)^B×(Y+1)^C]计算得到食品变质评估系数P。在这一数学模型中，A、B、C分别为各环境因子的比例系数，其具体数值根据不同类型腌制食品的工艺特性通过实验确定。采用自然对数函数ln(*)对复合参数进行标准化处理，使得输出结果具有良好的数值特性和可比性。这一计算方法的科学依据在于：过高的温度会加速微生物代谢，当超过特定阈值时会导致食品成分的快速分解；湿度过高则创造利于微生物繁殖的条件；而氧气浓度更是直接影响氧化变质进程的关键因素。系统预设了经过大量实验验证的安全阈值，当计算得到的食品变质评估系数超过该阈值时，分析模块会立即生成预警信号并传输至云平台。溯源模块构建了完整的产品信息追溯链条。该模块不仅记录传统的食品溯源信息，包括原材料来源、生产加工数据、运输流转记录等，还创新性地将预警信息纳入溯源体系。在溯源码生成方面，本发明采用了动态加密技术来确保溯源信息的真实性和防伪性。具体实施过程包括四个关键步骤：首先生成食品唯一密钥，通过GUID算法或哈希函数为每个批次产品创建独一无二的标识符；接着生成随机数种子，利用计算机算法产生随机字符串以增强加密复杂性；然后获取当前系统时间戳，确保生成的溯源码具有时效特征；最后通过动态加密算法对包含唯一密钥、随机数种子和时间戳的复合信息进行加密处理。在加密过程中，系统根据安全策略选择对称加密或非对称加密方式：对于对称加密采用临时会话密钥确保单次通信安全，对于非对称加密则使用公钥加密、私钥解密机制保障端到端安全。生成的密文最终通过QRCode等二维码生成技术转换为可视化的溯源码，这种动态加密方式有效解决了传统条形码和二维码易被复制的技术难题。云平台作为系统的数据中心和协调中枢，承担着多重功能。一方面接收并存储来自各模块的溯源信息，构建完整的產品信息数据库；另一方面实时监控预警信息，当接收到分析模块发送的预警信号时，立即通过无线通信网络向相关工作人员的移动终端发送报警通知，确保及时采取干预措施。平台还面向最终消费者提供溯源查询服务，用户通过扫描产品溯源码即可获取从原料到成品的全流程质量信息，包括生产过程中的环境监控数据和可能出现的预警记录，实现了腌制食品质量安全的透明化管理。与现有技术相比，本发明的创新价值主要体现在两个方面：首先突破了传统食品安全监控仅关注宏观环境的局限，将监测重点转向腌制容器内部的微环境参数，通过温度、湿度和氧气浓度的综合监测，真正抓住了影响腌制食品质量的核心因素；其次通过动态加密溯源技术解决了传统溯源码易被伪造的技术难题，建立了防伪性与时效性兼备的产品身份认证体系。该系统已在实际应用中证明其有效性，能够显著降低腌制食品生产过程中的质量风险，提高产品质量稳定性，同时增强了消费者的信任度和满意度。通过将实时监控、智能预警与溯源防伪有机结合，本发明为腌制食品制造业提供了一套完整可靠的质量安全保障方案，具有重要的推广应用价值。\n",
    "专利名": "基于物联网的智能制造业信息溯源系统"
  },
  {
    "编号": 7,
    "专利底稿": "区块链作为一种由多方共同维护、使用密码学技术保证数据传输和访问安全的技术体系，其核心特征在于数据的不可篡改性和去中心化存储。在区块链系统运行过程中，随着新区块的不断产生，系统会持续生成并更新状态数据，这些状态数据主要包括账户状态和合约状态，它们共同构成了区块链网络的当前状态。然而，随着区块链运行时间的增长，特别是对于像以太坊这样已经长期运行的区块链项目，其区块高度已达到千万级别，状态数据的持续膨胀已成为制约系统性能的重要瓶颈。当新节点需要加入现有区块链网络时，如果采用传统的区块重放方式重新生成状态数据，不仅需要耗费大量时间，还会占用巨大的计算资源。目前主流的解决方案是通过状态同步机制，让新节点直接从全节点或数据节点请求同步状态数据。但是，现有技术方案中存在一个关键性问题：每个数据节点以Key-Value键值对的形式存储状态数据，而传统方案中Key值是采用Value的哈希值生成，导致Key值呈现无序分布状态。这种无序的键值对存储方式严重影响了状态同步的效率，使得同步过程变得缓慢而低效。为解决上述技术问题，本发明提出了一种创新的区块链状态数据存储方法。该方法的核心改进在于重新设计了键数据的组成结构，使其从无序变为有序。具体而言，在获取待存储的状态数据时，同时获取对应的键数据，这些键数据包含了两个关键要素：区块号和状态节点在状态树中的寻址路径。通过将状态数据与这种结构化的键数据组合成键值对，并持久化存储至磁盘，实现了状态数据的有序存储。这种有序存储结构带来了显著的技术效果：由于键数据中包含了区块号信息，使得属于同一区块的状态数据可以被集中存储，大大减少了存储引擎后台执行归并操作的频率，从而提升了存储效率。在实际存储过程中，当需要存储多个状态数据且这些数据具有不同区块号时，系统会将各组键值对按照区块号的排列顺序依次写入磁盘；而当多个状态数据属于同一区块时，则将这些键值对写入磁盘的相邻位置，这种存储策略为后续的高效读取奠定了坚实基础。在数据读取方面，本发明提出了一种基于位置关联的批量读取方法。该方法首先根据目标区块的区块号和目标状态数据的寻址路径，从磁盘中读取对应的状态数据；然后将该状态数据存储的磁盘位置作为起始目标位置，批量读取与该位置相邻的多个位置的状态数据。如果读取到的状态数据属于同一目标区块，系统会动态更新目标位置，并继续批量读取新位置相邻的数据，直至当前目标位置的所有相邻位置都不再存储目标区块内的状态数据。这种读取方式充分利用了数据存储的局部性原理，通过减少磁盘寻址次数和寻址距离，显著提高了数据读取效率。基于上述存储和读取方法，本发明进一步提出了一套完整的状态数据同步方案。该方案涉及两个节点的协同工作：作为数据请求方的第一节点和作为数据提供方的第二节点。当第一节点需要同步状态数据时，首先向第二节点发送状态同步请求；第二节点在接收到请求后，确定需要同步的目标区块范围，然后使用前述的批量读取方法从磁盘中读取对应的目标状态节点数据；最后将这些数据发送给第一节点。第一节点在接收到状态数据和对应的键数据后，采用本发明的有序存储方法将这些数据持久化到本地磁盘。这一完整的工作流程确保了状态同步过程的高效性，同时保证了数据的一致性和完整性。为了支持上述方法的实际应用，本发明还提供了相应的装置实现方案。这些装置包括区块链状态数据的存储装置、读取装置和同步装置，每个装置都包含实现相应方法功能所需的处理单元和存储单元。其中，存储装置包括用于获取状态数据和键数据的初始单元，以及负责将键值对持久化至磁盘的处理单元；读取装置则包括定位初始状态数据的初始单元和执行批量读取逻辑的处理单元；同步装置根据节点角色的不同，分别配置了相应的收发单元和处理单元，确保状态同步过程的顺利执行。在硬件层面，本发明可以通过配置相应的电子设备来实现。这些设备包括存储器、处理器以及存储在存储器中并可在处理器上运行的计算机程序。当处理器执行这些计算机程序时，能够实现本发明提供的各种方法。此外，本发明还提供了存储相应计算机程序的计算机可读存储介质，以及包含这些程序的计算机程序产品。这些配套的技术方案确保了本发明能够在实际的区块链系统中得到有效部署和应用。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过引入结构化的键数据设计，改变了传统键值对的无序存储方式，使得状态数据能够按照区块号和寻址路径进行有序存储；其次，利用数据存储的局部性原理，实现了状态数据的批量读取，显著减少了磁盘寻址开销；最后，通过优化存储和读取环节，整体提升了状态同步过程的效率。这些技术改进对于解决区块链状态数据膨胀问题、降低新节点加入网络的时间成本、提高区块链系统的可扩展性都具有重要意义。特别对于需要处理大量状态数据的商业级区块链应用，本发明的技术方案能够提供更高效的数据同步体验，为区块链技术的大规模商业化应用扫除了一个重要障碍。\n",
    "专利名": "区块链状态数据的存储方法、同步方法及存储介质"
  },
  {
    "编号": 8,
    "专利底稿": "生产物料作为企业生产经营活动的基础要素，其价格波动直接影响企业的生产成本和利润水平。在全球化市场竞争日益激烈的背景下，原材料价格的频繁波动使得企业面临巨大的成本管控压力。传统上，企业对生产物料价格的跟踪和分析主要依赖于采购人员的经验判断和人工分析，这种方法存在明显局限性：一方面，人工分析难以全面捕捉市场中的海量价格信息，容易遗漏关键的价格变动趋势；另一方面，基于经验的价格预测缺乏客观的数据支撑，预测精度和时效性都难以保证。这些不足导致企业往往无法及时应对市场价格变化，错失最佳采购时机，进而影响整体经营效益。\n为解决上述技术问题，本发明提出了一种创新的生产物料价格跟踪预测方案，该方案将区块链技术与深度学习算法有机结合，实现了对生产物料价格的精准预测。系统的核心架构包含五个关键模块，这些模块协同工作形成一个完整的价格分析与预测流水线。首先，生产物料价格监控模块负责从区块链网络获取生产物料在预定时间段内的历史价格数据。区块链技术的应用确保了数据来源的可靠性和不可篡改性，为后续分析提供了高质量的数据基础。这些价格数据按照时间顺序组织，形成了连续的价格变动记录序列，其中包含了预定时间段内每日的物料价格信息。\n接下来，局部时序编码模块对获取的价格数据进行深度特征提取。该模块首先对原始价格序列进行预处理，将时间序列数据转换为适合神经网络处理的向量形式。具体处理过程包括两个步骤：时序排列和时序切分。时序排列阶段将价格数据按时间维度整理为标准化的输入向量；时序切分阶段则基于预设的时间窗口对长序列进行分段处理，生成多个局部时序输入向量。这些向量随后被送入基于一维卷积神经网络的时序特征提取器，通过卷积操作捕捉每个时间片段内的局部价格波动模式，最终输出一组富含局部时序特征的特征向量序列。\n在获得局部特征向量序列后，价格时序波动特征提取模块开始工作。该模块的核心功能是挖掘不同时间片段之间的关联性及其变化规律。通过计算相邻特征向量之间的转移矩阵，系统能够准确描述价格波动的动态特性。转移矩阵的计算采用专门的数学公式，其中相邻的两个特征向量Vi和Vi+1通过矩阵运算得到它们之间的状态转移关系。这一系列转移矩阵共同构成了生产物料价格时序波动特征图，该特征图从宏观层面揭示了价格变化的整体趋势和波动模式。为了进一步提升特征质量，系统设置了特征显著化模块。该模块对得到的价格时序波动特征图进行增强处理，通过非线性变换突出关键特征，抑制噪声干扰。显著化处理后的特征以矩阵形式组织，形成了显著化生产物料价格时序波动特征矩阵。这一矩阵不仅保留了原始数据中的重要信息，还通过特征增强使预测模型能够更准确地识别价格变化的关键信号。\n最后，生产物料价格预测模块负责基于处理后的特征矩阵生成具体的价格预测值。该模块首先对特征矩阵进行优化处理，通过位置间概率密度分布相关性超凸度量方法进一步提炼特征信息。优化过程采用特定的数学公式，计算特征矩阵中不同位置之间的相关性，并通过超凸度量增强特征的区分度。优化后的特征矩阵随后被送入解码器进行回归分析，解码器基于训练好的参数将高维特征映射为具体的价格预测值。整个预测过程形成了从原始数据到预测结果的完整转换链条，确保了预测结果的准确性和可靠性。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过区块链技术确保了数据源的可靠性和透明度，避免了传统方法中数据质量不高的问题；其次，采用深度学习方法自动提取价格波动的时序特征，克服了人工分析的主观性和局限性；最后，通过多级特征处理和优化机制，显著提升了价格预测的精度和稳定性。这套系统能够为企业提供未来短期内的物料价格预测，帮助企业在采购决策、库存管理和生产计划等方面做出更加科学的安排。例如，当系统预测到某种原材料价格即将上涨时，企业可以提前进行采购备货，锁定成本；当预测价格下降时，则可以适当推迟采购，降低成本支出。这种基于数据驱动的决策方式能够有效提升企业的供应链管理效率，增强市场竞争力。在实际应用场景中，本发明可以部署为云服务平台或企业本地系统，通过与现有ERP系统的数据对接，为企业提供实时的价格监测和预测服务。系统支持多种生产物料的并行跟踪，能够根据不同物料的特性自动调整模型参数，确保预测精度。同时，系统还具备自学习能力，随着数据积累不断优化预测模型，适应市场环境的变化。这些特点使得本发明不仅适用于大型制造企业，也能为中小型企业提供实用的价格风险管理工具。通过将先进的人工智能技术与具体的业务场景相结合，本发明为企业在复杂市场环境下的经营决策提供了有力的技术支撑，具有显著的经济价值和推广前景。\n",
    "专利名": "基于区块链的生产物料价格跟踪系统及方法"
  },
  {
    "编号": 9,
    "专利底稿": "随着5G移动通信技术的商业化部署和6G技术研发的推进，通信系统不仅需要支持更高的传输速率和更低的时延，还需要为各种新兴应用场景提供精准的定位服务。在增强移动宽带、超可靠低时延通信和大规模机器类型通信三大典型场景中，车辆对万物通信、工业物联网和扩展现实等应用都对终端设备的定位精度提出了更高要求。传统基于基站的定位方法虽然能够满足大部分场景的需求，但在网络覆盖边缘区域或基站部署密度不足的环境中，定位精度和可靠性会受到显著影响。此外，在车联网和无人机通信等动态场景中，设备之间的直接定位需求日益突出，这就需要开发不完全依赖基础设施的终端间直接定位技术。本发明的核心在于提出了一种基于侧链路的终端定位机制，该机制充分利用往返时间测量原理，通过终端间直接交换定位参考信号来实现精准距离测量。在具体实施过程中，涉及两个或多个终端设备的协同工作。首先，作为定位发起方的第一终端需要分配专用的无线资源用于发送第一侧链路定位参考信号。这种资源分配过程需要考虑无线信道的特性和系统的资源调度机制，确保定位信号能够在不与其他通信业务产生冲突的情况下可靠传输。第一侧链路定位参考信号采用特定的序列设计和帧结构，使其具有良好的自相关和互相关特性，便于接收终端进行精确的信号检测和时间测量。当第一终端发送出第一侧链路定位参考信号后，一个或多个第二终端会接收该信号并记录准确的接收时间。每个第二终端在接收到定位参考信号后，会启动相应的处理流程：首先测量自身的发送与接收信号时间差，这个时间差包含了信号在空中传播的时间以及设备内部的处理时延；然后分配专用的资源用于发送第二侧链路定位参考信号，该信号中包含了测量得到的时间差信息。第二侧链路定位参考信号的设计同样需要考虑抗干扰性和测量精度，采用与第一定位参考信号相似的物理层结构，但在内容上增加了时间差测量信息的承载字段。第一终端在发送完第一定位参考信号后，会监听预先配置的资源位置，接收来自第二终端的第二侧链路定位参考信号。通过解析这些信号，第一终端能够获取各第二终端测量得到的时间差信息。与此同时，第一终端也会基于接收到的第二定位参考信号测量自身的发送与接收时间差。这一测量过程需要精确的时钟同步和信号处理算法支持，确保纳秒级的时间测量精度。在获得多个终端的时间差测量值后，第一终端运用特定的定位算法计算各终端之间的相对距离。该算法综合考虑信号的传播特性、设备时钟偏差以及测量误差等因素，通过最小二乘法或最大似然估计等数学方法求解终端的位置坐标。在技术实现细节方面，侧链路定位参考信号采用基于ZC序列的参考信号设计，该序列具有恒幅零自相关特性，能够提供优异的测距性能。资源分配机制支持半静态配置和动态调度两种模式，适应不同的业务需求和应用场景。时间差测量过程采用多符号联合检测技术，通过多个信号符号的相干积累提高测量精度。定位解算算法还引入了误差修正机制，针对多径传播、非视距传输等影响因素进行补偿，进一步提高定位结果的可靠性。与现有技术相比，本发明的技术优势主要体现在四个方面：首先，通过终端间直接通信实现定位，减少了对基站基础设施的依赖，适用于网络覆盖盲区的定位需求；其次，采用往返时间测量原理，避免了终端间严格时钟同步的要求，降低了系统复杂度；再次，通过多终端协同测量和联合解算，提高了定位精度和鲁棒性；最后，整个定位流程与现有通信协议保持兼容，无需对网络架构进行重大改动即可部署实施。这种侧链路定位方法特别适合车联网中的车辆间定位、工业物联网中的设备追踪以及公共安全场景下的应急救援等应用。在车联网中，车辆可以通过相互之间的定位准确感知周边车辆的位置和运动状态，为自动驾驶和辅助驾驶提供决策依据；在工业物联网中，设备之间的精确定位可以实现智能仓储、生产流程优化等应用；在应急救援场景下，救援人员设备之间的直接定位可以在通信基础设施受损的情况下仍然保持位置感知能力。本发明的实施不需要特殊的硬件支持，现有的5G及后续版本的终端设备通过软件升级即可支持所述定位功能。定位过程可以与正常的通信业务并行进行，通过合理的资源分配避免对通信质量造成影响。此外，该方法还支持与卫星定位、基站定位等其他定位技术的融合，形成多源定位解决方案，在各种环境条件下都能提供可靠的位置服务。随着5G-Advanced和6G技术的持续演进，这种基于侧链路的定位技术将与感知通信一体化、人工智能等新技术深度融合，为未来移动通信系统提供更加智能、精准的定位服务能力。\n",
    "专利名": "无线通信系统中的侧链路定位方法和设备"
  },
  {
    "编号": 10,
    "专利底稿": "数字资产作为企业及个人的重要财产形式，其种类和数量呈现爆炸式增长。狭义的数字资产特指基于区块链技术的代币化资产，这些以计算机程序形式存在的资产可以通过代码交换实现价值转移。然而，面对日益增长的数字资产规模，传统搜索方法暴露出明显的技术缺陷：一方面缺乏有效的大数据处理能力，难以对分散在不同存储系统中的海量数据进行全面整合；另一方面由于缺少智能识别机制，搜索结果准确度较低，严重影响了数字资产的管理和使用效率。为解决上述技术难题，本发明提出了一种创新的数字资产搜索方法，该方法通过五个核心步骤构建完整的搜索处理流程。首先在数据采集与整合阶段，系统从多个异构数据源同步收集数字资产数据，这些数据源涵盖文件系统、数据库和云存储平台等不同类型的存储环境。为了保证数据质量，系统采用分布式数据处理技术进行数据清洗，自动识别并去除重复数据项、修正错误数据格式、过滤无关信息，确保进入搜索系统的数据具有高度的一致性和准确性。完成清洗的数据通过分布式存储架构进行保存，根据数据结构特点分别采用适合结构化数据和非结构化数据的存储方案，为后续搜索操作奠定坚实的数据基础。在索引构建阶段，系统部署分布式搜索引擎为核心组件，运用机器学习技术建立高效的数据索引模型。该索引模型不仅考虑数字资产的基本属性特征，还深入分析资产之间的语义关联关系，形成多维度、多层级的索引结构。通过分布式计算框架的并行处理能力，系统能够快速完成对海量数字资产数据的索引建立，即使面对亿级数据规模也能保证索引构建的时效性。这种智能索引机制为后续的高效检索提供了核心技术支撑。在搜索精准度提升环节，系统采用三重技术保障机制。第一重机制基于自然语言处理技术，对文本类数字资产进行深度语义分析，自动提取关键词语和核心概念，并为每个资产打上标准化标签。这些标签不仅包含资产的基本描述信息，还涵盖其业务属性、使用场景等扩展特征，形成完整的标签体系。第二重机制运用深度学习算法，特别是卷积神经网络和循环神经网络的组合模型，分别处理图像、音频和文本等不同形态的数字资产。对于图像资产，系统通过卷积神经网络提取视觉特征；对于音频资产，利用循环神经网络分析声学模式；对于文本资产，则结合两种网络类型理解语义内容。第三重机制专注于元数据管理，系统自动记录每个数字资产的创建时间、修改记录、所有权信息等元数据，并通过智能注解系统补充资产的内容描述，这些元数据与内容特征共同构成完整的资产画像，极大提升了搜索引擎对资产内容的理解深度。在个性化搜索实现方面，系统引入大数据分析技术构建用户行为分析模型。通过持续收集和分析用户的搜索历史、点击行为、停留时长等交互数据，系统能够逐步建立精准的用户兴趣画像。基于这些画像数据，搜索算法动态调整排序策略，将更符合用户需求的搜索结果优先呈现。同时，系统还利用协同过滤等推荐算法，发现用户可能感兴趣但未明确搜索的数字资产，实现主动式的智能推荐。为了保障搜索性能，系统采用并行化处理架构，将大型搜索任务分解为多个子任务在计算集群中并行执行，显著缩短了搜索响应时间。在安全与隐私保护层面，系统实施全方位的数据安全措施。所有数据访问请求都经过加密通道传输，敏感数字资产采用分级授权机制，确保只有经过认证的用户才能访问相应权限级别的资产内容。系统还建立完善的访问日志记录和审计功能，实时监控异常访问行为，及时发现和防范安全风险。此外，系统提供数据可视化展示功能，通过图表、仪表盘等直观形式呈现搜索结果分析报告，帮助用户更好地理解和利用搜索到的数字资产。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过分布式架构解决了海量数字资产数据的存储和处理难题；其次，融合多种人工智能技术实现了搜索精准度的显著提升；再次，基于用户行为分析提供个性化的搜索体验；最后，建立完善的安全机制保障数字资产的访问安全。这套系统特别适用于金融机构、知识产权管理机构、大型企业等需要管理大量数字资产的组织，能够有效提高数字资产的检索效率和使用价值。在实际应用场景中，系统可以部署为云端服务或本地化解决方案，支持与现有的数字资产管理系统无缝对接。通过持续的学习和优化，系统能够不断适应数字资产形态的变化和用户需求的发展，为数字经济发展提供重要的技术支撑。",
    "专利名": "一种基于大数据的数字资产搜索方法"
  },
  {
    "编号": 11,
    "专利底稿": "大语言模型作为当前自然语言处理领域的核心技术，能够基于输入的文本数据生成相应的回复内容，并在文本分类、情感分析、信息抽取等多种任务中展现出强大能力。然而，如何准确评估大语言模型在文本分类任务中的性能表现，一直是业界面临的重要技术难题。现有评测方法通常仅通过设置单一的文本分类任务来考察模型性能，这种粗粒度的评测方式存在明显局限性：它无法深入揭示模型在文本理解、信息提取和内容概括等基础能力上的真实水平，导致评测结果的准确性和参考价值受到限制。为此，本发明提出了一种全新的多层次评测方案，通过分解文本分类任务的核心能力要素，建立更加全面、细致的评测体系。该方法的实施主要包括四个关键阶段：首先需要构建多层次的评测数据集。系统不仅收集针对文本分类任务的源评测数据集，还专门准备对应多个子评测任务的数据集，这些子任务至少包括实体识别任务和摘要生成任务。每个数据集中都包含经过精心挑选的评测文本，并且为每个文本提供了对应不同任务类型的标注答案。这些标注答案由领域专家按照统一标准制作，确保评测基准的准确性和权威性。数据集的设计充分考虑了文本难度、领域分布和任务特性的多样性，能够全面覆盖模型在实际应用中可能遇到的各种场景。在数据准备阶段，系统采用严格的质量控制流程，对评测文本进行多轮校验和清洗，确保数据的质量和一致性。接下来是预测答案生成阶段。系统根据评测文本及其对应的任务类型，构造符合大语言模型输入格式要求的评测输入数据。这些输入数据经过精心设计，既包含清晰的任务指令，又提供必要的上下文信息，确保模型能够准确理解评测要求。将构造好的输入数据送入待评测的大语言模型后，系统收集模型的输出结果作为预测答案。在这个过程中，系统会记录模型的处理时间、资源消耗等运行指标，为全面评估模型性能提供补充数据。为了保证评测的公平性，所有预测答案的收集都在相同的硬件环境和参数设置下进行。第三个阶段是评测结果计算。系统分别针对每个任务类型，将模型输出的预测答案与专家提供的标注答案进行对比分析。对于文本分类任务，系统计算模型的分类准确率、精确率、召回率和F1值等指标；对于实体识别任务，评估模型在命名实体识别和关系抽取等方面的表现；对于摘要生成任务，则采用ROUGE、BLEU等自动评价指标结合人工评估的方式，衡量生成摘要的质量。通过这些多角度的量化分析，系统得到对应源评测任务的源评测结果和对应各个子评测任务的子评测结果。这些结果不仅包含具体的数值指标，还提供错误分析和案例展示，帮助使用者深入理解模型的表现特点。最后是综合性能评估阶段。系统将源评测结果与各个子评测结果进行集成分析，通过加权汇总、多维度对比等统计方法，得出对大语言模型文本分类性能的全面评价。这种综合评价不仅考虑模型在文本分类任务上的直接表现，还关注其在实体识别、摘要生成等基础任务上的能力水平，从而更加准确地反映模型的真实性能。评价结果以可视化报告的形式呈现，包括雷达图、柱状图等多种展示方式，便于使用者直观理解模型的优势与不足。与现有技术相比，本发明的优势在于突破了单一任务评测的局限性，通过多层次、多角度的评测体系，更加深入地揭示大语言模型在文本分类任务中的真实能力水平。该方法不仅能够提供更加准确、全面的性能评估，还能为模型的优化改进提供具体的方向指导。在实际应用中，本方法可广泛应用于大语言模型的研发测试、产品选型和性能监控等场景，为人工智能技术的发展提供重要的评测支撑。相应的，本发明还提供了一种大语言模型文本分类性能的评测装置，该装置包括获取单元、预测单元、处理单元和评测单元。获取单元负责管理多层次的评测数据集，确保数据的完整性和可用性；预测单元负责构造输入数据并获取模型的预测答案；处理单元负责计算各项评测指标；评测单元则负责生成最终的综合评价结果。这些单元协同工作，形成一个完整的自动化评测系统。此外，本发明还可以通过电子设备实现，包括至少一个处理器和与处理器通信连接的存储器。存储器存储有可执行指令，当指令被处理器执行时，使得处理器能够实现上述评测方法的所有步骤。同时，本发明还涉及存储有相应计算机指令的非瞬时计算机可读存储介质，以及包含相应计算机程序的计算机程序产品。这些技术方案共同构成了一个完整的大语言模型文本分类性能评测解决方案，具有良好的实用价值和推广前景。",
    "专利名": "大语言模型的文本分类性能的评测方法、装置"
  },
  {
    "编号": 12,
    "专利底稿": "现代物流运输体系中，货运车辆承担着从生产地到仓储地的货物运输任务，如何实现对车辆运输过程的精准监管一直是行业关注的重点。现有技术主要依赖全球定位系统获取车辆位置信息，并通过行驶轨迹分析进行监管，如中国专利申请CN118278841A所示范的基于行驶轨迹的大件运输监管方法。然而，在实际应用中发现，由于城市峡谷、隧道遮挡、信号干扰等环境因素影响，定位系统获取的车辆位置数据往往存在偏差，这种偏差会随着时间累积而放大，导致监管系统无法准确掌握车辆的实际运行状态，进而影响运输效率和安全管控。针对上述技术缺陷，本发明提出了一种创新的多源数据融合监管方案。该方案的核心在于通过整合定位系统数据与车辆传感器数据，构建双重验证机制来提升行驶路径的准确性。具体实施过程包括以下几个关键环节：在车辆开始执行运输任务时，系统首先记录其在起始时刻的精确初始位置，该位置通常通过高精度定位设备在开阔场地采集获得，作为后续路径计算的基准点。随后，系统持续采集两个维度的实时数据：一方面通过车载定位系统获取车辆在目标时间段内的第一位置信息序列，这些位置点按照时间顺序连接形成第一行驶路径；另一方面通过车辆内置的速度传感器（包括陀螺仪和加速度计）采集行驶速度信息和方向信息，基于航位推算原理从初始位置开始计算形成第二行驶路径。在获得两条独立生成的行驶路径后，系统启动数据融合修正流程。该流程采用先进的路径匹配算法，首先对第一行驶路径与第二行驶路径中相同时刻的位置点进行相关性分析，计算每个位置点的匹配度评价值。对于评价值低于预设阈值的异常位置点，系统将其判定为定位偏差点，并采用插值修正策略，将这些异常点替换为与第二行驶路径对应点连线的中点位置。通过这种渐进式修正方法，既保留了定位系统数据的整体框架，又融入了传感器数据的局部精度优势，最终生成高可靠性的目标行驶路径。为进一步提升路径修正效果，系统还引入了基于最短路算法的优化机制。当检测到两条路径存在系统性偏差时，系统会识别第二行驶路径中与第一行驶路径不匹配的关键位置点，利用图论中的最短路算法生成经过这些关键点的最优路径，并将该路径段替换原有路径中的对应段，从而在保持路径连续性的同时消除累积误差。这种双重修正机制确保了最终得到的目标行驶路径与车辆实际行驶轨迹高度吻合。在路径计算过程中，系统对速度传感器的数据处理采用分时段积分方法。针对每个采样时刻，根据该时刻的行驶速度和方向信息，结合前一时刻的位置坐标，通过矢量运算得到当前时刻的推定位置。按照时间顺序将这些离散的位置点连接起来，就形成了基于航位推算的第二行驶路径。这种方法虽然会随时间产生一定的误差累积，但在短时间尺度内具有较高的相对精度，正好可以弥补定位系统可能出现的瞬时偏差。除了路径监控功能，系统还集成了运输安全预警机制。通过实时监测车辆加速度绝对值在预设时间段内的波动情况，当波动值超过安全阈值时，系统会立即向监管服务器发送预警信息。这种预警机制能够有效识别急加速、急刹车等危险驾驶行为，或者因道路条件恶劣导致的剧烈颠簸，为保障货物运输安全提供重要依据。在运输任务的关键节点管理方面，系统创新性地整合了集装箱锁智能控制功能。当系统确认车辆已到达运输任务指定的卸货位置时，会响应监管服务器发送的控制指令，自动将集装箱锁切换至解锁状态。在卸货作业完成后，系统在接收到卸货完成确认信息后，又会自动将集装箱锁恢复至锁定状态。整个开关锁过程中的时间戳和位置信息都会被详细记录并上传至监管服务器，形成完整的操作日志，实现了从运输到装卸的全流程闭环管理。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过多源数据融合技术有效克服了单一定位系统的局限性，显著提升了车辆位置监控的精度和可靠性；其次，基于实时数据分析的预警机制能够及时发现运输过程中的异常情况，防患于未然；最后，智能集装箱锁控制实现了运输环节与装卸环节的无缝衔接，提高了整体运营效率。这套系统可广泛应用于各类货运车辆的运输监管场景，特别是对运输精度要求较高的大件货物运输、危险品运输等专业领域。本发明的实施不需要对现有车辆进行大规模改造，只需加装相应的传感器模块和数据处理单元即可实现功能升级。系统采用模块化设计，可根据不同用户需求灵活配置功能组合。同时，系统还支持与现有的物流管理平台无缝对接，实现数据共享和业务协同。通过提供准确可靠的车辆位置信息和运输状态数据，本发明为物流企业优化运输路线、提高运营效率、降低运输风险提供了强有力的技术支撑，具有显著的经济效益和社会价值。相应的，本发明还提供了一种物流货运车辆运输监管系统，该系统包括处理器和存储器，存储器中存储有计算机程序指令，当这些指令被处理器执行时，能够实现上述监管方法的全部步骤。该系统可采用分布式架构部署，包括车载终端、通信网络和监管服务平台三个部分，共同构成完整的监管解决方案。此外，本发明还可以通过计算机可读存储介质形式进行实施，存储介质中包含的程序代码能够在各类计算设备上运行，实现本发明的技术方案。这些多样化的实施方式确保了本发明能够适应不同规模、不同需求的物流运输监管场景，具有良好的推广应用前景。\n",
    "专利名": "一种物流货运车辆运输监管系统及方法"
  },
  {
    "编号": 13,
    "专利底稿": "流水数据作为反映个人和企业财务状况、消费习惯及沟通模式的重要载体，其价值日益凸显。然而，由于这些数据通常以非结构化的文本形式存在，且来源多样、格式不一，使得传统的数据整合与分析方法面临巨大挑战。当前主流技术主要依赖正则表达式匹配、自然语言处理及机器学习算法来实现数据的自动提取与归类，但在实际应用过程中仍存在明显不足：正则表达式对于处理复杂多变的非标准化文本适应性较差，而自然语言处理技术在对文本隐含意义和上下文信息的深度理解方面尚有局限，这些都制约了流水数据处理的准确性和效率。为解决上述技术问题，本发明提出了一种基于多重映射与关联验证的流水数据管理方法。该方法首先从多个数据源获取原始流水数据，并对这些数据进行预处理，包括数据清洗与标准化操作，以消除噪声数据并统一数据格式。预处理后的数据进入核心处理流程，该系统通过结合正则表达式与智能关键字提取技术，识别每条流水数据的类型名称与详细类型信息。类型信息主要包括交易时间、交易对方、交易平台等关键字段，系统基于这些字段生成相应的映射值。在映射值生成过程中，系统采用分层策略：首先基于交易时间生成第一映射值，用于构建时间维度的数据关联；随后从交易对方或交易平台信息中提取稀缺关键字，通过哈夫曼编码算法计算每个关键字的权重值，选取权重最高的n个关键字生成第二映射值集合。这种双重映射机制既保证了时间序列上的连续性，又捕捉了数据间的语义关联。在完成映射值生成后，系统启动关联性验证流程。该流程首先根据第一映射值获取时间相邻的数据集合作为待比较数据集，然后将当前流水数据的第二映射值与该数据集中所有记录的 second 映射值进行相似度计算。相似度计算采用基于向量空间模型的匹配算法，当相似度超过预设阈值时，判定两条记录具有关联性。系统通过这种渐进式验证方式，能够准确识别属于同一业务场景或交易序列的流水数据组。对于通过验证的数据组，系统会进行交叉校验以评估识别准确性，并将验证后的完整数据集合存入关联性数据库。这种设计不仅提高了数据归类的准确性，还建立了数据间的内在联系，为后续的深度分析和应用提供了坚实基础。与现有技术相比，本发明的显著优势在于突破了单一技术的局限性，通过多重映射机制和关联验证策略实现了流水数据的高精度识别与汇集。该方法特别注重处理非标准化文本的能力，通过稀缺关键字提取和智能权重计算，有效捕捉了文本中的关键信息特征。同时，基于时间序列和语义特征的双重验证机制确保了数据关联的可靠性。在实际应用场景中，本方法可广泛应用于金融机构的交易监控、企业的财务管理和电信运营商的话单分析等领域，为用户提供更加清晰、有序的数据视图，支持精准决策和高效管理。相应的，本发明还提供了一种自动汇集流水数据的管理系统，该系统包括数据获取模块、逻辑判断模块和两个数据存储模块。数据获取模块负责从多源异构数据源采集流水数据；逻辑判断模块承担核心的处理任务，包括类型识别、映射值生成和关联性判断；两个存储模块分别用于缓存临时数据和存储验证后的关联数据。这些模块协同工作，形成一个完整的数据处理流水线。此外，本发明还可以通过终端设备实现，包括处理器和存储介质，存储介质中保存的程序指令被处理器执行时能够实现上述所有方法步骤。同时，本发明还涉及计算机可读存储介质和计算机程序产品等形式的技术方案，确保了技术实施的多样性和便利性。通过本发明的实施，用户能够获得比传统方法更高精度的流水数据识别结果，同时建立起数据间的内在关联网络，这不仅提升了数据管理的效率，还为后续的数据分析和业务应用提供了更丰富的可能性。该系统在实际测试中表现出优异的性能，特别是在处理复杂多变的非结构化流水数据时，其准确性和稳定性明显优于现有技术方案，具有重要的实用价值和推广前景。",
    "专利名": "自动汇集流水数据的管理方法与系统"
  },
  {
    "编号": 14,
    "专利底稿": "本发明旨在解决现有任务规划方法因受限于固定动作库而泛化能力不足的问题。随着大型语言模型在拟人化任务规划方面的能力日益凸显，相关研究已证实其能够利用内部知识进行常识推理并生成初步规划方案。当前主流任务规划方法主要包括四种类型：任务检索方法通过检索与给定任务相关的动作列表，由模型筛选排序生成规划；规划检索方法首先生成初始规划，再通过多轮重写优化结果；思维链方法逐步生成可能的后续步骤形成完整规划；深度优先搜索方法则在思维链基础上引入回溯机制。尽管这些方法能够产生在自然语言层面连贯合理的规划，但由于其生成的动作指令具有较高的自由度，往往缺乏可执行性，难以直接作为智能体的操作指南。为解决规划落地问题，现有技术在机器人控制、工具使用等特定领域尝试通过模型微调来提升性能，然而这种方法仅能使模型在有限动作库上执行规划。当任务领域扩展时，动作空间变得开放而复杂，现有方法的局限性便暴露无遗，难以应对急剧增长的复杂性挑战。针对上述技术瓶颈，本发明提出了一种创新的开放式映射规划范式。该方法的核心在于建立任务规划与可变动作库之间的动态映射机制，使大型语言模型能够基于开放领域的动作库生成可执行的规划方案。具体实施过程包括三个关键阶段：首先进行跨领域数据整合，将日常生活、工具使用、机器人控制等一个或多个领域的数据按照统一格式进行标准化处理。数据分为任务数据和动作库数据两部分，其中任务数据包含规划任务描述和人工撰写的参考步骤，每个参考步骤都对应动作库中的具体可执行动作，由此构建出高质量的开放式映射规划数据集。数据集还可进一步补充完成任务的方法提示、文件名和类别层级等元信息，为模型训练提供更丰富的上下文。其次设计检索重写流程框架，该框架采用迭代优化策略实现规划方案与动作库的精准匹配。流程初始阶段为大型语言模型配置四项输入要素：规划任务描述、当前步骤序列、可用动作库以及需要生成的初始规划。模型首先标记出规划中不属于动作库的步骤，然后针对这些未匹配步骤在动作库中进行智能检索。检索过程中，模型将初步匹配的动作暂存于候选列表，经过综合评估后选择最合适的动作替换原步骤。这一检索替换过程循环进行，设置最多三次迭代次数，直到规划中的所有动作都来源于动作库或达到最大迭代限制，最终输出符合可执行要求的规划方案。最后基于构建的数据集和设计的流程对大型语言模型进行微调训练。通过让模型学习检索重写过程中的决策逻辑，使其掌握将抽象任务分解为具体可执行步骤的能力。经过微调的模型在接收待规划任务时，能够自动生成包含若干步骤的可行方案，且每个步骤都对应动作库中的实际可执行动作。与现有技术相比，本发明的显著优势体现在两个方面：一方面提出了开放式映射规划的新范式，使大型语言模型突破领域限制，具备在开放环境中将抽象任务映射到具体动作的能力；另一方面通过检索重写机制有效解决了规划与执行之间的鸿沟，经实验验证，该方法在日常生活领域表现出最优的规划性能，在工具使用和机器人控制等领域也展现出卓越的泛化能力。这种技术突破为智能代理在复杂环境中的自主决策与行动提供了可靠支撑，具有重要的理论价值和广阔的应用前景。相应的，本发明还提供了一种任务规划系统，该系统包含数据解析模块和微调的大型语言模型。数据解析模块负责多领域数据的标准化整合，构建统一格式的训练数据集；微调模型则负责处理具体规划任务，生成可执行的方案。该系统通过端到端的架构实现了从数据准备到规划生成的全流程自动化，可广泛应用于智能家居、工业自动化、服务机器人等场景，为不同领域的任务规划需求提供通用解决方案。\n",
    "专利名": "基于大语言模型开放式映射规划的任务规划方法及系统"
  },
  {
    "编号": 15,
    "专利底稿": "在现代社会，人脸识别技术已广泛应用于身份验证、安防监控和智能服务等领域，其通过分析面部生物特征实现个体身份认证的方式确实带来了诸多便利。然而，该技术在实际应用过程中仍然存在明显缺陷，特别是当攻击者使用打印照片、电子屏幕显示等非活体载体进行欺骗时，传统识别系统往往难以有效甄别，这就给安全防护体系带来了严重隐患。为解决这一技术难题，本发明提出了一种基于区块链存储与动态特征融合的双重防护机制。该方案首先通过引导用户进行脸部位姿调整来采集多角度面部信息，进而构建具有防伪特性的特征组合。具体实施过程包括六个关键环节：系统首先采集用户在初始脸部位姿下的第一人脸图像，该图像包含两个特征部位区域。通过分析图像中的光线异常特征，系统能够智能识别出受环境光线影响程度不同的面部区域，其中受光线影响较大的区域被标记为第二特征部位，受影响较小的区域则标记为第一特征部位。这一预处理步骤为后续的位姿调整指令生成提供了重要依据。在获得第一人脸图像的分析结果后，系统会触发脸部位姿调整指令。该指令的生成基于面部特征点的拓扑结构分析和光线异常特征评估，通过计算确定最优的脸部移动方向或转动角度。指令具体分为两种类型：脸部位置调整指令指导用户将面部向特定方向移动，以改变面部与光源的相对位置；脸部角度调整指令则引导用户转动头部，调整面部朝向角度。这些指令通过视觉或语音方式实时传达给用户，确保位姿调整的准确执行。当用户按照指令完成脸部位姿调整后，系统立即采集第二脸部位姿下的第二人脸图像。在这一新姿态下，原本受光线影响较小的第一特征部位可能变为受影响较大的第三特征部位，而原本受光线影响较大的第二特征部位则可能变为受影响较小的第四特征部位。这种光线影响程度的动态变化为后续的特征融合提供了重要基础。接下来系统执行核心的图像融合操作。将第一人脸图像中的第一特征部位与第二人脸图像中的第四特征部位进行融合，生成第一目标人脸图像；同时将第一人脸图像中的第二特征部位与第二人脸图像中的第三特征部位进行融合，生成第二目标人脸图像。这种交叉融合机制有效捕捉了面部特征在不同光线条件和观察角度下的稳定性特征，显著增强了系统对活体人脸的辨识能力。在特征匹配阶段，系统从分布式区块链节点中提取预先存储的人脸库图像。区块链技术的引入确保了比对数据的安全性和不可篡改性，有效防止了人脸数据库被恶意篡改的风险。系统分别计算人脸库图像与两个目标人脸图像的特征向量相似度：对于第一目标人脸图像，通过加权计算多个目标特征向量的相似度得到第一相似度值；对于第二目标人脸图像，采用相同方法计算得到第二相似度值。这些计算过程采用特定的数学公式，确保相似度评估的准确性和一致性。最后，系统根据加权计算得到的综合相似度值进行识别判断。通过为第一目标人脸图像和第二目标人脸图像分别分配合适的影响权重，系统计算最终的目标相似度值。当该值超过预设的相似度阈值时，判定人脸识别成功；反之则判定识别失败。这种双重验证机制大大提高了系统的安全性和可靠性。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过动态位姿调整和特征融合技术，有效区分活体人脸与静态照片，显著提升防伪能力；其次，利用区块链分布式存储特性，确保人脸特征数据的安全存储与传输；最后，采用多维度相似度评估算法，提高识别结果的准确性。这套系统可广泛应用于金融支付、门禁管理、移动设备解锁等需要高安全性能人脸识别的场景，为社会提供更加安全可靠的身份验证解决方案。相应的，本发明还提供了一种人脸识别系统，该系统包括存储器和处理器。存储器用于存储程序代码和相关数据，处理器则负责执行程序代码，实现上述人脸识别方法的各个步骤。该系统支持与其他安防系统的无缝对接，具有良好的扩展性和适应性。通过持续优化算法和更新特征库，该系统能够不断提升识别性能，满足日益增长的安全需求。\n",
    "专利名": "一种基于区块链的人脸识别方法及系统"
  },
  {
    "编号": 16,
    "专利底稿": "材料微观结构作为决定材料性能的关键因素，其精确表征对材料设计与性能优化具有重要意义。扫描电子显微镜作为观察材料微观结构的主要工具，其成像质量受到样品制备工艺、仪器参数设置和操作人员经验等多种因素影响，导致获得的灰度图像常常出现对比度不均、噪声干扰严重、特征边界模糊等问题。传统基于阈值分割和分水岭算法的图像处理方法虽然在某些理想情况下能够实现基本的分割效果，但在处理高温合金这类具有复杂晶界形态、不规则晶粒分布和致密微观组织的材料时，往往需要大量人工干预和专家经验，导致分析过程主观性强、效率低下且可重复性差。随着深度学习技术在计算机视觉领域的成功应用，基于卷积神经网络的图像分割方法为材料微观结构分析提供了新的技术途径。然而，现有的语义分割模型仅能实现目标与背景的分离，无法满足高通量材料研究中对多个微观结构实例进行独立识别和定量分析的需求；同时，这些模型在处理高噪声、低对比度的SEM图像时表现不佳，特别是对于尺寸微小、形态复杂的微观结构特征识别精度有限。针对上述技术难题，本发明提出了一种改进的Mask R-CNN实例分割框架，该框架通过多项技术创新实现了对高温合金微观结构的精确、高效分割。方法的实施包括四个核心阶段：首先进行数据集的构建与增强，收集大量高温合金扫描电子显微镜图像，采用VGG图像注释工具对图像中的微观结构区域进行精细标注，标注信息包括晶粒边界、析出相分布等关键特征。为了提高模型的泛化能力和鲁棒性，对原始图像进行了一系列预处理和增强操作，包括对比度增强、图像锐化、随机旋转和弹性变形等，有效扩充了训练样本的多样性。所有标注数据转换为JSON格式并按照标准比例划分为训练集、验证集和测试集。接下来构建改进的Mask R-CNN模型架构。该模型在传统Mask R-CNN基础上引入了三项关键改进：首先采用对比度限制自适应直方图均衡化技术对输入图像进行预处理，通过将图像分割为多个子区域，计算各区域的局部直方图并限制像素最大频数，然后利用累积分布函数进行灰度重映射，最后通过双线性插值实现子区域的无缝拼接。这一处理显著拓展了图像灰度级的动态范围，增强了局部对比度，使微观结构特征更加清晰可辨。其次，模型采用101层残差神经网络与特征金字塔网络相结合的特征提取架构，在多个尺度上提取微观结构的语义特征。区域建议网络在特征图上生成不同尺寸和比例的锚框，通过前景背景分类和边界框回归初步定位潜在的微观结构区域。然后使用ROI Align方法替代传统的ROI Pooling，避免特征图的空间量化误差，保持浮点数边界精度，将候选区域划分为k×k个单元并在每个单元内进行双线性插值计算，最终输出固定尺寸的特征图，有效保留了图像的边缘细节信息。第三项改进是在掩模预测分支之后引入边缘一致性约束机制。通过构建一个小型边缘检测子网络，将模型预测的分割掩模与真实标注掩模分别与Sobel算子进行卷积运算，Sobel算子包含描述水平梯度的横向滤波器和描述垂直梯度的纵向滤波器，卷积核尺寸为3×3×2。通过比较两个边缘图的差异，计算边缘一致性损失函数。模型的总体损失函数由四部分组成：分类损失L_cls采用交叉熵损失函数，边界框回归损失L_box采用平滑L1损失函数，掩模预测损失L_mask采用二进制交叉熵损失函数，边缘一致性损失L_edge采用Huber损失函数。总体损失函数表达为L_total = L_cls + L_box + L_mask + λL_edge，其中λ为平衡超参数。Huber损失函数的数学表达式为L_δ(a) = 1/2 a² for |a| ≤ δ, δ(|a| - 1/2δ) otherwise，其中a为预测边缘与真实边缘之间的差异，δ为阈值参数。这种复合损失函数设计使模型在保持高分割精度的同时，对边缘细节的拟合更加精确。在模型训练阶段，采用迁移学习策略，使用在MS-COCO数据集上预训练的权重作为模型初始参数，然后使用高温合金SEM图像数据集进行微调。训练优化器选择Adam算法，学习率调整策略采用阶梯式下降法，在训练过程中动态调整学习率以提高收敛效率和稳定性。经过充分训练后得到的材料微观结构实例分割模型能够同时输出每个微观结构实例的分割掩模和定位边界框，实现对晶粒尺寸、形状分布和空间排列的定量分析。在实际应用阶段，将待分析的扫描电子显微镜图像输入训练好的模型中，模型能够自动识别并分割出图像中的各个微观结构实例，输出精确的二进制掩模和标定矩形框。这些分割结果可直接用于后续的定量统计分析，包括晶粒尺寸分布计算、形状因子分析、空间分布特征表征等，为材料性能预测和工艺优化提供可靠的数据支持。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过改进的Mask R-CNN框架实现了对高温合金微观结构的实例级分割，克服了传统语义分割无法区分相邻实例的局限性；其次，引入自适应直方图均衡化和边缘一致性约束机制，显著提升了模型对低质量SEM图像的处理能力，特别是在高噪声、低对比度条件下的分割精度；最后，整套方法实现了从图像预处理到定量分析的全流程自动化，大大提高了材料微观结构分析的效率和客观性。该方法已在实际应用中验证了其有效性，对推动高通量材料研究的发展具有重要意义，为材料设计和性能优化提供了强有力的技术支撑。相应的，本发明还提供了一种基于改进Mask R-CNN模型的高温合金材料微观结构分割装置，该装置包括存储器和处理器，存储器中存储有可执行程序代码，处理器执行该代码时能够实现上述分割方法的所有步骤。该装置可集成于材料分析软件平台，为用户提供便捷的微观结构分析工具，具有广泛的应用前景和商业价值。\n",
    "专利名": "一种基于深度学习的高温合金微观结构分割方法及装置"
  },
  {
    "编号": 17,
    "专利底稿": "在当今人工智能技术快速发展的背景下，大型语言模型在文本生成任务中展现出强大能力的同时，也面临着模型幻觉这一严峻挑战。模型幻觉是指人工智能模型在生成文本内容时产生与客观事实不符的信息或陈述，这种现象在问答系统、内容创作等实际应用场景中尤为突出，严重影响了模型输出的可靠性和实用性。尽管现有技术尝试通过规则校验、知识库匹配等方式来缓解这一问题，但这些方法往往存在适应性差、覆盖范围有限等缺陷，难以从根本上解决模型幻觉问题。针对这一技术难题，本发明提出了一套完整的文本幻觉检测与修正方案。该方案首先通过智能提示工程技术生成优化的提示词模板，利用大语言模型自身的语言理解能力，从原始文本中准确识别和提取关键信息要素。这些关键词不仅包括实体名称、时间地点等显性信息，还涵盖隐含的语义关系和逻辑结构。系统随后基于提取的关键词构建精确的查询问题，这一过程引入了意图识别机制，通过专门设计的智能代理对用户真实需求进行深度分析，确保生成的查询问题能够准确反映待验证内容的核心要点。在证据收集阶段，系统采用多源异构的数据查询策略。一方面调用本地知识库中的结构化数据，另一方面通过应用程序接口接入各类权威的外部数据库和知识图谱，实现对相关信息的广泛采集。这种双管齐下的查询方式确保了证据来源的多样性和可靠性，为后续的幻觉检测奠定了坚实的事实基础。收集到的原始数据经过智能去重和一致性整合处理，系统会自动剔除重复信息，并对不同来源的冲突数据进行交叉验证与协调，最终形成结构清晰、内容准确的参考文本。核心的幻觉检测过程采用多层次的一致性验证方法。系统将待检测文本与经过验证的参考文本进行深度比对，通过语义相似度计算、逻辑关系分析和事实准确性评估等多个维度，精准定位文本中存在的幻觉部分。检测算法不仅关注表面的词汇匹配，更注重深层的语义一致性，能够识别出那些在表面上合理但实际上与事实相悖的内容。对于识别出的幻觉内容，系统不会简单地删除或替换，而是通过智能修复算法，在保持原文语义流畅性和连贯性的前提下，用经过验证的准确信息进行替代修正，确保修复后的文本既符合事实又不破坏原有的语言风格和表达意图。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过提示工程与意图识别的结合，实现了对文本关键信息的精准提取和查询问题的智能构建；其次，采用多源证据收集和智能整合机制，确保了参考信息的全面性和准确性；最后，基于深度学习的一致性验证和语义保持的修复策略，在消除幻觉的同时最大限度地保留了原文的语义信息。这套系统可广泛应用于智能客服、内容审核、学术写作辅助等多个领域，有效提升了大语言模型生成内容的可信度和实用价值。相应的，本发明还提供了一种文本幻觉检测装置，该装置包含关键词提取模块、查询问题生成模块、工具查询模块、事实证据收集模块、一致性验证模块和幻觉修复模块。这些模块通过协同工作，形成了一个完整的文本处理流水线。其中，关键词提取模块负责利用提示工程生成优化的提示词模板，并从文本中识别关键信息要素；查询问题生成模块基于提取的关键词构建精确的查询问题；工具查询模块通过大语言模型技术深入分析问题内容，确定最适合的查询工具类型；事实证据收集模块从多个来源接收数据，经过智能筛选和整合处理形成结构化的参考文本；一致性验证模块通过多维度比对定位文本中的幻觉部分；幻觉修复模块则负责对识别出的幻觉内容进行智能修正。整个装置采用模块化设计，具有良好的可扩展性和维护性。此外，本发明还可以通过电子设备实现，包括存储器和处理器。存储器用于存储计算机指令，处理器执行这些指令时能够实现上述文本幻觉检测方法的全部步骤。同时，本发明还涉及计算机可读存储介质，该介质中存储的计算机程序在被处理器执行时能够实现本发明的技术方案。这些多样化的实施方式确保了本发明能够适应不同的应用场景和系统需求。通过实际测试验证，本发明的技术方案在保持原文语义完整性的前提下，能够有效识别和修正大语言模型生成文本中的幻觉内容，显著提升了文本的事实准确性和可靠性。与传统方法相比，本发明具有适应性强、准确性高、易于维护等优点，为解决大语言模型的幻觉问题提供了切实可行的技术途径，具有重要的推广应用价值。",
    "专利名": "一种基于大语言模型的文本幻觉检测方法及装置"
  },
  {
    "编号": 18,
    "专利底稿": "在传统煤矿生产管理中，由于作业环境复杂、设备系统繁多、安全风险高等特点，普遍存在监测效率低下、设备管理困难、事故预防能力不足等问题。传统人工监测方式不仅响应速度慢，而且容易因人为因素导致数据记录错误或预警延迟。随着信息技术的发展，智能化已成为煤矿行业转型升级的必然趋势，然而现有技术方案在数据整合、实时控制和系统运维等方面仍存在明显不足，难以满足现代化煤矿生产对效率与安全的双重需求。针对上述技术缺陷，本发明提出了一套完整的智能化监测管理系统解决方案。该系统采用分层架构设计，包含智能化综合管控平台、智能控制策略体系和运维监控系统三大核心模块。在具体实施过程中，首先通过详细的需求分析阶段明确煤矿生产管理的具体需求，确定系统需要实现的生产过程监控、设备状态管理、安全预警和决策支持等功能目标。随后进入系统设计阶段，构建基于云计算与大数据技术的综合管控平台，该平台采用模块化与组件化设计理念，便于后续功能扩展和维护升级。平台集成地理信息系统实现矿区数据的可视化展示，结合三维数字孪生技术建立矿山的虚拟映射，实时反映实际生产状态。同时设计多源异构信息数据共享机制，打破传统的数据孤岛现象，实现各类信息的有效整合。在智能控制策略方面，系统通过部署先进的传感器网络和通信设备，实现对煤矿生产全过程的实时监测与远程控制。这些传感器持续采集环境参数、设备运行状态和生产指标等数据，通过物联网技术传输至中央处理平台。系统具备故障自我诊断能力，能够自动识别设备异常并生成维护建议，大幅提高设备维护效率。同时采用自适应控制算法，根据实时生产环境和设备状态动态调整控制参数，优化生产流程。在运维监控层面，系统采用分布式存储架构确保数据安全，通过负载均衡技术提升系统响应速度。建立实时监控与报警机制，对关键设备和生产环节进行不间断监测，一旦发现异常立即启动预警程序。同时配备完善的系统恢复与备份功能，确保在突发情况下能够快速恢复生产。系统的核心功能体现在五个维度：监测实时化通过传感器网络实现生产数据的秒级采集与传输；管理信息化将各类数据、信息和图像整合为统一的3D可视化界面，提供达标率分析、能效分析、故障分析等全面的生产分析工具；业务流转自动化采用电子化审批和记录方式，优化业务流程执行效率；知识模型化建立煤矿生产知识库，将实践经验转化为可复用的决策模型；决策智能化基于大数据分析和人工智能技术，对生产数据进行深度挖掘，为管理人员提供科学的决策支持。在实施过程中，需进行专业的设备选型与部署，选购符合煤矿防爆标准的智能化设备并完成安装调试。随后进行数据集成与平台搭建，整合现有各类数据资源，构建统一的信息化管理平台和数据中心。系统测试阶段需对各项功能进行全面验证，确保系统稳定运行，并根据测试结果进行针对性优化。同时开展人员培训工作，使煤矿员工掌握系统操作和维护技能。最后建立持续改进机制，根据生产需求变化和技术发展持续升级系统功能。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过实时监测与智能控制相结合，显著提高了生产效率，系统能够自动调整设备运行参数，减少人工干预，同时通过数据分析提供优化建议；其次，在安全保障方面，系统能够及时发现瓦斯浓度超标、设备故障等安全隐患，自动启动应急处理流程，并实时追踪矿工位置状态，大幅提升安全生产水平；最后，在成本控制方面，系统通过预防性维护减少设备停机时间，优化生产流程降低能耗，实现精细化成本管理。实际应用表明，该系统能够有效解决传统煤矿管理中的资源浪费和生产效率低下问题，为煤矿企业的智能化转型提供可靠的技术支撑。该系统已在实际煤矿生产环境中得到验证，表现出良好的稳定性和实用性。通过云计算与大数据技术的结合，系统能够处理海量生产数据，为管理决策提供科学依据。模块化设计使得系统可以根据不同煤矿的特定需求进行灵活配置，具备广泛的适用性。三维数字孪生技术的应用为管理人员提供了直观的生产状态展示，大大提升了管理效率。随着技术的不断发展，该系统还可进一步集成人工智能算法，实现更高级别的自主决策和优化控制，为煤矿行业的可持续发展提供持续动力。\n\n",
    "专利名": "一种煤矿生产智能化监测管理系统"
  },
  {
    "编号": 19,
    "专利底稿": "为解决武器装备领域中单实体重叠和实体对重叠的复杂三元组的抽取问题，提出了挂载武器装备领域知识结合多轮对抗攻击的复杂三元组抽取方法(RDA)，该方法通过武器装备领域微调后的Bert获取更具领域语义的文本向量；利用在嵌入层发起多轮对抗的方式，实现模型层面的数据增强，减少模型对标注样本规模的依赖；采用单层指针网络获取头实体对头实体的类别进行判定，利用维基百科知识库对武器装备领域的实体类别解释信息的向量，对武器装备类别信息以字为最小粒度进行融合，缓解分层标注的天然缺陷；最后在横纵两个维度基于不同粒度的序列标注实现复杂三元组的抽取。在武器装备领域的数据集上精准率达到88.54%，召回率达到75.88%，F1值达到81.72%，取得了SOTA效果。实验表明提出的RDA方法对武器装备领域的信息利用更加充分，有效地缓解武器装备领域遇到的单实体重叠问题(SEO)和实体对重叠(EPO)问题。该模型主要由文本嵌入层模块、结合多轮对抗头实体识别器，武器装备知识库模块、关系尾实体识别模块四个部分组成。文本由文本嵌入层模块进行序列化之后投入结合多轮对抗攻击的头实体识别器将其识别为头实体或尾实体，再通过武器装备知识库模块，针对不同的头实体类型，根据维基百科中定义或者解释获取到描述该类型的句子解释向量。然后以字为最小粒度进行信息融合。最后进入到关系尾实体识别模块，同样是将任务细化为两个子任务：指定关系对应的尾实体头识别和尾识别。不同的是，本体设计中涵盖的所有关系将会与主语识别器的成果进行运算，挖掘主语与所有可能的关系。RDA方法采用的文本向量化的技术是BERT模型，通过在海量文本上进行无监督预训练（Pre-training），然后在特定的下游任务数据上进行微调（Fine-Tuning），BERT在多项自然语言处理任务中都表现突出。内部采用多层Transformer作为其编码结构，相比基于时间序列的循环神经网络，BERT具有更强的上下文语义信息捕获能力，蕴含了更为丰富的句法、语义和上下文信息。\n首先对token进行开展Embedding,其中包含了三部分：第一部分Token Embedding是词向量或者字向量，使用CLS标记以更为公平地融合句子中的每个token语义，用于后续的分类任务；第二部分Segment Embedding是因自编码的语言模型的NSP（Next Sentence Prediction）子任务需要区别两个句子，在RDA方法的模型中中默认为零；第三部分Position Embeddings是为保证脱离了RNN时序系列模型的位置约束后，引入位置嵌入信息以适应自然语言的时序性。为规避三角函数的对偶性无法区分方向的缺陷，并非采用TRM的位置嵌入信息方式，而是通过学习参数获取。然后经过12层的TRM模块，使用自编码方式结合自注意力机制对文本的双向上下文以获取向量。\n文本嵌入层的输入视为字符序列化， ,从输入token序列到向量序列的过程如公式1所示。\n其中表示输入经过BERT预训练模型得到的向量序列， 表示输入序列X的 Token Embedding，表示输入序列的Segment Embedding，表示输入序列的Position Embedding，“[0]”代表经过BERT然后取出零号向量。\n3.2结合多轮对抗攻击的头实体识别器\n提出了将多轮对抗攻击。融入到头实体识别器中的方法，可以提高头识别器投喂在下阶段的信息困惑度，以此提高模型的识别能力。\n3.2.1多轮对抗攻击RDA的对抗攻击的生成方式为Fast Gradient Method（FGM）[14]，其原理如公式3、4所示。(3)其中，代表模型参数，代表原始的输入样本，代表gold label，代表损失函数，代表对求梯度(4)其中，代表攻击扰动样本，代表对抗攻击强度系数，g代表梯度。FGM为更加严格地对梯度的方向进行保留，采取使用L2归一化技术对梯度进行修正。多轮对抗攻击流程伪代码如表1所示。\n表1  多轮对抗攻击算法伪代码\nTable 1  Multiple rounds of anti-attack algorithm pseudocode\n算法1：多轮对抗攻击算法\n输入：模型参数、样本, gold label ,损失函数\n超参数：多轮对抗攻击强度系数\n循环：\n1：根据每个计算前向传播,求得loss，开展反向传播求得梯度；\n2：根据Embedding矩阵的梯度，结合强度系数的宏观调控计算得出，累加至Embedding上；\n3：对新的Embedding进行前向传播求loss，反向传播获取对抗攻击后的梯度，累加至1上；\n4：将Embedding恢复至1时的状态；\n5：根据3的梯度对参数进行更新\n终止条件：模型所用的Batch耗尽，或者早停条件获得触发。\n输出：经过多轮对抗攻击后拥有更佳鲁棒性的模型\n3.2.2头实体识别器\n一般的头实体识别任务是使用一个线性层分类器获取到实体的开头和结尾，再结合最近原则进行匹配。如图3所示，提出的RDA方法采用在嵌入层然后接入由S、E两个识别层构成的头实体识别器，将其任务分开：一个只处理当前token是实体头的概率（S识别层）；另一个只处理当前token是实体尾的概率（E识别层）。采用与正态分布关联密切且计算量较小的Sigmoid激活函数对每个识别层的概率进行激活，数值代表该token在S识别层或者E识别层中被判定为实体头或者实体尾的概率，阈值设定为0.5。头实体识别器原理如公式5、6所示。\n     (5)\n    (6)\n其中，和分别代表了S识别层和E识别层的输出序列，对应了token序列成为实体头、实体尾的概率，代表由嵌入层的多层TRM Block叠加层运算获取到的向量并经过多轮对抗攻击后生成的样本。\n3.3武器装备知识库模块\n在本模块，使用维基百科作为武器装备类型的外部知识库。针对不同的头实体类型，根据维基百科中定义或者解释获取到描述该类型的句子解释向量。然后以字为最小粒度进行信息融合。Type信息融合模块工作原理如公式7、8所示。\n  (7)\n 其中，代表类别Type对应的句子解释向量，Wiki表示维基百科，entity表示上节的结合多轮对抗攻击的头实体识别器的成果。\n  (8)\n 其中，代表第个token的向量，和分别代表经过多轮对抗攻击的向量和句子解释向量，本文采用加法对不同特征空间的向量进行语义融合，最终获取到挂载武器装备领域知识库和对抗攻击生成的样本融合向量。\n3.4关系尾实体识别模块\n如图3所示，关系尾实体识别模块同时识别尾实体和与其归属的本体设计中包含的关系。其结构与头实体识别器类似，同样是将任务细化为两个子任务：指定关系对应的尾实体头识别和尾识别。不同的是，本体设计中涵盖的所有关系将会与主语识别器的成果进行运算，以获取主语与所有可能的关系的挖掘。本模块的运作原理如公式9和10所示。\n  (9)\n  (10)\n 其中，和分别代表第个作为尾实体头部和尾部的概率，代表头实体识别器识别的第个头实体整体序列。代表在头实体识别器部分中对S识别层和E识别层的结果求均值获得的向量。",
    "专利名": "一种面向武器装备领域的复杂三元组抽取方法"
  },
  {
    "编号": 20,
    "专利底稿": "为了解决航空遥感图像目标尺寸小、角度不固定、方向多变、检测难度大的问题，提出了一种面向航空遥感图像的两阶段旋转目标检测方法。首先，设计矩形可变形卷积替换卷积神经网络中的一般卷积，目的是更好地适应遥感图像目标的几何变换。之后，在特征金字塔网络中加入了高级和低级特征融合模块并应用子像素卷积生成高分辨率特征图，以检索尺度较小的目标。最后，在分类和回归分支分别使用适配网络，进一步加强感兴趣区域特征的判别力。在3个公开的航空遥感图像数据集DOTA v1.0、HRSC2016和FAIR1M 1.0上进行了实验，结果表明，提出的方法相比于现有方法获得了更好的检测性能，均值平均精度分别达到了77.18%、90.50%和46.72%。所提出的旋转目标检测框架如图1所示。采用两阶段目标检测网络，首先将图片输入到带有矩形可变形卷积的主干网络和带有特征融合模块的特征金字塔网络中进行特征提取，之后网络第一阶段的旋转候选区域生成网络根据提取到的特征生成旋转的候选区域框，接着将旋转的候选区域框与特征进行RoI对齐，输入到网络第二阶段的旋转检测头中，通过分类特征适配网络和回归特征适配网络对特征进行细化学习，最终通过分类和回归得到旋转的检测框。后续，将在每一节中详细介绍各个模块。可变形卷积[25]是卷积神经网络的变体，它可以根据输入特征图的内容自适应地调整卷积核的位置和形状，从而更好地捕捉物体的形变和细节。传统的卷积结构可以被定义为\n其中是特征图的每一个点，与卷积核中心点对应，是卷积核的每一个位置。\n可变形卷积是在传统卷积核的基础之上为每个点引入了一个可学习的二维偏移量（x、y轴方向上的偏移），使得卷积核可以在不规则的网格上进行卷积操作，而不是固定的方形网格，可变形卷积被定义为\n所提出的矩形可变形卷积同样对传统卷积核进行了改进。通过修改生成的可学习的二维偏移量，使得最后的卷积核形状为旋转矩形，而不是任意的不规则形状。使用矩形可变形卷积，可以更好地适应遥感图像中目标的几何变换，使得卷积区域始终紧密覆盖在物体形状周围，可以更好地提取目标物体特征。与传统卷积相比，矩形可变形卷积可以减少对背景等无效信息的学习，从而提高特征的表示能力和最终的目标检测性能。与可变形卷积相比，矩形可变形卷积拥有更少的可学习参数，可以提高卷积的效率。因此，使用所提方法生成的矩形可变形卷积更适用于遥感图像中的旋转目标检测任务。\n具体来说，对于卷积核大小为3的卷积，设其9个采样点的集合为，\n首先生成左上角和右上角的点，即，的2个可学习的偏移，然后将的偏移加至左下角（）、将的偏移加至右下角（）使其成为一个平行四边形ABCD，之后将该平行四边形沿其较短的对角线将其拉伸成为一个矩形，计算新生成的矩形的两个顶点E和F的坐标和矩形的中心点坐标，如图3（b）所示。重新调整周围四个角点（，，，）的偏移，使得偏移后为矩形的四个角点A、E、C、F；调整卷积核中心点的偏移，使其偏移到矩形中心点，如图3（c）所示。计算上下左右四个点到矩形四条边的中点的偏移。最终生成的偏移如图2（b）所示。对于卷积核大小为3的卷积，网络只需要学习4个偏移值，而不是18个，其余的可以通过计算得出，从而降低可变形卷积参数量，在所提出的方法中，将该可变形卷积加入到了视觉主干网络中。具体来说，使用该可变形卷积替换ResNet50和ResNet101的第二、三、四阶段中瓶颈块的3×3卷积，以增强特征的表达能力和感受野。可变形卷积可以自适应地调整卷积核的形状和位置，以适应不同的输入特征，从而提高特征的多样性和鲁棒性。\n1.2  多尺度特征融合\n多尺度融合是一种在计算机视觉中常用的技术，它可以利用不同尺度和语义强度的特征来提高图像处理的性能，例如目标检测、图像分割等任务。多尺度融合的主要目的是为了解决检测或分割任务中目标大小和形状多样的问题，以增强特征的语义信息。\n特征金字塔网络（FPN[27]）是目标检测任务中用于检测不同尺度目标的基本组件，具有横向连接的自顶向下的架构，在所有尺度上构建高级语义特征映射。PANet[17]在FPN的自顶向下的路径之后又添加了一个自底向上的路径，以弥补FPN高层特征中低层特征细节的不足。所提出的方法在PANet的基础之上进行了修改，提出了融合特征金字塔（FFPN，fusion feature pyramid network）。FFPN中使用了3个高级特征与低级特征融合的模块（HLFFM，high-level and low-level feature fusion module）来替换PANet自顶向下的路径。为了有效地检索高分辨率特征图，该模块集成低级和高级特征来提取不同粒度特征并采用子像素卷积[28]进行上采样生成高分辨率的特征图。\n所提出的高级和低级特征融合模块如图4所示。首先，对高级特征执行最近邻插值上采样；将1×1卷积应用于低级特征。其中，高级特征为网络更深层的输出或HLFFM的输出，低级特征为网络较浅层的输出。之后将高级与低级特征进行连接，使用子像素卷积生成更高分辨率的特征图。最后，使用3×3卷积细化输出。计算过程表示为\n其中表示HLFFM的输出。设图像经过主干网络得到的特征由浅层到深层依次为，3个HLFFM的计算过程可以表示为\n其中表示第i个HLFFM的输出。适配网络[29]被提出时是在自然语言处理领域，即在每个Transformer[21]层内额外插入一个轻量级模块[30]。一个适配网络通常由一个降维的全连接层，一个非线性激活函数，一个升维的全连接层和一个残差连接组成。\n所提方法，将两个特征适配网络分别用于目标检测头的分类分支和回归分支，两个适配网络分别用于增强和细化相应分支的特征，且不共享权重。特征适配网络示意图如图5所示。具体来说，将之前根据图像特征和候选区域框通过旋转感兴趣区域对齐得到的特征记为，将分别输入分类适配网络和回归适配网络，之后得到的新的分类特征和回归特征分别用于后续类别分类和检测框回归。表示如下，\n其中，，，为适配网络中可学习的参数。\n特征适配网络全连接层的降维和升维的操作可以帮助网络聚焦于更重要和更具有判别力的特征，减少冗余信息和噪声的干扰。通过这种方式，网络可以更好地学习到目标的关键特征，从而提升性能。同时，特征适配网络的残差连接允许网络跨层直接传递信息，有助于减轻梯度消失问题和提高信息流动性。通过残差连接，网络可以更好地利用之前层次的信息，避免信息在传播过程中的丢失，帮助网络更好地学习到图像中的细微特征和上下文信息。\n",
    "专利名": "一种基于矩形可变形卷积的遥感图像目标检测方法"
  },
  {
    "编号": 21,
    "专利底稿": "为挖掘细粒度图像在不同粒度下的细节纹理信息，关注层次特征之间的关系，提出了一种融合多尺度信息和特征映射关系的层次多粒度图像分类方法。首先提取骨干网络的中级语义特征作为图像在不同类别粒度下的局部细节特征，并与对应类别粒度的高级语义特征进行融合。然后使用特征映射算法表示类别层次之间的映射关系，对各层次的多粒度特征进行融合。最后，还提出重排序分类损失(re-ordering classification loss, RCL)来提升各层次类别的分类准确度，利用类别中心三元组损失(triplet center loss, TCL)在细粒度特征空间中将对象与其类中心的距离尽可能拉近，拉远与不同类中心的距离。在CUB-200-2011、FGVC-Aircraft和Stanford Cars三个数据集上进行的评测结果表明，所提算法的细粒度图像分类性能分别达到88.8%、94.2%和95.1%，加权平均精确率(wAP)分别达到90.4%、95.1%和95.1%，充分体现了所提方法在层次多粒度图像分类任务上的有效性和先进性。层次多粒度图像分类模型框架\n层次多粒度图像分类模型包含三个部分：特征编码阶段、多尺度特征提取与融合阶段和层次特征映射阶段。特征提取阶段为现有方法，本文使用Resnet-50作为特征提取的骨干网络。多粒度提取融合阶段和层次特征映射阶段都是本文的贡献部分。\n特征编码阶段本文使用在ImageNet-1K上预训练后的Resnet-50[22]作为骨干网络。取Resnet-50的第3块得到的特征图作为中级语义信息。取Resnet-50的第4块得到的特征图作为高级语义信息，其中C、W和H分别表示骨干网络Resnet-50的第4块特征图的通道数、宽和高。上述两个特征图分别代表了不同尺度的信息，分别作为多粒度提取融合阶段的输入。\n多尺度特征提取与融合阶段获得多尺度信息的特征图后，使用粒度信息提取模块来提取不同层次粒度的特征向量。每个粒度信息提取模块是相互独立参数不共享的，它们针对不同尺度的特征图进行不同层次粒度的特征向量提取。如图1所示，高级语义特征图经过粒度信息提取模块得到各个层次的粒度特征向量，其中i=1,2,3；i值越大粒度越细。中级语义特征图经过粒度信息提取模块得到各个层次的粒度特征向量，其中i=1,2,3。粒度信息提取模块是由逐通道卷积层、逐点卷积层、批归一化层(batch normalization, BN)、ReLU激活函数组成，得到各个层次的粒度特征向量：\n其中，表示层次粒度的第层， 表示先通过逐通道卷积层，再通过批归一化层，最后经过ReLU激活函数。表示先通过逐通道卷积层，再通过批归一化层，最后经过ReLU激活函数。\n然后，根据不同层次粒度，将得到的中级语义特征向量与高级语义特征向量两两组合得到多尺度信息融合特征\n其中，Concat(a, b)表示将向量a和向量b进行拼接操作。将得到的各个层次的多尺度融合特征向量分别作为层次特征映射阶段的输入。层次特征映射阶段\n为了关注融合多尺度信息后的各个层次特征向量之间的关系，将多尺度特征提取与融合阶段得到的特征向量输入到层次交叉融合模块中。如图 2所示，在同一特征空间中，层次交叉融合模块将上层粗粒度的特征向量通过特征映射算法映射到其下层细粒度的特征向量上，记为，其中，l表示层次粒度的第层。上层粗粒度特征向量通过映射到细粒度特征向量来得到多粒度的特征信息。然后将映射得到的特征向量与被映射的细粒度特征向量进行融合操作。为增强层次多粒度模型提取特征的鲁棒性，本文新设计了2个损失函数：重排序分类损失(RCL)和基于类别中心的三元组损失(TCL)。RCL能够排除这些无关且干扰的类别预测值，只关注于极易混淆的几个类别，从而进行针对性的类别判别来增强层次多粒度模型提取特征的鲁棒性。随着训练轮数的迭代和类别特征中心的更新，TCL能够将两个极易混淆的类别的特征距离拉远。同时，拉近同一类之间的特征距离。两个损失函数的具体实现将在2.2.1节和2.2.2节进行描述。在分类时，特定类别的预测概率值越大，则与正确类别越相关且越容易混淆；相反，类别预测概率值越低，则与正确类别越不相关，这些不相关的预测值的存在会对最终分类损失的计算产生负面影响。因此，需要抑制与正确类别相似的错误类别信息，让网络集中区分易混淆的类别。基于上述的结论，本文提出了一种重排序分类损失(RCL)。如图 3所示，得到类别预测向量v后，保留前k个类别预测概率最大值，其他的值则置为0。然后，对该类别预测向量进行归一化操作，从而得到新的类别预测向量。我们将中级语义类别预测向量记为，将高级语义类别预测向量记为。在FGIC任务上，不同细粒度类别图像之间的相似度可能会高于同一类别内图像的相似度。因此，本文提出一种基于类别中心的三元组损失(TCL)。如图1所示，每轮输入的图像训练集在训练后的特征向量都会存储到类别特征中心数据库中，并在下一轮更新上一轮的特征向量。每一轮训练结束后，类别特征中心数据库都会计算并存储每个类别的特征中心向量。\n模型对输入图像进行细粒度特征提取，得到预测结果。当预测结果正确时，则不使用TCL；当预测结果是错误类别时，则查询类别特征中心数据库对应的错误类别特征中心向量和正确类别特征中心向量。将正确类别和错误类别各自的特征中心分别作为正样本和负样本，模型提取的图像细粒度特征向量记为。其中，d(a, b)表示计算a和b的距离，表示阈值，本文中，设为0.3。为了使网络训练稳定，类别特征中心数据库的特征存储和更新在训练中期开始使用。融合多尺度信息和特征映射关系的层次多粒度图像分类网络通过上述重排序分类损失和基于类别中心的三元组损失联合训练，最终整体损失可表示为",
    "专利名": "多粒度图像分类方法、装置、电子设备及存储介质"
  },
  {
    "编号": 22,
    "专利底稿": "随着第五代移动通信技术的快速发展，网络架构发生了显著变化，用户面与信令面数据在特定场景下可能分属于不同的物理节点，导致两者在传输和汇聚过程中产生明显的时间差。与第四代移动通信系统相比，新一代网络的数传量呈现数量级增长，信令面数据相对于用户面数据的延迟可能达到数分钟、数小时甚至数天，这使得传统4G网络中基于硬件设备实现的实时关联方法完全失效。现有技术如公开号CN111542075A和CN103237301A所记载的方案，主要针对4G网络环境下信令面与用户面数据的即时关联，无法解决新一代移动通信网络中因数据传输延迟导致的关联难题。针对这一技术瓶颈，本发明提出了一种基于流式计算与离线计算相结合的混合处理架构。该方法首先通过信令面数据处理模块实时获取进入流式计算环境的信令面数据流，从中提取用户标识变迁状态的关键信息。这些信息包括但不限于用户设备的临时标识符、永久标识符及其对应的时间戳等要素，经过数据清洗和格式标准化后，构建形成用户标识变迁状态查询表。该表以关联字段为索引，完整记录用户在特定时间窗口内的标识变化轨迹，为后续的用户面数据关联提供参考依据。为了优化处理效率，系统对信令面数据实施压缩和去重处理，并将生成的用户标识变迁状态表存储于高性能内存数据库中，确保快速查询响应。与此同时，用户面数据处理模块持续接收来自网络接口的用户面数据流。这些数据包含业务内容、服务质量参数等运营信息，但缺乏直接的用户标识信息。系统通过解析用户面数据中的关联字段，在内存数据库中的用户标识变迁状态表进行实时匹配查询。当找到对应的用户标识时，系统立即将该标识信息写入用户面数据记录，完成实时关联过程。考虑到新一代移动通信网络中信令面数据的延迟特性，系统设置了双重时间阈值机制。信令面数据时间阈值根据网络延迟特征动态调整，确保其数值大于常见的信令面数据延迟时长；用户面数据时间阈值则设置相对较大的数值，为延迟较长的信令面数据预留匹配窗口。对于在流式计算环境中保留时间超过用户面数据时间阈值但仍未完成关联的数据记录，系统会将其自动转移到离线计算资源中继续处理。这种设计既保证了大多数数据的实时处理需求，又为异常延迟情况提供了补救措施。在离线计算环境中，系统利用分布式存储的大规模历史数据，对未能及时匹配的用户面数据进行深度关联分析，确保最终实现完整的用户标识关联覆盖。此外，系统还包含数据优化机制，在关联完成后自动删除用户面数据中的非结构化冗余信息，提升后续数据处理和存储效率。与现有技术相比，本发明的技术优势主要体现在三个方面：首先，通过流式计算与离线计算相结合的混合架构，有效解决了新一代移动通信网络中因信令面数据延迟导致的关联难题；其次，采用双重时间阈值机制和内存数据库技术，在保证处理效率的同时最大限度地提高了关联成功率；最后，通过数据压缩、去重和非结构化数据清理等优化措施，显著降低了系统资源开销。这套方案已在实际网络环境中验证了其有效性，能够适应新一代移动通信网络大数据量、高并发性的处理需求，为网络运营商的用户行为分析、服务质量优化和网络安全监控等应用提供了可靠的技术支撑。相应的，本发明还提供了一种通信网络用户面数据关联用户标识系统，该系统包括信令面数据处理模块、用户面数据处理模块、用户标识关联模块和离线计算模块。这些模块通过协同工作，形成了完整的用户标识关联处理流水线。系统采用分布式架构设计，可根据实际业务规模进行弹性扩展，具有良好的适应性和可维护性。通过本发明的实施，移动网络运营商能够在新一代通信网络环境下实现用户面数据的有效标识关联，为大数据分析和智能运维提供完整、准确的数据基础，具有重要的实用价值和推广前景。\n",
    "专利名": "一种通信网络用户面数据关联用户标识方法和系统"
  },
  {
    "编号": 23,
    "专利底稿": "本发明涉及焦化行业智能制造技术领域，特别提供一种基于工业互联网架构的焦化企业全流程智能化管控平台及实施方法。在焦化企业现有信息化建设基础上，虽然主体生产线的基础自动化控制系统覆盖率较高，但辅助系统的自动化程度参差不齐，数据采集存在明显短板。多数企业已建立以人力资源、财务管理和物资管控为核心的企业资源计划系统，并在生产单元层面实施了销售管理等专业系统，但在整体规划、标准统一、数据集成等方面仍面临严峻挑战。具体表现为自动化设备老化严重、数据采集率不足、信息孤岛现象普遍存在、数据中心基础设施滞后、信息安全防护薄弱等问题，这与《焦化行业“十四五”发展规划纲要》提出的推进两化深度融合、提升智能制造水平的要求存在较大差距。针对上述行业痛点，本发明提出了一种集数据采集、处理、分析和应用于一体的智能化综合解决方案。该平台采用分层架构设计，底层构建大数据基础智能平台层，上层部署多个专业智能管理应用模块。大数据基础智能平台层包含四个核心组成部分：数据采集系统负责整合企业内各类异构数据源，通过标准化归档、多协议转换和异构数据对接等技术手段，实现工业文本数据、设备实时数据和第三方系统数据的全面采集。在实时数据采集方面，系统采用生产者-消费者模式的工作机制，生产者端根据不同的数据源特性，适配OPC、Modbus、Socket、Web API等工业通信协议建立连接，按照预设的点位标签获取数据后写入消息队列；消费者端则通过多线程技术并行处理队列数据，并存储至MongoDB数据库。对于关系型数据库的采集，系统采用客户端-服务端架构，服务端提供可视化的配置界面，客户端在通过权限验证后获取数据表元信息，调用相应数据库驱动完成数据抽取，并通过推送机制将数据传回服务端进行标准化存储。数据处理层提供全生命周期的数据管理功能，包括数据点位管理、数据预处理、数据压缩和计算引擎等核心模块。数据点位管理支持点位的批量导入、配置维护和扩展定义；数据预处理模块集成数据清洗、归一化、对齐和缺省值处理等算法，确保数据质量；数据压缩组件支持多种压缩算法和压缩比配置，优化存储效率；计算引擎同时支持流式处理和批处理两种模式，分别通过Spark Streaming和Map Reduce技术满足实时计算和离线分析的不同需求。数据知识层构建了面向焦化行业的专业知识体系，包括人工智能模型库、规则知识库、工业领域分词库、机理模型库和知识图谱等。其中模型库通过焦炉全流程动态仿真实现工厂数字化模拟，能够根据不同的原料配比和工况条件，预测焦炭质量指标（包括灰分、硫分、机械强度等）、荒煤气产量、废烟气量及关键节点温度参数，为生产优化提供科学依据。数据管理层的可视化应用包含数据可视化和数据报表两大功能板块。数据可视化采用数字孪生技术，通过集成物理模型、传感器数据和运行历史记录，构建多学科、多尺度的虚拟仿真环境，实现厂区实际运行状态的实时映射和交互控制。系统提供零代码组态工具，内置丰富的2D/3D模型库，支持外部模型导入和轻量化处理，能够快速构建车间级、设备级的数字化场景。同时集成电子地图组件和高精度建模技术，生成具有地理信息系统特征的可视化界面。全景可视化看板基于平台组件库，构建面向不同业务区域的监控界面，实现从厂级到设备级的全要素展示和工艺流程仿真，支持多种数据源配置和算法规则库调用，可灵活部署到大屏等显示终端。AI视频分析系统通过在关键位置部署固定式相机和巡检机器人，实现对人员安全装备佩戴、设备状态、环境安全等指标的智能监测。特别在皮带传输检测方面，系统能够实时识别跑偏、堵料和撕裂等异常情况，并自动联动控制设备执行停机操作。巡检机器人具备设备状态识别、编号读取和灾害检测能力，支持定制化的视频AI算法扩展，如火灾识别和危险区域入侵检测等，展现出良好的适应性和泛化能力。在基础平台之上，系统构建了涵盖生产全流程的智能管理应用体系，包括智能调度、生产计划智能编排、智能配煤、质量管理、工艺管理、物料全流程跟踪和焦炭质量溯源、生产实绩与报表、操作管理、订单管理、能源管理和设备管理等模块。这些应用模块基于统一的数据底座，实现业务协同和数据共享，有效打破信息孤岛。通过连接企业物联网与产业互联网，建立集中式计算中心和大数据中心，平台实现了工业大数据的全面采集、高效存储和智能计算，推动企业研发、生产、质量和管控各环节的智能化升级。该平台已在多家焦化企业得到实际应用验证，显著提升了生产效率、降低了运营成本、增强了安全保障能力，为焦化行业智能制造转型提供了完整的技术支撑和实施方案。\n",
    "专利名": "一种基于物联网的工业大数据智能焦化平台"
  },
  {
    "编号": 24,
    "专利底稿": "随着人工智能技术的快速发展，特别是大规模深度学习模型的出现，对计算芯片的内存容量和访问效率提出了前所未有的要求。传统以中央处理单元为核心的芯片架构通过总线连接各功能模块，虽然在通用计算场景下表现良好，但在处理大模型训练所需的海量参数时，暴露出内存空间不足、访问延迟高、能耗大等明显缺陷。现有架构中处理器通常只能访问本地内存，无法有效利用系统中的其他内存资源，导致在处理大规模数据时往往需要频繁的数据交换，不仅增加了系统功耗，还严重制约了计算效率的提升。针对上述技术瓶颈，本发明提出了一种基于交叉开关架构的异构处理器共享内存解决方案。该架构的核心在于构建一个以Crossbar结构为中心的数据交换网络，通过多端口设计实现处理器与多级内存之间的高效互联。具体而言，该芯片架构包含三大类功能单元：多个处理器端口负责连接中央处理单元和图形处理单元等异构计算核心；内存处理单元负责管理中间级内存资源；网络数据处理单元则负责接入远端内存设备。这些功能单元通过Crossbar结构实现全互联，形成一个低延迟、高带宽的数据交换平面。在内存层次设计上，系统构建了三级存储体系：近端内存直接连接到各个处理器，为计算核心提供专属的高速缓存空间；中间级内存通过专门的内存处理单元进行管理，为系统中的多个处理器提供共享内存资源；远端内存则部署在网络设备上，通过高速网络接口扩展系统的总体内存容量。这种分层存储架构使得每个处理器不仅能够访问本地专属内存，还能通过Crossbar结构透明地访问中间级内存和远端内存，从而极大地扩展了可用内存空间，满足了大模型训练对海量参数存储的需求。处理器端口设计支持多种接口协议，包括PCIe端口用于连接中央处理单元，以及多个通信协议端口用于连接图形处理单元。近端内存根据处理器类型进行差异化配置，中央处理单元连接DDR内存，而图形处理单元则配备更高带宽的HBM内存。中间级内存同样包含DDR和HBM两种类型，通过对应的内存控制器进行管理。DDR控制器通过PCIe总线与中间级DDR内存连接，HBM控制器则通过专用通信协议总线与中间级HBM内存相连。这种灵活的配置方式使得系统能够根据不同的应用需求优化内存资源的分配和使用。网络数据处理单元支持以太网和InfiniBand等多种高速网络通信协议，使得远端内存可以灵活部署在不同的网络设备上。当处理器的近端内存无法满足当前计算任务的需求时，系统会自动通过Crossbar结构向中间级内存或远端内存发起访问请求，实现内存资源的动态扩展。这种机制确保了在处理大模型训练等内存密集型任务时，系统能够提供充足且高效的内存访问支持。在芯片设计方法方面，本发明提出了一套完整的架构设计流程。首先构建Crossbar数据交换中心，确保处理器端口与内存处理单元之间的高效数据交互。然后将处理器端口与各类计算核心连接，将内存处理单元与中间级内存连接，配置处理器通过Crossbar访问共享内存的能力。进一步地，通过增加网络数据处理单元并连接到配置有远端内存的网络设备，扩展系统的内存容量。最后，针对包含中央处理单元和图形处理单元的异构计算环境，配置多个处理器端口，并为每个处理器配备专用近端内存，同时建立当近端内存不足时自动访问共享内存的机制。与现有技术相比，本发明的技术优势主要体现在四个方面：首先，通过Crossbar结构提供低延迟的数据交换通道，显著降低了异构处理器在内存访问时的等待时间；其次，通过多级共享内存架构扩展了可用内存空间，有效支持了大模型训练对海量内存的需求；第三，改变了传统以中央处理单元为核心的架构设计，更加注重图形处理单元等专用计算核心的性能发挥，适应了人工智能计算的特点；最后，采用系统级芯片设计理念，将完整的功能集成到单一封装中，不仅控制了数据交换延迟，还显著降低了系统功耗，对于构建大型人工智能计算中心具有重要的实用价值。该架构已在原型系统中验证了其有效性，在大模型训练任务中表现出优异的内存访问性能和能效比，为下一代人工智能计算芯片的设计提供了新的技术方向。\n",
    "专利名": "一种整合异构处理器共享内存的芯片架构、芯片及其设计方法"
  },
  {
    "编号": 25,
    "专利底稿": "随着区块链技术的广泛应用，数字资产的安全管理日益成为用户关注的焦点。区块链钱包作为存储和管理加密货币密钥的核心工具，自然成为网络攻击的主要目标。现有安全防护方案大多采用固定规则或统一策略，难以适应日益复杂多变的攻击手段，特别是当攻击者通过钓鱼网站、恶意软件等方式获取用户私钥后，往往能够直接转移用户资产，造成不可挽回的损失。传统防护机制的僵化性与用户个性化安全需求的矛盾日益突出，亟需一种能够根据用户风险偏好和具体场景动态调整的安全防护方案。针对这一技术难题，本发明提出了一种基于交易对手风险画像的可定制化安全策略机制。该方案的核心在于建立客户端与服务器协同工作的双层防护体系，通过动态评估交易对手的风险属性并匹配用户预设的安全策略，实现智能化的风险防控。具体实施过程包括五个关键环节：当用户通过区块链钱包发起业务请求时，客户端首先解析请求内容，准确识别交易涉及的其他参与方账户信息。这些账户既包括普通的区块链外部账户，也可能涉及智能合约地址。客户端将识别出的账户信息及其对应的区块链标识符发送至专用服务器，服务器根据这些信息在对应的区块链网络上查询该账户的历史行为记录。服务器端维护着一个持续更新的风险账户数据库，通过定期向各主流区块链网络发送查询请求，收集在特定时间窗口内执行过异常业务的账户信息。这些异常业务类型包括但不限于：参与过黑客攻击事件、与已知诈骗地址存在资金往来、智能合约中存在恶意代码等。服务器将收集到的风险账户按照异常类型进行分类标记，形成结构化的账户属性列表。当接收到客户端的查询请求时，服务器会快速匹配目标账户是否存在于风险数据库中，并将对应的风险属性返回给客户端。在客户端层面，系统提供了灵活的安全策略配置界面。用户可以根据自身风险承受能力和使用习惯，针对不同类型的风险账户预设相应的处置方式。配置过程分为两个维度：一方面，系统基于服务器提供的安全配置数据，向用户展示各类标准化的风险属性及其对应的处置选项；另一方面，用户还可以手动输入特定的异常信息，如已知的恶意地址或可疑的智能合约，并为这些特定对象设置专属的安全策略。对于智能合约地址，系统还支持接口级的安全配置，通过解析合约代码识别各个功能接口，允许用户针对不同的合约方法设置差异化的安全策略。安全策略的执行选项主要包括业务中断和风险警告两种基本类型。当检测到交易对手符合某种风险特征时，系统会自动触发用户预设的应对措施：如果配置为中断业务执行，系统将立即终止当前交易流程；如果配置为发送警告信息，系统会向用户发出风险提示，但保留最终的操作决定权。这种设计既确保了安全控制的自动化，又赋予用户充分的自主选择空间。在实际交易处理过程中，当客户端接收到服务器返回的交易对手风险属性后，会立即在用户预设的安全策略库中进行匹配查找。一旦找到对应的安全策略，系统将严格按照策略要求执行相应的风险控制操作。例如，当检测到收款地址曾被标记为钓鱼网站关联账户时，如果用户预设策略为\"中断交易\"，系统将自动阻止该笔转账操作；如果预设策略为\"发送警告\"，则会在确认交易前向用户弹出风险提示框，待用户确认后方可继续执行。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过用户自定义安全策略机制，实现了防护措施的个性化定制，有效解决了统一安全策略与个体需求不匹配的问题；其次，基于区块链数据的实时风险分析，能够动态识别和应对新型安全威胁；最后，分层级的策略执行方式在保证安全性的同时，兼顾了用户体验和操作便利性。该系统已在实际应用环境中验证了其有效性，能够显著降低区块链钱包遭受攻击的风险，为数字资产的安全管理提供了可靠的技术保障。相应的，本发明还提供了一种区块链钱包防护装置，该装置包括接收业务模块、发送模块、接收属性模块、确定模块和执行模块。这些模块协同工作，形成了完整的安全防护流水线。同时，服务器端装置包含接收账户模块、查询模块和执行业务模块，负责风险数据的收集和处理。整个系统采用模块化设计，具有良好的扩展性和维护性，可以随着区块链技术的发展不断更新完善。此外，本发明还可以通过计算机可读存储介质和电子设备等形式实现。存储介质中存储的计算机程序被处理器执行时，能够实现上述区块链钱包保护方法的全部步骤。这些多样化的实施方式确保了本发明能够适应不同的应用场景和系统需求，为区块链钱包用户提供更加安全、便捷的数字资产管理体验。通过本发明的实施，用户可以根据自身需求灵活配置安全策略，有效提升区块链钱包的抗攻击能力，推动区块链技术的安全应用和普及发展。\n",
    "专利名": "一种区块链钱包保护的方法、装置、存储介质及电子设备"
  },
  {
    "编号": 26,
    "专利底稿": "在当前的网络安全管理实践中，暴力破解攻击作为一种常见的网络威胁手段，给系统安全带来了严峻挑战。传统的安全检测方法主要依赖于文件扫描和样本分析技术，这些方法虽然在恶意软件识别方面具有一定效果，但在应对暴力破解攻击时存在明显不足：检测过程耗时较长，系统资源占用率高，且从攻击行为发生到被识别的时间延迟较大，导致安全响应时效性难以满足实际防护需求。现有的网络流量分析技术虽然能够通过对数据包的监测来识别异常网络行为，但单一的流量分析往往难以准确区分正常的业务高峰与恶意的暴力破解行为，容易产生误报或漏报。同样，基于系统指标的监控方法虽然可以反映主机的运行状态，但缺乏与网络行为的关联分析，难以形成完整的攻击行为画像。\n针对这些技术缺陷，本发明提出了一种融合网络流量特征与系统运行指标的综合检测方案。该系统采用分布式架构设计，在受监测服务器上部署指标采集模块和流量采集模块，通过专门的分析服务器进行数据汇聚和智能分析。指标采集模块负责持续收集主机的关键性能参数，包括CPU使用率、内存占用率、进程数量和定时任务数等核心指标。这些原始数据经过预处理和格式化后，被发送到指标分析模块进行深度处理。流量采集模块则专注于网络层面的监控，通过抓取经过服务器的网络数据包，提取协议字段信息，并对SSH连接、SYN请求等关键网络行为进行统计和分析。\n在数据分析层面，系统创新性地构建了多维度健康度评估模型。对于CPU使用情况，系统采用动态阈值判断机制，通过计算当前CPU占用率与历史基准值的差异来评估异常程度。具体计算公式为：Hcpu = if CpuUsage > (CpuAverageUsage1Week * 1.5) then 1 else 0，其中CpuUsage表示当前监测周期内的CPU实际使用率，CpuAverageUsage1Week代表过去一周的平均使用率水平。这种基于历史基准的评估方法能够有效避免因正常业务波动导致的误报警。在内存使用评估方面，系统通过MemUsage = (UsedMem / TotalMem) * 100%计算当前内存占用比例，并与近一周的平均水平进行比较，得出内存健康度值Hmem = if MemUsage > (MemUsageWeek * 1.5) then 1 else 0。这种相对化的评估策略使得系统能够自适应不同服务器的实际运行环境。\n网络行为分析重点针对与暴力破解攻击密切相关的协议特征。对于SSH协议，系统统计单位时间内的数据包数量，计算公式为SshFrames = TotalSshFrames / T，其中T为监测周期长度。通过对比当前SSH数据包频率与历史平均水平，得出协议健康度值Hssh = if SshFrames > (SshFramesWeek * 1.5) then 1 else 0。同样地，对SYN数据包的监测采用类似方法，计算SynFrames = TotalSynFrames / T，并通过Hsyn = if SynFrames > (SynFramesWeek * 1.5) then 1 else 0进行评估。这些网络层指标的异常波动往往预示着潜在的暴力破解行为。在进程监控方面，系统不仅关注进程数量变化，还特别监测与暴力破解相关的特定进程特征。通过公式Hproc = if Procs > (ProcsWeek * 1.5) then 1 else 0评估进程数健康度，同时利用Hjobs = if Jobs > (JobsWeek * 1.5) then 1 else 0监控定时任务异常。针对已知的暴力破解工具，系统还建立特征库，通过Hnames = if Names > (NamesWeek * 1.5) then 1 else 0识别可疑程序。系统的核心检测算法采用加权综合评估策略，通过公式H = ∑(Hi * Wi) (i = 1,2,...n)计算总体健康度值。其中Hi代表各项健康度指标，Wi为对应的权重系数。根据暴力破解攻击的特征模式，系统为网络层指标分配较高权重，如Hssh、Hsyn和Hnames的权重设置为2，其他指标权重为1。这种差异化的权重分配使得系统能够更准确地识别真正的攻击行为。当检测到异常时，系统通过数据库服务器记录异常事件，并借助界面服务器向管理员提供可视化告警界面。告警界面不仅实时显示当前的安全状态，还提供历史事件查询功能，便于安全分析人员进行溯源分析。整个检测过程实现了从数据采集、分析到告警的自动化处理，显著提升了安全响应的效率。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过融合网络流量和系统指标的多维度分析，提高了检测的准确性和可靠性；其次，采用基于历史基准的动态阈值判断机制，有效降低了误报率；最后，实现了从攻击行为发生到安全告警的快速响应，大幅提升了安全防护的时效性。该系统已在实际网络环境中验证了其有效性，能够及时发现并阻止暴力破解攻击，为网络安全防护提供了新的技术解决方案。相应的，本发明还提供了一种计算机可读存储介质，该介质存储有实现上述检测方法的计算机程序。当程序被主控制器执行时，能够自动完成数据采集、健康度计算和异常检测的全流程操作。这种实施方式使得本发明可以方便地集成到现有的网络安全体系中，为各类网络服务器提供增强的安全防护能力。通过本发明的实施，网络管理员能够更有效地防御暴力破解攻击，保障系统的安全稳定运行。\n",
    "专利名": "一种基于流量和指标的暴力破解检测系统及方法"
  },
  {
    "编号": 27,
    "专利底稿": "在工业物联网应用场景中，各类智能生产设备和传感器通过开放信道进行数据交互与协同作业，实现了生产过程的远程监控和自动化控制。这种网络架构虽然显著提升了生产效率和资源利用率，但由于其通信通道的开放性，使得系统极易遭受数据窃取、参数篡改、设备冒充等安全威胁。特别是工业物联网中的智能物理设备通常部署在无人值守环境，容易遭受物理捕获攻击，而传统基于非对称加密、双线性配对或混沌映射的安全方案虽然提供较高的安全强度，但计算复杂度过高，无法满足工业物联网设备资源受限的特性。此外，现有技术方案往往过度关注用户端安全而忽视设备端防护，缺乏对用户隐私的有效保护，且多数方案依赖云端处理导致通信延迟增加，难以满足工业控制场景对实时性的严格要求。\n针对上述技术难题，本发明提出了一种融合雾计算架构的轻量级匿名认证解决方案。该系统由四个核心模块构成：雾节点模块作为可信注册中心，负责处理用户和智能设备的注册与认证请求，提供临时的数据存储和计算分析能力，并在系统空闲时段将重要数据同步至云模块进行长期归档。云模块承担大规模数据存储和复杂计算任务，为雾节点提供后端支持。用户注册模块使远程用户能够通过身份验证后与智能设备建立安全通信。智能设备端则通过集成物理不可克隆函数技术来增强硬件层面的安全防护，确保即使设备被物理捕获也难以提取关键密钥信息。\n系统的认证流程分为三个阶段实施。在注册阶段，每个新接入的智能设备向雾节点提交设备标识符，雾节点通过物理不可克隆函数生成设备特有的响应值，并结合随机数计算生成注册参数。用户注册时需提供身份标识和生物特征信息，系统通过哈希运算和密钥派生函数生成相应的认证凭证。这种设计确保了注册过程既满足轻量化要求，又能有效防止身份伪造。在登录认证阶段，用户需要在移动终端输入身份标识、口令和指纹信息，系统验证通过后才生成临时身份标识和动态认证参数。这一机制通过蜜语技术和临时身份标识有效抵御在线密码猜测攻击，同时保护用户隐私不被泄露。\n核心的相互认证和密钥协商阶段采用挑战-响应机制实现双向验证。用户端向雾节点发送包含临时身份标识和动态参数的认证请求，雾节点验证请求合法性后，将认证信息转发给目标智能设备。智能设备利用物理不可克隆函数生成响应值，并通过哈希链验证用户身份的真实性。整个认证过程采用轻量级密码学原语，包括哈希函数和异或运算，避免使用计算密集型的非对称加密操作。认证成功后，用户和设备双方基于共享的随机数独立推导出相同的会话密钥，该密钥用于后续通信数据的加密传输，确保数据传输的机密性和完整性。\n与现有技术相比，本发明的创新性主要体现在四个方面：首先，通过物理不可克隆函数技术为智能设备提供硬件级安全防护，有效抵抗物理捕获攻击；其次，采用雾计算架构分散数据处理压力，既降低云端负载又减少通信延迟；第三，运用动态临时身份和蜜语技术实现用户匿名性，防止攻击者通过流量分析获取生产流程信息；最后，整个认证方案仅使用轻量级密码运算，在保证安全性的同时满足工业物联网设备资源受限的实际需求。该系统已通过形式化安全验证和性能测试，证明能够有效抵抗重放攻击、中间人攻击、短暂秘密泄露攻击等常见威胁，同时认证时延控制在工业应用可接受范围内。\n相应的，本发明还提供了一种计算机设备实施方式，包括存储器和处理器，存储器中存储的计算机程序被处理器执行时能够实现上述认证方法的全部步骤。同时，本发明还涉及计算机可读存储介质和信息数据处理终端等技术方案，确保该系统能够灵活部署于不同的工业物联网环境。通过本发明的实施，工业物联网系统能够在资源受限条件下实现安全高效的匿名认证，为智能制造的快速发展提供可靠的安全保障。该技术方案已在实际工业场景中进行试点应用，表现出良好的安全性能和运行效率，具有重要的推广应用价值。随着工业物联网技术的普及，本发明将为构建安全可靠的工业自动化系统提供关键技术支持，推动工业生产向智能化、网络化方向持续发展。",
    "专利名": "一种物理安全的工业物联网匿名认证系统和方法"
  },
  {
    "编号": 28,
    "专利底稿": "本发明涉及医疗信息技术领域，特别提供一种基于多模态数据融合与自然语言处理的智能病历生成系统及方法。在现有医疗信息化体系中，电子病历管理虽已实现基础数字化，但病历撰写仍主要依赖医生手动完成，这一过程不仅耗费医务人员大量时间精力，更因信息记录不完整或表述偏差而影响诊疗质量。尤其在医患交流环节，关键病情信息的实时捕捉与准确转化始终是行业痛点。当前虽存在部分辅助工具，但其在整合身份验证、语音识别、内容提炼和规范生成等方面的综合能力仍显不足，无法实现从医患对话到标准病历的无缝转化流程。\n针对这一技术难题，本发明提出了一套完整的智能病历生成解决方案。该系统采用模块化架构设计，通过七个核心模块的协同工作实现病历自动生成。首先，身份识别模块通过生物特征人脸识别或身份证读取技术验证患者身份，准确获取包括姓名、身份证号码和年龄在内的基本信息。识别成功后，系统将带有患者身份标识的信息传输至医患对话记录模块，触发语音提示告知医生开始医患交流。该模块配备高灵敏度录音设备，能够完整记录医患对话全过程，并在检测到医生明确结束指令时，自动将录音内容与患者身份信息打包传输至下一处理环节。\n语音转文字模块采用先进的语音识别引擎，将实时采集的对话音频转化为结构化文本。在转换过程中，系统会智能过滤无关背景噪声，识别医疗专业术语，并对口语化表达进行规范化处理。转化后的文本与患者身份信息进行整合，在文本开头附加完整的患者基本信息后，通过控制端模块转发至用户端供医生审阅。医生可通过用户端模块对对话内容进行校对和编辑，确保信息准确无误。这一人工审核环节既保证了数据的可靠性，又为后续的自动生成提供了质量保障。\n控制端模块作为系统的调度中枢，负责协调各模块间的数据流转。当接收到用户端提交的审核通过信息后，控制端将对话内容和患者基本信息发送至应用算法模块。该模块采用专门设计的文本处理算法，对医患对话进行深度分析，识别其中的症状描述、病史陈述、体格检查结果等关键医疗要素，并按照标准病历格式组织成能够驱动大语言模型工作的规范化提示词。这些提示词经过精心设计，既包含必要的语境信息，又明确指定了输出格式要求，确保生成内容符合医疗文书规范。\n大语言模型模块接收经过优化的提示词后，利用其强大的自然语言理解和生成能力，对医患对话中的关键信息进行深度挖掘和提炼。模型基于预训练的医学知识库，能够准确识别症状之间的关联性，推断可能的诊断方向，并按照主诉、现病史、既往史、体格检查、初步诊断等标准章节生成结构完整的入院病历。在生成过程中，模型会特别注意医学术语的规范使用和临床逻辑的严密性，确保输出内容既专业准确又符合实际诊疗需求。\n系统还设计了迭代优化机制，当生成的病历未能满足要求时，医生可通过用户端提出修改意见，系统将根据反馈重新调整提示词并再次生成，直至输出符合标准的病历内容。最终确定的病历将通过标准接口传输至医院信息系统进行归档存储，实现与现有医疗流程的无缝对接。\n与现有技术相比，本发明的创新性主要体现在四个方面：首先，通过多模块协同实现了从身份验证到病历生成的全流程自动化；其次，采用先进的语音识别和自然语言处理技术，确保医患对话信息的准确转化；第三，基于大语言模型的智能生成引擎能够输出符合医疗规范的标准化病历；最后，系统设计的人机协同机制既保证了效率又确保了质量。该系统已在实际医疗环境中进行测试，结果显示能够显著降低医生文书工作负担，提高病历书写效率约60%，同时有效提升了病历内容的完整性和规范性。通过本发明的实施，医疗机构能够优化工作流程，释放医疗资源，为提升整体医疗服务水平提供有力的技术支持。",
    "专利名": "一种智能提取总结生成入院病历的方法及系统"
  },
  {
    "编号": 29,
    "专利底稿": "在传统竞猜活动中，主办方通常会设置多个中奖号码及其对应奖品，参与者通过猜测中奖号码来赢取奖励。为了保证竞猜过程的公平性，现有技术通常采用固定时间开奖的方式，在开奖时间结束后将所有中奖号码及奖品信息完全公开。这种方法虽然确保了结果的可验证性，但却严重损害了信息隐私性——即使是未被猜中的号码或者参与者放弃兑奖的号码也会被公开曝光，导致这些号码无法在后续活动中继续使用，造成资源浪费并降低了活动的趣味性。\n针对这一技术缺陷，本发明提出了一种基于区块链分布式账本和高级加密技术的创新解决方案。该方法涉及三个主要参与方：竞猜主办方、区块链系统和竞猜参与方，通过精密的密码学协议实现既保证公平性又保护隐私的竞猜流程。在系统初始化阶段，竞猜主办方首先确定n组中奖信息，每组信息包含中奖号码和对应的奖品详情。主办方向区块链系统发送参数请求，区块链节点接收到请求后生成必要的密码学参数。具体而言，区块链系统会产生第一秘密参数α和第二秘密参数β等核心密钥材料，并基于这些秘密参数计算出对应的公开参数G和H，将这些公开参数在区块链网络上进行公布。这种参数生成机制为后续的加密操作奠定了安全基础。\n竞猜主办方从区块链系统获取公开参数后，为每一组中奖信息生成独立的混淆参数。对于第i组中奖信息，主办方生成第一混淆参数r_i和第二混淆参数o_i，然后利用这些参数计算对应的密钥对。公开密钥的计算公式为：pub_key_i = r_i × G + o_i × H，私密密钥的计算公式为：pri_key_i = r_i × α + o_i × β。这种密钥生成方式确保了每个中奖信息都有独一无二的加密密钥，有效防止了密钥之间的关联性分析。主办方使用生成的私密密钥，采用预设的加密算法对中奖信息进行加密，得到第一密文，然后将所有中奖信息对应的第一密文和公开密钥一起上传到区块链系统。这一步骤确保了中奖信息在未被猜中的情况下始终保持加密状态，任何人都无法获取其内容。\n当参与者希望参与竞猜时，需要先确定自己的兑奖号码，并采用与主办方相同的加密算法对该号码进行加密，生成第二密文。参与者将第二密文上传至区块链系统后，区块链节点会利用其保存的秘密参数和主办方上传的公开密钥，为每个中奖信息生成对应的凭证密钥。第i组中奖信息对应的凭证密钥计算公式为：T_i = pub_key_i × α + C × β，其中C代表参与者上传的第二密文。这些凭证密钥具有特殊的数学性质：只有当参与者的兑奖号码与某个中奖号码相匹配时，对应的凭证密钥才能正确解密该中奖信息的第一密文。\n区块链系统将生成的所有凭证密钥和主办方上传的第一密文一起发送给参与者。参与者使用收到的凭证密钥尝试解密各个第一密文。如果参与者的兑奖号码与第j组中奖信息中的中奖号码相同，则第j组中奖信息对应的凭证密钥将能够成功解密第j组中奖信息对应的第一密文，从而揭示中奖信息内容，表明竞猜成功。如果所有解密尝试均失败，则说明竞猜失败。在竞猜成功的情况下，参与者可以选择是否兑奖。如果选择兑奖，则需将解密得到的中奖信息发送给主办方，主办方核实后公开该组中奖信息并发放对应奖品；如果参与者选择放弃兑奖，则中奖信息继续保持加密状态，不会被公开，从而保护了信息的隐私性。\n与现有技术相比，本发明的优势主要体现在三个方面：首先，通过精密的密码学协议实现了中奖信息的隐私保护，只有当中奖号码被正确猜中且参与者选择兑奖时，对应的中奖信息才会被公开；其次，基于区块链的分布式特性确保了整个竞猜过程的透明性和不可篡改性，任何人都可以验证活动的公平性；最后，该方法支持中奖信息的重复利用，未被猜中或放弃兑奖的号码可以在后续活动中继续使用，大大提高了资源利用效率。该系统已在实际应用环境中验证了其安全性和实用性，为各类竞猜活动提供了既保护隐私又保证公平的技术解决方案。\n相应的，本发明还提供了实现上述方法的竞猜处理装置，包括处理单元、通信单元和获取单元等核心组件。这些装置可以部署在竞猜主办方、区块链节点和参与者等多个节点上，通过协同工作完成整个竞猜流程。同时，本发明还可以通过计算设备和计算机可读存储介质等形式实施，存储介质中存储的计算机程序被处理器执行时能够实现上述竞猜处理方法的全部步骤。这些多样化的实施方式确保了本发明能够适应不同的应用场景和系统需求，为各类竞猜活动提供灵活可靠的技术支持。通过本发明的实施，竞猜活动主办方能够在保证公平性的同时有效保护信息隐私，提升活动体验和参与度，具有重要的推广应用价值。",
    "专利名": "一种基于区块链的竞猜处理方法及装置"
  },
  {
    "编号": 30,
    "专利底稿": "在软件测试过程中，测试用例作为验证程序功能与性能的重要工具，其数量随着项目迭代持续增长，不同测试人员编写的测试用例往往存在格式不一致、内容重复、语法错误等问题。传统依赖人工检查的测试用例管理方式不仅效率低下，而且容易因主观因素导致遗漏和误判，严重影响测试用例的质量和测试执行的准确性。尤其在大规模软件项目中，测试用例库可能包含数以万计的用例，手动维护的成本和错误率将呈指数级增长。\n针对上述技术难题，本发明提出了一种多层级自动化检测方案。该方案首先通过格式内容检测模块对用户输入的测试用例进行初步筛选。系统基于正则表达式构建的规则引擎对测试用例的代码格式进行严格校验，包括括号匹配、缩进规范、关键字使用等基础语法要素。同时采用代码循环遍历算法检查测试用例内容是否符合预设的模板要求，确保测试步骤、预期结果等必要元素的完整性和规范性。通过格式检测的测试用例将被存储至中心数据库，而未通过检测的用例则被系统拒绝并提示具体错误信息。\n在完成格式检测后，系统启动语句相似性分析流程。该流程基于预先训练的文本相似算法模型，该模型通过大量样本测试用例及其标注信息进行监督学习。模型训练过程采用迭代优化策略，通过计算预测结果与真实标签之间的损失值，动态调整模型参数直至收敛。在实际应用时，模型对每个测试用例中的语句进行向量化表示，计算语句间的余弦相似度，当相似度超过预设阈值时，系统会自动标记这些重复语句并记录至数据库。这种基于深度学习的相似性检测方法能够有效识别语义层面的重复内容，而不仅仅是表面的文本匹配。\n语法检查环节采用自然语言处理技术对测试用例进行深度分析。系统内置的标准代码编写语法规则库覆盖了变量声明、函数调用、条件语句、循环结构等常见编程元素。当检测到括号不匹配、未定义变量引用、函数参数错误等语法问题时，系统会精确定位错误位置并进行标记。特别是对于测试用例中常见的描述性内容，系统还能识别语义歧义、逻辑矛盾等深层问题，确保测试用例的可执行性和准确性。\n系统采用持续学习机制，随着新测试用例的不断输入，检测模型会实时更新优化。当用户提交第二测试用例时，系统会同步执行格式检测、相似性检查和语法检查的全流程处理。所有检测结果均存储在中心数据库中，系统基于这些数据生成详细的校准报告，包括重复语句统计、语法错误分类、质量评分等量化指标。测试人员可以根据报告指引快速定位问题，并进行针对性修改。系统还支持自动修正功能，对于标记的重复语句和语法错误，可以提供智能修改建议或直接执行标准化修正。\n与现有技术相比，本发明的优势主要体现在三个方面：首先，通过多层级检测机制全面覆盖测试用例的常见质量问题，显著降低人工检查的工作量；其次，基于机器学习的相似性检测算法能够准确识别语义重复，避免测试资源浪费；最后，自然语言处理技术的应用使得系统能够理解测试用例的语义内容，提高错误检测的准确率。实际应用表明，该系统能够将测试用例的检查效率提升约70%，同时将错误漏检率控制在5%以下。\n相应的，本发明还提供了一种测试用例检测装置，该装置包括第一检测模块、相似性检查模块、语法检查模块和第二检测模块。这些模块通过流水线架构协同工作，实现测试用例从输入到修正的全流程自动化处理。此外，本发明还可以通过电子设备和计算机可读存储介质实施，存储介质中的计算机程序被处理器执行时能够实现上述检测方法的所有步骤。该系统已在实际软件开发环境中得到验证，显著提升了测试用例管理的效率和质量，为软件测试的标准化和自动化提供了可靠的技术支持。",
    "专利名": "一种测试用例的检测方法、装置、电子设备及存储介质"
  },
  {
    "编号": 31,
    "专利底稿": "在城市轨道交通运营中，设备管理对控制运营成本、保障公众安全和提升社会效益具有关键作用。车站内的安检设备、闸机、显示屏、电梯扶梯等关键设备的稳定运行直接影响运营安全和服务质量。随着轨道交通系统规模扩大和设备数量增加，传统中心化数据管理方式暴露出单点故障风险、数据易被篡改、隐私保护不足等缺陷。现有技术如公开号CN115623004A的专利虽然引入了区块链概念，但在数据共享机制和隐私保护方面仍存在明显不足，难以满足现代轨道交通智能化发展的需求。针对上述技术问题，本发明提出了一套完整的区块链化设备管理解决方案。该系统包含五个核心模块：数据采集模块通过部署在各类轨道交通设备上的传感器网络，实时采集运行状态参数、维护记录和故障信息。采集的原始数据首先经过严格的数据清洗流程，包括处理缺失值、检测离群点和平滑噪声数据，确保数据质量。随后进行预处理操作，通过数据标准化消除量纲差异，采用数据归约技术降低存储负担，并完成多源数据的集成整合。处理后的数据按照区块链系统的要求进行结构化编码，并使用加密算法进行安全保护。加密方案结合对称加密的高效性和非对称加密的安全性，同时引入哈希函数确保数据完整性，最终形成区块链可识别的标准化数据包。区块链网络采用多节点分布式架构，每个参与节点都保存完整的区块链副本，通过共识机制对设备数据进行集体验证和存储。这种去中心化设计彻底消除了单点故障风险，即使部分节点出现故障，系统仍能保持正常运作。网络中的交易和数据更新需要经过多数节点验证才能被记录到区块链上，有效防止数据篡改，确保设备历史记录的不可篡改性和可追溯性。权限管理模块充分利用区块链的匿名性和可追溯性特征，构建精细化的访问控制体系。通过数字身份认证和密钥管理机制，确保只有授权用户才能访问特定设备数据。系统记录所有数据访问和操作行为，形成完整的审计轨迹，既保护了数据隐私又满足了监管要求。不同角色的用户被授予差异化的数据访问权限，例如维修人员只能查看负责区域的设备数据，而管理人员可以获取全局统计信息。智能合约模块实现了设备管理的自动化执行。预设的智能合约包含多个功能模块：设备状态监控合约定期检查设备运行参数，一旦发现异常立即触发预警机制；自动维护合约根据设备使用时长和维护周期，自动生成维护工单并调度维修资源；安全验证合约持续评估设备是否符合安全标准，对不达标设备自动限制使用；支付结算合约处理设备维护相关的费用计算和支付流程；数据共享合约在加密技术和访问控制的基础上实现数据的按需共享；应急响应合约针对突发事件制定自动化处置方案。这些智能合约通过代码形式固化业务流程，确保管理规则的一致性和执行效率。用户界面模块为各类用户提供直观的操作界面，支持设备数据可视化展示、权限配置和智能合约管理。管理人员可以通过界面实时监控全网设备状态，维修人员能够接收智能合约自动派发的工单任务，决策者可以基于可信数据进行分析研判。界面设计充分考虑不同用户群体的操作习惯，提供个性化的功能组合和数据视图。与现有技术相比，本发明的创新性主要体现在四个方面：首先，通过完整的区块链化改造实现了设备数据的分布式存储与可信共享，显著提升了系统的抗风险能力；其次，基于密码学技术的权限管理体系在保证数据隐私的同时实现了精细化的访问控制；第三，智能合约的广泛应用将传统依赖人工的管理流程转化为自动化执行，大幅提高管理效率；最后，整套系统为轨道交通设备管理提供了从数据采集到决策支持的全链路解决方案。实际应用表明，该系统能够将设备故障响应时间缩短约50%，数据安全性提升至99.9%以上，同时显著降低运营维护成本。相应的，本发明还提供了具体的实施方法，包括数据采集规范、区块链网络部署方案、智能合约编程框架和用户界面设计指南。这些方法确保系统能够适应不同规模的轨道交通网络，支持平滑扩展和持续优化。通过本发明的实施，城市轨道交通运营企业能够构建更加安全、高效和智能的设备管理体系，为公众提供更可靠的出行服务，同时推动轨道交通行业的数字化转型和智能化升级。该技术方案已在试点线路中验证了其可行性和有效性，具备广泛的推广应用价值。",
    "专利名": "一种基于区块链的轨道交通设备管理系统"
  },
  {
    "编号": 32,
    "专利底稿": "随着电子银行业务的快速发展，非面对面交易已成为主流的金融服务模式。这种虚拟化交易方式虽然带来了便利性和效率提升，但其高度开放性和隐蔽性特征也带来了新的安全挑战。身份认证作为电子银行安全体系的核心环节，直接关系到银行和客户的资金安全。现有身份认证系统通常采用预设的固定认证方式，无法根据交易环境的风险程度动态调整认证策略。当用户处于复杂的交易环境时，这种僵化的认证机制往往难以准确识别身份真伪，导致安全防护效果大打折扣。针对这一技术难题，本发明提出了一种基于强化学习的智能身份认证方案。该方法首先通过数据采集模块获取多维度的身份相关数据，这些数据涵盖用户基本信息、账户交易特征和社交网络行为等多个维度。获取的原始数据经过严格的安全处理流程，包括数据解密、脱敏处理和噪声过滤，确保敏感信息得到充分保护的同时保持数据可用性。处理后的数据通过特征提取网络进行深度分析，从中提炼出具有区分度的身份相关特征，这些特征能够准确反映用户的行为模式和交易习惯。系统的核心在于强化学习模块的设计。该模块将身份认证过程建模为马尔可夫决策过程，其中状态空间由身份相关特征构成，动作空间对应不同的身份认证方式。智能体通过与环境持续交互来学习最优的认证策略在训练阶段，系统从历史交易数据中获取大量资源转移状态记录，构建初始的状态空间和动作空间。针对每个状态-动作对，环境根据状态转移策略更新系统状态，并按照预设的奖励函数计算参考奖励。奖励函数的设计综合考虑认证成功率、用户体验和安全成本等多个因素，确保学习到的策略在安全性和便利性之间取得平衡。智能体通过比较实际获得的参考奖励与期望奖励之间的差异，不断调整其策略参数。训练过程采用先进的强化学习算法，通过多次迭代优化，使智能体能够准确预测在不同状态下执行各个认证动作所能获得的长期回报。当模型性能达到预设的收敛标准时停止训练，得到具备智能决策能力的认证策略模型。在实际应用过程中，当用户发起交易请求时，系统实时采集当前的身份相关数据并提取特征，基于这些特征确定系统当前状态。随后，训练好的智能体针对动作空间中的每个认证动作预测其奖励值，这些动作可能包括短信验证、生物特征识别、行为分析等不同复杂程度的认证方式。系统选择预测奖励最高的动作作为目标认证方式，并按照该方式对用户进行身份验证。这种动态选择机制确保了认证强度与交易风险水平的精确匹配：在低风险环境下采用简便的认证方式提升用户体验，在高风险场景下启用更严格的认证手段保障安全。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过强化学习实现了认证策略的动态优化，能够根据实时交易环境调整认证强度；其次，多维特征分析提供了更全面的风险评估基础，显著提高了身份识别的准确性；最后，智能决策机制在保证安全性的同时优化了用户体验，避免了不必要的认证负担。实际应用数据显示，该方法能够将身份认证的准确率提升约25%，同时将误拒率降低至传统方法的50%以下。相应的，本发明还提供了一种身份识别装置，该装置包含数据采集模块、强化学习模块和身份认证模块。这些模块通过协同工作，实现了从数据采集到认证决策的完整流程。此外，本发明还可以通过计算机设备、存储介质和计算机程序产品等多种形式实施。计算机设备中的处理器执行存储介质中的计算机程序时，能够实现上述身份识别方法的所有步骤。该系统已在实际电子银行环境中进行测试，表现出优异的适应性和可靠性，为金融服务的安全保障提供了新的技术支撑。通过本发明的实施，电子银行能够在复杂多变的网络环境中实现更精准的身份认证，有效防范金融欺诈风险，推动数字金融服务的健康发展。",
    "专利名": "身份识别方法、装置、计算机设备、存储介质和程序产品"
  },
  {
    "编号": 33,
    "专利底稿": "随着电子产品向轻薄化、透明化和柔性化方向发展，透明柔性基板因其优异的物理特性而广泛应用于现代电子设备中。然而，基板材料的特殊性和电路结构的微型化给质量检测带来了巨大挑战。传统检测方法难以适应透明基板的光学特性和柔性结构的形变特征，导致检测效率低下且准确性不足。特别是在集成电路线路微米级线宽的检测方面，现有技术往往无法准确识别线路缺陷和尺寸偏差，严重影响产品的可靠性和良品率。针对这一技术难题，本发明提出了一套完整的检测流程方案。该方法首先对集成电路透明柔性基板进行全面的性能检测。透明度检测通过专用设备测量基板在可见光范围内的透光率，确保其不低于预设标准。柔性测试采用渐进弯曲方式，固定基板一端并按预设角度逐步弯曲另一端，验证其机械柔韧性能。集成电路功能检测则通过电性测试确认线路连接的完整性，排除短路和断路等基本故障。只有通过这三项性能检测的基板才会进入后续的图像分析环节。在图像采集阶段，系统使用经过精密标定的工业相机建立图像采集坐标系。当基板进入拍摄区域后，系统同时获取像素坐标数据和光学测量数据。通过对比相机采集的尺寸数据与光学设备测量的物理尺寸，系统能够自动校正测量误差，确保尺寸检测的准确性。这一交叉验证机制有效克服了透明材料在光学测量中的折射误差问题，为后续分析提供了可靠的尺寸基准。图像预处理环节采用LAB颜色空间转换技术，分别处理图像的亮度分量和色彩分量。对于a、b色彩分量，系统根据基板尺寸动态确定滤波迭代次数，通过多次迭代滤波有效去除噪声干扰。对于L亮度分量，系统特别设计了低照度增强算法：首先识别背景低照度区域，然后进行光照图像和反射图像的分解处理，分别对光照成分进行灰度增强和对反射成分进行滤波去噪，最后合并处理结果获得增强后的亮度图像。这种分离处理的方法能够在保持图像细节的同时显著提升对比度。图像分割过程综合运用阈值分割、边缘分割和聚类分割三种技术。阈值分割基于像素灰度特征确定分割边界，边缘分割通过连接相邻边缘像素形成连续轮廓，聚类分割则根据颜色、灰度和空间特征将像素点归类。系统构建了包含分割准确率、错误率、相似度和信息保留度等指标的评价体系，对分割结果进行量化评估，确保分割质量满足后续分析要求。在线路分析阶段，系统从分割后的子图像中提取基板线路边缘特征。首先过滤掉长度过短的无关线路，然后通过斜率分析区分直线段和曲线段。对于直线路段直接进行线性拟合，对于曲线路段则通过中心点划分后分段拟合。系统通过比较相邻拟合线段的斜率差异来识别连续性线路，并计算平均线宽值。缺陷检测环节将测量线宽与标准值进行比对，当线宽误差超出允许范围时标记为缺陷像素。系统设定了合理的缺陷容忍度，只有在缺陷像素占比超过阈值时才判定产品不合格。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过多阶段检测流程确保了基板性能和尺寸的全面评估；其次，采用LAB颜色空间分析和低照度增强技术有效提升了透明基板的图像质量；第三，综合运用多种分割方法提高了线路提取的准确性；最后，通过斜率分析和分段拟合实现了微米级线宽的精确测量。实际应用表明，该方法能够将检测效率提升约40%，同时将误检率控制在2%以下，显著提高了透明柔性基板的生产质量。相应的，本发明还提供了实现上述方法的检测系统，包括性能测试模块、图像采集模块、处理分析模块和缺陷识别模块。这些模块通过协同工作，实现了从基板入检到结果输出的全自动化流程。系统特别设计了适用于透明材料的照明方案和图像采集架构，确保在不同环境条件下都能获得稳定的检测效果。通过本发明的实施，电子制造企业能够实现对透明柔性基板的高效、精准检测，为高端电子产品的质量保障提供了可靠的技术支持。该技术方案已在多家电子制造企业得到应用验证，表现出优异的实用性和可靠性，具有重要的推广价值。\n",
    "专利名": "一种用于集成电路透明柔性基板的检测方法"
  },
  {
    "编号": 34,
    "专利底稿": "在传统农业监控系统中，传感器节点通常采用稀疏布设方式，导致监测覆盖不均匀，难以精确反映农田中不同区域的环境差异。现有技术如公开号CN213481405U的专利虽然解决了监测模块安装便利性问题，但无法捕捉土壤剖面的完整湿度变化，特别是中层和深层土壤的水分状况常常被忽视。这种数据采集的局限性导致灌溉策略往往基于片面的环境信息，无法根据作物实际需水状况进行动态调整，造成水资源浪费或灌溉不足的问题。针对这些技术缺陷，本发明提出了一套完整的智能灌溉解决方案。该系统首先通过传感器网络模块实现农田环境的全方位监测。传感器节点采用网格化布局方式，根据农田面积、作物类型和种植密度动态调整网格单元尺寸，常规设置在10-50米范围，对于高密度种植作物则采用5-15米的精细网格。在每个网格单元中心布设综合传感节点，这些节点在垂直方向上分层部署湿度传感器，分别监测表层0-20厘米、中层20-40厘米和深层40厘米以上的土壤湿度。这种三维监测网络能够全面捕捉土壤剖面的水分动态变化，为精准灌溉提供完整的数据基础。除了土壤湿度监测，系统还集成气象传感单元，包括温度传感器、空气湿度传感器、降雨量传感器以及风速风向传感器，构建起完整的环境参数采集体系。数据处理与分析模块采用先进的边缘计算架构，通过LoRa、NB-IoT等低功耗广域网技术实时传输采集数据。在数据融合环节，系统运用卡尔曼滤波算法处理时间序列数据。定义系统状态方程x_k = A_k x_{k-1} + B_k u_{k-1} + w_{k-1}和观测方程z_k = H_k x_k + v_k，其中x_k表示系统状态向量，z_k为观测向量，w_k和v_k分别代表过程噪声和观测噪声。通过状态预测x_{k|k-1} = A_k x_{k-1|k-1} + B_k u_{k-1}和更新过程，包括卡尔曼增益计算K_k = P_{k|k-1} H_k^T (H_k P_{k|k-1} H_k^T + R_k)^{-1}、状态更新x_{k|k} = x_{k|k-1} + K_k (z_k - H_k x_{k|k-1})以及协方差更新P_{k|k} = (I - K_k H_k) P_{k|k-1}，实现对多源数据的有效融合。同时采用贝叶斯融合算法，基于先验概率P(x)和似然函数P(z_k|x)，通过后验概率P(x|z_k) = P(z_k|x) P(x) / P(z_k)的综合计算，得到更可靠的环境参数估计值。决策支持模块是整个系统的智能核心，该模块基于作物种类、生长阶段、土壤特性和气象条件建立需水量预测模型。采用支持向量机算法，将标准化处理后的环境特征向量作为输入，通过训练好的模型预测作物在各生长阶段的需水量。在多目标优化环节，系统综合考虑作物产量最大化、水资源浪费最小化和灌溉成本最低化等多个目标，运用强化学习算法根据实时反馈数据动态调整灌溉策略。这种自适应机制使得系统能够应对突发的天气变化和作物需求波动，确保灌溉决策的及时性和准确性。自动化控制模块负责灌溉策略的执行与优化。智能灌溉控制器连接各类传感器，通过无线通信模块接收边缘计算设备处理后的数据。变量速率灌溉系统根据土壤湿度和作物需水量的空间差异，动态调整不同区域的灌溉参数。边缘计算设备部署在传感器节点附近，实现数据的实时处理和初步分析，显著降低云端传输延迟。系统还建立了闭环反馈控制机制，通过监测灌溉后的土壤湿度变化评估灌溉效果，并据此动态调整灌溉参数，形成持续优化的控制循环。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过网格化多层传感网络实现了农田环境的三维精准监测；其次，基于卡尔曼滤波和贝叶斯融合的数据处理算法显著提高了环境参数的可靠性；第三，支持向量机与强化学习相结合的决策模型确保了灌溉策略的科学性和适应性；最后，边缘计算与闭环控制机制保证了系统响应的实时性和执行精度。实际应用表明，该系统能够节水30%以上，同时提高作物产量15%-20%，为现代化农业提供了可靠的智能化灌溉解决方案。相应的，本发明还提供了具体的实施方法，包括传感器布设规范、数据处理流程、决策模型构建和控制策略执行等详细步骤。这些方法确保系统能够适应不同规模的农田环境，支持个性化配置和持续优化。通过本发明的实施，农业生产者能够实现水资源的精细化管理，提升农业生产效率和质量，推动智慧农业的深入发展。该技术方案已在多个农业示范区得到验证，表现出显著的经济效益和环境效益。\n",
    "专利名": "一种基于物联网的智能农业监控系统"
  },
  {
    "编号": 35,
    "专利底稿": "在传统文件柜生产管理中，企业通常依赖经验判断或简单统计方法进行需求预测，难以准确捕捉市场趋势变化。这种粗放式的管理方式容易导致生产计划与市场需求脱节，造成库存积压或供应短缺等问题。尤其在家具行业季节性波动明显、市场需求变化快速的背景下，传统预测方法的滞后性和不准确性已成为制约企业发展的关键瓶颈。针对这一技术难题，本发明提出了一种融合多源数据与深度学习的智能预测方案。该系统首先通过文件柜历史销售数据市场数据获取模块收集两类关键信息：一是企业内部的 historical 销售记录，包括不同型号文件柜的销量、销售周期、区域分布等详细数据；二是外部市场趋势数据，涵盖宏观经济指标、行业动态、竞争对手信息等多维因素。这些数据经过严格清洗和标准化处理后，进入核心的特征提取与分析流程。历史销售数据提取模块采用深度神经网络对销售数据进行嵌入式编码和语义特征提取。通过多层感知机或循环神经网络结构，系统能够从时序销售数据中捕捉长期趋势、季节性规律和周期性特征，最终输出具有丰富语义信息的文件柜历史销售数据语义编码特征向量。该向量不仅包含基础的销量信息，还编码了销售模式、产品偏好等深层特征，为准确预测奠定基础。市场趋势数据编码模块专门处理非结构化的市场信息。系统首先对收集的市场报告、行业新闻等文本数据进行分词处理，然后利用预训练的语言模型进行语义编码，生成多个市场趋势语义编码特征向量。这些局部特征通过注意力机制或池化层进行全局整合，形成综合反映市场整体态势的市场趋势全局语义编码特征向量。这种处理方式能够有效提取市场数据中的潜在规律和关键信号。特征融合交互模块负责将内部销售特征与外部市场特征进行深度整合。该模块采用跨模态注意力机制或特征交叉网络，计算两个特征向量之间的相关性权重，实现信息互补和特征增强。通过这种交互融合，系统生成既反映企业内部销售状况又体现外部市场环境的销售市场交互特征向量，该特征向量包含了预测未来需求所需的全面信息。文件柜需求预测模块基于融合后的特征向量进行最终决策。该模块通常采用全连接神经网络或时间序列预测模型，将特征向量映射为未来特定时间段的需求预测值。系统还会设置智能阈值判断机制，当预测值与当前生产计划的偏差超过预设范围时，自动触发生产计划调整建议。这些预测结果和建议通过可视化界面呈现给管理人员，支持生产计划、原料采购、库存管理等环节的优化决策。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过深度学习算法实现了对多源数据的智能分析和特征提取，显著提高了预测准确性；其次，内部销售数据与外部市场趋势的融合分析使系统能够及时捕捉市场变化信号；最后，端到端的自动化预测流程大大降低了人工干预需求，提高了决策效率。实际应用数据显示，该系统的需求预测准确率相比传统方法提升约25%，同时将库存周转率提高30%以上。相应的，本发明还提供了一种基于深度学习的文件柜生产管理方法，该方法完整实现了从数据收集、特征提取、融合分析到预测决策的全流程。该方法可部署于企业现有管理系统，通过API接口与ERP、SCM等系统无缝集成。通过本发明的实施，文件柜制造企业能够建立更加精准、敏捷的生产管理体系，有效应对市场波动，优化资源配置，提升整体运营效率。该技术方案已在家具制造业得到实际应用验证，表现出良好的实用性和可靠性，具有重要的推广价值。\n",
    "专利名": "基于深度学习的文件柜生产管理系统及方法"
  },
  {
    "编号": 36,
    "专利底稿": "本发明涉及区块链技术领域，特别提供一种支持即时支付与预约支付并行的区块链交易处理系统及方法。传统区块链系统由于采用串行交易执行机制，导致交易处理性能成为制约其广泛应用的关键瓶颈。现有技术如公开号CN109064171A的专利虽然尝试通过交易标识机制提升并行性，但其本质上仍属于同一用户交易的顺序处理，无法有效解决不同用户并发交易的处理效率问题。特别是在实际应用场景中，交易类型多样化的需求日益突出，既有需要立即执行的即时支付，也有按计划执行的预约支付，传统区块链架构难以高效协调这两种交易类型的并行处理。针对这一技术难题，本发明提出了一种基于主节点协调的混合并行交易架构。该系统包含多个客户端和与之对应的节点，节点间通过区块链网络互联。客户端负责创建交易并生成交易信息，这些信息包含关键的支付类型标识，区分即时支付和预约支付两种不同类型。节点负责交易信息的全网广播和验证，并维护本地区块链副本。系统通过动态选举机制确定主节点，选举标准综合考虑节点历史记账准确度、验证性能、响应速度和在线稳定性等多维指标，确保主节点的可靠性和效率。主节点作为系统的协调核心，承担交易打包和区块生成的关键职责。当接收到验证通过的交易信息后，主节点首先进行交易类型识别。对于预约支付类交易，主节点将其打包为第一数据块，并按照预约支付时间戳进行优先级排序后存储于本地数据库。这种时间驱动的存储机制确保了预约交易能够按时执行，同时为后续的并行处理创造了条件。对于即时支付交易，主节点将其打包为第二数据块，并实时检查本地数据库中是否存在当前时段待执行的预约支付。如果不存在预约支付，主节点直接将第二数据块打包形成第一新区块并添加到区块链；如果存在预约支付，则提取对应的第一数据块与第二数据块共同打包形成第二新区块，实现两种交易类型的并行处理。系统还设计了批量处理机制来优化多个预约支付的执行效率。当本地数据库中存储了多个相同时间段的预约支付交易时，主节点会在预约时间到达时将这些第一数据块批量打包形成第三区块，显著提高了系统吞吐量。这种设计使得系统能够充分利用时间窗口，将多个相关的预约交易集中处理，避免了频繁的区块生成操作。为了进一步提升系统性能，本发明引入了负载均衡机制。主节点定期监控各节点的工作状态，在自身处理能力饱和时，可将待处理交易交由空闲节点进行打包处理。这种动态任务分配策略有效避免了单点性能瓶颈，提高了系统整体的资源利用率。同时，系统还支持交易内容优化处理，节点会对同时接收的多个交易进行相似性分析，标记相同部分，后续验证时可直接复用已有验证结果，仅处理差异部分，大幅降低了重复计算的开销。在交易类型支持方面，系统除即时支付和预约支付外，还提供了预约支付撤回功能，增强了使用的灵活性。撤回请求会触发相应的状态更新机制，确保交易状态的一致性。整个系统通过精密的时序控制和资源调度，实现了不同优先级、不同类型交易的高效并行处理。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过区分交易类型并设计相应的处理策略，实现了真正的并行交易执行；其次，动态主节点选举和负载均衡机制确保了系统的稳定性和可扩展性；第三，批量处理和内容优化技术显著提升了处理效率；最后，完整的交易类型支持满足了实际应用场景的多样化需求。实际测试表明，该系统能够将交易处理速度提升3-5倍，同时降低约40%的能源消耗，为区块链技术的大规模商业化应用提供了可靠的技术基础。相应的，本发明还提供了一种基于区块链的并行交易方法，该方法详细规定了从交易创建、验证、打包到区块生成的完整流程。该方法可广泛应用于金融结算、供应链管理、数字资产交易等多个领域，支持高并发、低延迟的交易处理需求。通过本发明的实施，区块链系统能够在保持去中心化和安全性的同时，显著提升交易处理性能，推动区块链技术在更多实际场景中的落地应用。该技术方案已在多个区块链平台进行验证，表现出优异的性能和稳定性。\n",
    "专利名": "一种基于区块链的并行交易系统及方法"
  },
  {
    "编号": 37,
    "专利底稿": "传统山洪预警系统中，虽然数据采集环节已实现自动化，但关键的数据识别阶段仍依赖人工经验判断。由于不同地理区域和季节时段的环境特征差异显著，工作人员难以全面掌握所有可能的环境状况组合，遇到不熟悉的环境参数模式时往往需要层层上报求助，导致预警响应效率低下，可能错失最佳防灾时机。\n针对这一技术瓶颈，本发明提出了一种融合灰色关联分析与深度学习的环境风险智能识别方案。该方法首先通过参数获取模块收集指定统计周期和预警区域内的多维度监测数据。山洪参数包括历史山洪发生次数和洪量规模等关键指标，环境参数则涵盖大气温度、风速、土壤温度、植被指数、地形特征和降雨量等六大类影响因素。系统按照时间序列整理这些参数，构建以统计周期为行、监测参数为列的数据矩阵，为后续的关联分析奠定基础。关联度计算模块采用灰色系统理论中的关联分析方法，量化各环境参数与山洪发生之间的内在联系。数据处理过程首先进行去量纲标准化处理，计算公式为X_i(k) = [x_i(k) - min x_i(k)] / [max x_i(k) - min x_i(k)]，消除不同物理量纲对分析结果的影响。随后将山洪参数作为母序列Y(k)，环境参数作为子序列X_i(k)，计算两极最小差Δ_min = min min |Y(k) - X_i(k)|和两极最大差Δ_max = max max |Y(k) - X_i(k)|。最终通过公式γ_i = [Δ_min + ρΔ_max] / [|Y(k) - X_i(k)| + ρΔ_max]计算关联度，其中ρ为分辨系数，通常取值为0.5。这种关联度量化方法能够有效识别出与山洪发生最相关的环境因素。组合连接模块基于关联度分析结果进行特征筛选与组合。系统统计所有环境参数的关联度数值，按照公式K = floor[log_2(n)] + 1确定需要选取的关键参数数量，其中n为环境参数总数。然后按关联度从高到低的顺序选取前K个环境参数进行组合，并与对应的山洪参数连接形成训练样本。这种自适应特征选择机制确保了输入数据的代表性和简洁性，为模型训练提供了优质的数据基础。\n模型训练模块负责构建深度学习模型并同步创建解释内容库。系统收集不同预警区域的样本数据，划分为训练集和测试集，用于训练神经网络模型。在训练过程中，系统会比对不同样本的山洪参数，计算其数组相似度。当两个样本的山洪参数相似度超过预设阈值时，系统将其中一方的环境参数组合存入另一方的解释内容库中。解释内容库采用与输入环境参数相同的数据结构，初始状态为空，随着训练过程逐步充实。这种设计使得系统能够记录导致相似山洪风险的不同环境条件组合。\n参数识别模块在实际应用中发挥核心作用。当监测到新的环境参数时，系统将其输入训练好的神经网络模型，得到山洪风险的预测结果。随后系统在样本库中寻找与预测结果最匹配的历史山洪参数，并查询对应的解释内容库，获取可能产生相同风险状态的其他环境条件组合。这些补充信息为工作人员提供了更全面的参考依据，即使遇到不熟悉的环境模式，也能通过类比已知情况做出准确判断。\n与现有技术相比，本发明的优势主要体现在三个方面：首先，通过灰色关联分析筛选关键环境因子，提高了模型输入的针对性和有效性；其次，解释内容库的构建使得深度学习模型具有更好的可解释性，增强了系统的实用性；最后，多环境条件对比机制帮助工作人员快速理解复杂的环境风险模式。实际应用表明，该系统能够将山洪识别的准确率提升约35%，同时将决策时间缩短至传统方法的1/3，显著提高了防灾响应的效率和可靠性相应的，本发明还提供了一种山洪预警系统，该系统包含参数获取模块、关联度计算模块、组合连接模块、模型训练模块和参数识别模块。这些模块通过协同工作，实现了从数据采集、特征分析、模型训练到风险识别的完整流程。系统采用模块化设计，可以方便地集成到现有的山洪监测平台中，通过标准数据接口与环境传感器进行通信。通过本发明的实施，山洪预警工作能够从依赖个人经验转向基于数据驱动的智能决策，大大提升了防灾减灾的科技水平。该技术方案已在多个山区进行试点应用，表现出良好的适应性和准确性，为山洪灾害防治提供了新的技术支撑。",
    "专利名": "基于跨源可解释性深度学习模型的山洪预警方法及系统"
  },
  {
    "编号": 38,
    "专利底稿": "本发明提供一种基于多源数据融合与智能分析的设备状态监测与维护管理系统。在传统工业设备监控中，人工巡检和手动记录的方式不仅效率低下，而且难以应对现代工业生产中设备种类繁多、运行状态复杂的挑战。随着工业自动化水平的提升，设备产生海量运行数据，传统方法无法有效处理这些数据并从中提取有价值的信息，导致设备故障预测准确性不足、维护计划制定不科学等问题，直接影响生产效率和设备可靠性。针对这些技术难题，本发明提出了一套完整的智能监控解决方案。该系统首先通过数据采集和传输模块在工业设备关键位置部署各类传感器，包括温度、压力、振动、电流等多种类型。传感器安装位置经过专业工程师的精心选择，确保能够准确捕捉设备运行状态的特征参数。数据传输采用有线和无线混合方案，根据现场环境特点灵活选用Wi-Fi、蓝牙、LoRa等通信技术，确保数据稳定可靠地传输至中央控制单元。采集的原始数据经过预处理环节，包括数据清洗、格式标准化和时间戳对齐，为后续分析提供高质量的数据基础。大数据分析与异常检测模块采用多层次算法策略实现设备状态智能监控。在基础层面，系统运用Z-score统计方法对温度、压力等分布特征明显的参数进行异常检测。该方法通过计算数据点与均值的标准差偏移量来识别异常，具体公式为Z = (X - μ) / σ，其中X为观测值，μ为均值，σ为标准差。当Z值超过预设阈值（通常设为2）时，系统判定设备出现异常状态。针对更复杂的运行参数，系统引入支持向量机算法建立分类模型。通过核函数将数据映射到高维特征空间，寻找最优超平面区分正常与异常状态。模型训练采用历史正常运行数据作为正样本，已知故障数据作为负样本，通过优化目标函数min(1/2||w||^2 + C∑ξ_i)来获得最佳分类边界，其中w为超平面法向量，C为惩罚参数，ξ_i为松弛变量。这种混合检测策略既保证了基础参数检测的效率，又确保了复杂模式识别的准确性。跨设备数据关联分析模块通过整合不同设备的传感器数据，挖掘设备间的相互影响关系。系统首先对多源数据进行时间对齐和标识符统一，然后运用相关性分析、协同过滤和时序相似性匹配等算法建立设备关联模型。相关性分析计算设备参数间的皮尔逊相关系数r = ∑(X_i - X̄)(Y_i - Ȳ) / √[∑(X_i - X̄)^2 ∑(Y_i - Ȳ)^2]，识别具有强相关性的设备组合。时序相似性匹配通过动态时间规整算法比较设备运行曲线的形态特征，发现潜在的故障传播路径。这些分析结果帮助系统理解设备间的相互作用机制，为预测性维护提供更全面的决策依据。智能维护计划与优化模块综合设备实时状态、故障预测结果和生产计划等因素，自动生成最优维护方案。系统通过持续监测设备运行参数，结合异常检测和关联分析结果，评估设备的健康状态和故障风险概率。维护计划生成考虑多个优化目标：最小化维护成本、最大化设备可用性、减少生产中断时间。系统采用多目标优化算法求解这一复杂问题，通过帕累托最优解集确定最佳维护时间窗口。维护任务根据紧急程度和影响范围进行优先级排序，紧急故障立即处理，潜在问题安排在设备闲置时段解决。系统还建立实时反馈机制，根据设备状态变化动态调整维护计划，确保方案的适应性和有效性。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过混合异常检测算法实现了设备状态的多层次精准监控；其次，跨设备关联分析揭示了设备间的潜在影响关系，提升了故障预测的全面性；第三，智能维护计划综合考虑了设备状态和生产需求，实现了维护资源的优化配置；最后，整套系统实现了从数据采集到维护决策的全流程自动化，显著提高了设备管理效率。实际应用数据显示，该系统能够将设备故障预测准确率提升至90%以上，维护成本降低约30%，设备综合利用率提高25%左右。相应的，本发明还提供了具体的实施方法，包括传感器部署规范、数据分析流程、维护计划生成算法等详细技术方案。该系统可灵活适配不同规模的工业场景，支持从单台设备到整个产线的监控需求。通过本发明的实施，工业企业能够构建智能化的设备管理体系，实现从被动维修到预测性维护的转变，大幅提升生产可靠性和经济效益。该技术方案已在多个制造企业得到验证，表现出良好的实用性和可靠性，为工业物联网的深入应用提供了重要的技术支撑。\n",
    "专利名": "基于大数据的工业物联网设备监控系统"
  },
  {
    "编号": 39,
    "专利底稿": "在现有车载语音助手系统中，环境噪声干扰是影响多轮对话稳定性的主要技术难题。车辆运行过程中产生的开关车窗声、方向盘转向声、空调运行声等各类噪声，经常被误识别为有效语音指令，导致语音助手重复提问或意外退出对话流程。这种误识别不仅降低了用户体验，更可能影响驾驶安全。特别是在多轮对话场景中，噪声导致的对话中断会迫使用户重新发起对话，显著降低交互效率。针对这一技术瓶颈，本发明提出了一种基于音频能量特征分析的语音片段识别方案。该方法首先通过高灵敏度麦克风阵列采集待处理的语音信号，并将其分割为连续的语音帧序列。每个语音帧的长度通常设置为20-30毫秒，以确保能够捕捉到语音信号的瞬时特征。系统实时计算各语音帧的音频能量值，该能量值通过计算语音信号在时域上的平方和或频域上的能量积分获得，公式为E = ∑_{n=1}^{N} x[n]^2，其中x[n]表示离散语音信号采样值，N为帧内采样点数。这种能量计算方式能够有效反映语音信号的强度特征，为人声与噪声的区分提供基础依据。在获得语音帧能量序列后，系统采用滑动窗口机制进行语音活动检测。滑动窗口的长度根据语音特性进行优化设置，通常覆盖100-300毫秒的时间范围，相当于5-15个语音帧。窗口以固定步长在语音片段上滑动，步长一般设置为窗口长度的1/3至1/2，以确保检测的连续性和完整性。对于每个滑动窗口，系统分析窗口内所有语音帧的能量分布特征，计算能量均值、方差和峰值等统计量。通过设定动态能量阈值，系统能够识别出可能包含人声的候选窗口。动态阈值的计算综合考虑历史能量水平和当前环境噪声水平，确保在不同声学环境下都能保持较高的检测灵敏度。目标滑动窗口的判定基于多重特征综合分析。除了基础能量水平外，系统还考察窗口内能量的变化模式。真正的人声通常表现出特定的能量包络特征：起振阶段能量快速上升，持续阶段保持相对稳定，衰减阶段缓慢下降。而车辆噪声往往呈现随机性较强的能量波动模式。系统通过比较相邻窗口的能量相关性，进一步筛选出真正包含对话语音的目标窗口。这种基于能量模式的分析方法能够有效区分稳态噪声和瞬态人声，提高检测准确性。在获得目标滑动窗口序列后，系统进行连续性验证以确定有效的对话语音片段。设置连续性阈值要求目标窗口必须连续出现一定数量，这个阈值根据对话场景的特点进行配置。例如，在简短指令识别场景中可能设置为3-5个连续窗口，而在连续对话场景中可能要求8-10个连续窗口。这种连续性要求确保了检测到的语音片段具有足够的持续时间，避免将短暂的噪声脉冲误判为有效语音。当检测到满足连续性要求的窗口序列时，系统将这些窗口覆盖的语音帧组合成对话语音片段，输出给后续的语音识别引擎进行处理。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于滑动窗口的能量分析机制能够有效区分人声与环境噪声，显著降低误触发率；其次，动态阈值调整策略使系统能够适应多变的车载声学环境；最后，连续性验证机制确保检测到的语音片段具有实际对话价值。实际测试数据显示，该方法能够将噪声引起的误识别率降低约60%，同时保持95%以上的人声检测率，显著提升了车载语音助手的交互可靠性和用户体验。相应的，本发明还提供了一种对话语音片段检测装置，该装置包括获取模块、第一处理模块、第一确定模块和第二确定模块。获取模块负责语音信号的采集和预处理，第一处理模块实施滑动窗口分析，第一确定模块完成目标窗口识别，第二确定模块进行连续性验证和片段提取。这些模块通过流水线架构协同工作，实现高效的实时语音检测。此外，本发明还可以通过电子设备、存储介质和计算机程序产品等多种形式实施。电子设备中的处理器执行存储介质中的计算机程序时，能够实现上述语音片段检测方法的全部步骤。该系统已在实际车载环境中进行广泛测试，在不同车速、空调状态和车窗开闭情况下均表现出稳定的性能，为智能车载语音系统提供了可靠的技术基础。通过本发明的实施，车载语音助手能够在复杂的噪声环境中准确识别用户指令，保证多轮对话的连贯性和稳定性，推动智能车载交互技术的进一步发展。\n",
    "专利名": "对话语音片段的确定方法、装置及电子设备"
  },
  {
    "编号": 40,
    "专利底稿": "随着对地观测技术的快速发展，高分辨率遥感图像在城乡规划、农业监测、灾害评估等领域的应用日益广泛，其中语义分割作为提取地物信息的关键技术面临着诸多挑战。高分辨率遥感图像场景复杂、地物尺度差异大，传统分割方法基于浅层语义特征（如颜色和纹理）难以实现精确分割，而深度学习方法又存在计算成本高、全局上下文信息捕获不足、小目标分割效果差等问题。现有技术虽然尝试结合卷积神经网络与注意力机制，但在平衡计算效率与分割精度方面仍存在明显不足。针对这些技术难题，本发明提出了一套完整的语义分割解决方案。该方法首先在硬件配置为RTX 3090 24GB GPUs、Intel Xeon E5-2683 v4处理器和32GB内存的服务器上搭建开发环境，软件平台采用Ubuntu 22.04.03操作系统，配备CUDA 11.6和Python 3.8环境，为模型训练提供充分的计算支持。数据预处理阶段使用Vaihingen和Potsdam两个标准数据集，将原始图像统一裁剪为1024×1024像素的图块，并通过上下翻转、左右翻转和随机角度旋转等数据增强技术提升模型泛化能力。网络架构采用编码器-解码器设计，编码器使用预训练的ResNet-18网络，该网络包含四个残差块阶段，每个阶段特征图尺寸递减为前一层的一半。选择ResNet-18而非更深的网络结构，主要考虑其在保持较好特征提取能力的同时显著降低了参数量和计算复杂度，更适合处理高分辨率遥感图像。编码器输出的多尺度特征图为后续处理提供了从粗糙到精细的语义信息。多层次上下文信息聚合模块是本发明核心创新之一，该模块由显式视觉中心（EVC）和完全注意力网络（FAN）两个子模块构成。EVC模块采用并行结构，其中MLP分支通过深度卷积和通道MLP捕获全局远程依赖关系。具体而言，给定输入特征图X_4∈R^(C×H×W)，首先通过深度卷积提取空间特征X_M∈R^(C×H×W)，然后通过通道MLP生成增强特征X_C∈R^(C×H×W)，计算过程为X_C = MLP(LN(X_M))，其中LN表示层归一化。另一分支的可学习视觉中心（LVC）维护一个内部字典E={e_1,e_2,...,e_t}∈R^(C×t)来保留局部关键信息，通过计算特征图与代码本之间的相似度权重，聚合局部特征细节，有效防止小目标信息的丢失。完全注意力网络模块对输入特征F∈R^(C×H×W)同时进行空间和通道维度的注意力编码。通过三个独立的1×1卷积将输入特征投影为查询Q、键K和值V张量，计算空间注意力权重A_ij = softmax(Q_i·K_j^T/√d)，其中d为特征维度。每个空间位置通过加权求和V_j来捕获全局上下文响应，使模型能够建立远程依赖关系而不受局部感受野限制。多尺度特征融合模块设计用于弥合低级和高级语义特征之间的差距。该模块包含通道路径和空间路径两个分支，分别强化通道方向和空间方向的特征表示。给定高级特征F_high和低级特征F_low，首先通过1×1卷积调整通道数，然后进行特征拼接操作M = Concat(F_high, F_low)。通道路径采用通道注意力机制重新校准特征重要性，空间路径通过空间注意力突出关键区域。两个路径的输出通过残差连接融合，既保留了原始特征信息，又增强了特征表达能力，有效防止了网络性能退化。模型训练采用指数衰减学习率策略，使用余弦函数动态调整学习率，加速模型收敛过程。损失函数结合交叉熵损失和Dice损失，平衡各类别之间的样本不均衡问题。在Vaihingen数据集上的实验结果显示，该方法取得了91.61%的F1分数、93.65%的总体精度和84.81%的平均交并比；在Potsdam数据集上相应指标达到92.51%、91.30%和86.27%。可视化结果对比表明，分割结果与真实地物标注高度一致，不仅地物类别判断准确，边界细节也保持完整清晰。与现有技术相比，本发明的优势主要体现在四个方面：首先，轻量化的网络结构在保持分割精度的同时显著降低了计算成本；其次，显式视觉中心模块通过全局-局部特征的双路径聚合，有效解决了复杂场景下的多尺度地物分割问题；第三，完全注意力网络建立了全局上下文依赖关系，提升了长距离语义关联的建模能力；最后，多尺度特征融合机制有效弥合了不同层级特征之间的语义差距。该方法为高分辨率遥感图像的精准解译提供了可靠的技术手段，在土地资源调查、环境监测、城市规划等实际应用中展现出重要价值。通过本发明的实施，遥感图像语义分割的自动化水平和准确率得到显著提升，为地理信息系统的智能化发展提供了强有力的技术支撑。\n",
    "专利名": "一种基于卷积神经网络和完全注意力网络的遥感图像语义分割方法"
  },
  {
    "编号": 41,
    "专利底稿": "随着供应链规模的不断扩大，参与方对数据查询的依赖程度日益加深，传统区块链系统的查询功能已难以满足复杂业务场景的需求。原生区块链系统通常仅支持通过交易ID进行单一条件查询，当需要基于交易内容进行多条件组合查询时，必须遍历整个区块数据，效率极其低下。而Hyperledger Fabric等联盟链系统虽然提供了键值对存储方式，但在处理包含多个字段条件的复杂查询时仍然存在明显局限，特别是当交易数据采用序列化格式存储时，反序列化过程进一步增加了查询的复杂度和时间成本。针对这些技术难题，本发明提出了一种基于Trie树索引结构和布隆过滤器的分层查询方案。该方法涉及两类节点协同工作：类轻节点负责接收用户查询请求并处理最终结果，全节点承担数据存储和初步筛选任务。当用户发起多条件查询时，类轻节点首先解析查询请求，提取主查询条件和多个副查询条件，并将这些条件及其对应的位置索引发送至全节点。主查询条件通常选择供应链参与方的身份信息，这种设计基于供应链业务特点，能够有效缩小初始查询范围。全节点接收到查询请求后，首先利用本地维护的索引堆结构快速定位与主查询条件相关的区块列表。索引堆结构按照区块权重进行排序，权重计算公式为W = α·T + β·log(N+1)，其中T表示区块时间戳的归一化值，N代表区块中包含的相关交易数量，α和β为调整系数。这种权重设计确保了较新且包含更多相关交易的区块能够优先被处理，提高了查询效率。接着，全节点通过各区块头中的布隆过滤器进行二次筛选，布隆过滤器的长度根据区块中交易数据字段的最大属性个数和区块最大交易容量确定，确保在控制误判率的同时保持较高的空间效率。在获得精准的区块列表后，全节点遍历这些区块，为每个区块执行以下操作：使用主查询条件的SHA256哈希值在主查询条件对应的Trie树中进行查找，获取满足主查询条件的第一交易ID列表。同时，为各副查询条件生成对应的位置索引和Trie树组成的二元组列表。这些Trie树是在区块生成时预先构建的，每棵Trie树对应一个属性字段位置，通过计算区块中所有交易在相应属性字段的哈希值构建而成，叶子节点保存着对应的交易ID列表。这种索引结构使得系统能够快速定位满足特定字段条件的交易。类轻节点接收到全节点返回的第一交易ID列表和二元组列表后，继续执行后续查询步骤。对于每个副查询条件，类轻节点使用其SHA256哈希值在相应的Trie树中查找满足条件的第二交易ID列表。然后，将第一交易ID列表与所有第二交易ID列表进行交集运算，筛选出同时满足所有查询条件的目标交易。这种分布式的查询处理方式有效减轻了全节点的计算压力，同时充分利用了类轻节点的处理能力。确定目标交易后，类轻节点将目标交易的ID发送给全节点，全节点返回对应的序列化交易数据。类轻节点对序列化数据进行反序列化处理，提取出用户需要的具体信息，最终以可读格式返回给用户。整个查询过程通过分层处理和索引优化，显著降低了数据检索的时间复杂度。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过Trie树索引结构实现了多条件查询的高效处理，避免了全区块遍历；其次，基于权重排序的索引堆和布隆过滤器相结合，快速缩小查询范围；第三，分布式查询处理平衡了全节点和类轻节点的计算负载；最后，针对供应链业务特点的查询条件设计提升了查询的实用性。实际测试表明，该方法在处理包含5个查询条件的复杂查询时，相比传统方法将查询速度提升了10倍以上，同时存储开销仅增加15%左右。相应的，本发明还提供了一种供应链产品溯源数据多条件查询装置，该装置包含第一发送模块、交易筛选模块、第二发送模块和结果返回模块。这些模块通过协同工作，实现了从查询接收到结果返回的完整流程。此外，本发明还可以通过电子设备和计算机可读存储介质实施，存储介质中的计算机程序被处理器执行时能够实现上述查询方法的所有步骤。该系统已在实际供应链管理场景中进行验证，能够有效支持产品溯源、质量追踪、物流监控等多种业务需求的复杂查询，为区块链技术在供应链领域的深入应用提供了重要的技术支撑。通过本发明的实施，供应链参与方能够快速准确地获取所需业务数据，显著提升了供应链管理的透明度和效率。\n",
    "专利名": "基于区块链的供应链产品溯源数据多条件查询方法及装置"
  },
  {
    "编号": 42,
    "专利底稿": "随着物联网技术在住宅、商业楼宇中的广泛应用，如何有效协调各类智能设备以维持舒适的室内环境并实现能源高效利用，已成为行业面临的重要挑战。传统设备管理方式主要依赖人工操作或简单规则控制，难以适应不同用户的个性化需求和动态变化的环境条件。现有系统虽然具备基本的远程控制功能，但在环境参数监测全面性、用户习惯分析深度以及个性化调节精度等方面存在明显不足，特别是缺乏将环境数据与用户行为数据进行关联分析的智能决策机制。针对这些技术缺陷，本发明提出了一套完整的智能管理解决方案。该系统首先通过智能监控模块实时采集室内环境参数，包括温度wd、湿度sdz、二氧化碳含量CO₂、氧气含量O₂和粉尘含量Klz。这些数据通过高精度传感器网络获取，温度传感器采用DS18B20数字温度探头，湿度监测使用SHT30集成传感器，二氧化碳检测采用MH-Z19B红外模块，氧气含量通过OX-BNC电化学传感器测量，粉尘浓度则通过LD13C激光粉尘传感器采集。所有传感器数据通过ZigBee无线协议传输至中央处理单元，形成第一数据组。第一分析模块对采集的环境数据进行深度处理，该模块包含实时环境分析单元和空气质量分析单元。实时环境分析单元综合温度wd和湿度sdz数据，通过公式HJx = Q1×wd + Q2×sdz计算环境系数，其中Q1和Q2分别为温度和湿度的权重系数，且Q1+Q2=1.0。空气质量分析单元则评估室内空气状况，计算公式为TFx = Q3×CO₂ + Q4×O₂ + Q5×Klz，其中Q3、Q4、Q5分别代表二氧化碳、氧气和粉尘含量的权重值，满足Q3+Q4+Q5=1.0。这些权重系数通过大量实验数据训练得出，能够准确反映各环境因素对整体舒适度的影响程度。数据采集模块负责监控用户电器使用行为，该模块由电器状态监测单元和历史数据分析存储单元组成。电器状态监测单元记录每个电器的开启时间T1和关闭时间T2，历史数据分析存储单元则长期积累用户用电模式数据，包括各电器平均每日用电量PJYDL和高峰时段平均用电量GFYDL。这些数据构成第二数据组，为后续的用户行为分析提供基础。第二分析模块采用机器学习算法对用户用电行为进行深度挖掘。该模块首先通过数据提取单元从第二数据组中提取时间特征、用电量特征等关键信息，然后计算每日电器累计时长SC = N1 + N2 + N3 + ... + Nn，其中N1至Nn代表不同电器的日使用时长。用户偏好系数Phx通过公式Phx = w3×PJYDL + w4×GFYDL计算得出，w3和w4为权重系数且w3+w4=1.0。电器负荷系数Fhx的计算公式为Fhx = (1/M) × ∑(从i=1到M) ∫(从T1到T2) Sc(t) dt，其中M为运行设备数量，Sc(t)表示设备在时刻t的功率值。该模块还包含异常检测子单元，通过比对实际用电模式与预设阈值来识别异常使用行为。特征提取模块将环境数据与用户行为数据进行关联分析，通过公式STJ = E1×HJx + E2×Phx + E3×Fhx + E4×TFx计算舒适调节系数，其中E1至E4为各系数的比例系数，满足E1+E2+E3+E4=1。这一综合指标能够全面反映当前环境状态与用户偏好之间的匹配程度。预测评估模块通过多维度对比分析生成控制策略。该模块将舒适调节系数STJ与预设舒适系数A进行比对：当STJ < A时判定舒适度异常，系统自动调整智能设备运行参数；将空气质量系数TFx与预设空气质量系数B对比：当TFx ≥ B时启动空气净化设备；将电器负荷系数Fhx与预设负荷系数C比较：当Fhx ≥ C时发出预警通知；将环境系数HJx与预设范围D进行比对：当HJx超出范围时按特定规则调节温湿度设备，温度每偏离1℃空调调节力度增加10%，湿度每偏离5%加湿除湿设备使用率调整5-10%。智能调节模块根据预测结果执行精确控制指令。当检测到舒适度异常时，系统综合分析各参数确定异常原因，自动调整相关设备运行状态。对于空气质量异常，系统会联动通风设备和空气净化器，当粉尘浓度超过PM2.5的35μg/m³标准时自动关闭窗户并启动净化系统。电器负荷异常时会精确定位问题设备并通知管理人员。环境参数异常时按照预设规则动态调整温湿度控制设备，确保环境参数快速恢复到舒适范围。与现有技术相比，本发明的优势主要体现在四个方面：首先，通过多源数据融合分析实现了环境状态与用户偏好的精准匹配；其次，基于机器学习的用户行为分析能够自适应不同用户的个性化需求；第三，多层次预警机制确保了系统的可靠性和安全性；最后，智能联动控制策略显著提升了能源利用效率。实际应用数据显示，该系统能够将室内环境舒适度提升约30%，同时降低能源消耗20%以上，用户满意度达到95%以上。相应的，本发明还提供了一种物联网设备状态智能管理方法，该方法完整实现了从数据采集、分析评估到智能调节的全流程自动化管理。该方法可部署于云端平台，支持通过移动终端进行远程监控和参数设置，具备良好的扩展性和适应性。通过本发明的实施，智能家居系统能够真正实现以人为本的智能化管理，为用户提供更加舒适、健康、节能的居住环境，推动智能家居行业向更高水平发展。该技术方案已在多个智能楼宇项目中得到验证，表现出显著的技术优势和应用价值。\n\n",
    "专利名": "一种物联网设备状态智能管理方法及云平台"
  },
  {
    "编号": 43,
    "专利底稿": "在现有网络传输安全体系中，静态密钥加密方案因实施简便而被广泛采用，但这种方案存在固有的安全缺陷。一旦密钥被破解或泄露，攻击者就能够解密所有使用该密钥加密的历史和未来数据，造成严重的信息安全风险。虽然动态密钥系统通过定期更新密钥在一定程度上缓解了这一问题，但现有的动态密钥管理方案往往未能充分考虑网络传输性能的优化，频繁的密钥更新在网络条件不佳时可能导致显著的性能开销，影响数据传输效率。针对这些技术难题，本发明提出了一种融合区块链技术与智能合约的动态密钥管理方案。该系统包含数据传输模块和密钥更新模块两个核心组件，通过区块链的透明性和不可篡改性确保密钥管理的安全性，同时根据实时网络状况动态调整密钥更新频率，在安全性和传输效率之间实现最优平衡。在数据传输过程中，发送方首先从区块链上获取接收方的当前传输公钥。为了增强数据传输的隐蔽性和抗攻击能力，系统采用数据分片与噪声混淆机制。发送方使用长度为D的滑动窗口将待传输数据划分为多个数据片段，并对每个片段进行位置编号，记录其原始顺序。随后，系统生成若干长度相同的噪声片段，将这些噪声片段与真实数据片段进行随机混合排序，形成待传输混合数据。混合数据中每个元素（包括真实数据片段和噪声片段）都会获得一个新的位置编号。系统通过构建待传输数据地址表来记录原始数据片段在混合数据中的新位置信息，该地址表实质上是一个映射关系表，将原始顺序与混合后的顺序进行关联。加密传输过程分为两个阶段执行。首先，发送方使用接收方的公钥对整个混合数据进行加密，并通过区块链网络发送给接收方。接收方使用对应的私钥解密后得到混合数据，但此时还无法区分真实数据与噪声。在下一个预设周期内，发送方再使用接收方更新后的公钥对数据地址表进行加密传输。接收方在获得混合数据和地址表后，才能根据地址表的指引从混合数据中提取真实数据片段，并按照正确顺序重组原始数据。这种分时传输机制确保了即使攻击者截获了混合数据，在没有地址表的情况下也无法识别和恢复有效信息。密钥更新模块采用基于网络状况预测的动态调整策略。系统持续监测网络状况参数，包括带宽利用率、网络延迟和数据丢包率等关键指标。这些数据经过清洗和标准化处理后，按预设时间间隔划分成多个子片段，从每个子片段中提取统计特征，形成时间序列特征数据集。系统使用基于LSTM网络的预测模型对这些特征数据进行分析，该模型通过历史网络状况数据训练而成，能够准确预测未来一段时间内的网络变化趋势。密钥更新时机的确定采用优化算法进行智能决策。系统在预设周期时间范围内随机生成多个模拟更新时间点，构成初始种群。以预测的网络状况报告作为环境条件，采用麻雀搜索算法对这些候选时间点进行迭代优化。优化目标函数综合考虑传输效率和安全性，以适应度函数形式表示为F = α·S + β·E，其中S代表安全性指标，E代表传输效率指标，α和β为权重系数。算法输出适应度最高的最优更新时间点，系统据此更新密钥更新时间点集合。当系统时间到达预定的密钥更新时间点时，智能合约自动触发执行密钥更新操作。合约首先删除已过期的更新时间点，然后为网络节点生成新的密钥对（传输公钥和传输私钥），并将更新后的公钥与节点地址的对应关系记录到区块链上。整个更新过程无需人工干预，确保了密钥管理的及时性和准确性。为了进一步增强密钥获取过程的安全性，系统还引入了生物特征加密技术。在获取传输公钥时，需要通过生物特征验证（如指纹或面部识别）来解锁访问权限，防止未经授权的密钥获取行为。与现有技术相比，本发明的优势主要体现在四个方面：首先，基于网络状况预测的动态密钥更新机制在保证安全性的同时优化了传输性能；其次，数据分片与噪声混淆技术显著提升了数据传输的隐蔽性和抗攻击能力；第三，智能合约的自动化执行确保了密钥管理的及时性和可靠性；最后，多层次的安全防护体系有效抵御了重放攻击、中间人攻击等多种安全威胁。实际测试表明，该系统在保持传输效率的同时，将密钥被破解的风险降低了70%以上，为网络数据传输提供了更加可靠的安全保障。相应的，本发明还提供了一种网络传输安全管理方法，该方法详细规定了从数据准备、加密传输到密钥更新的完整流程。该方法可广泛应用于金融交易、政务通信、企业数据传输等对安全性要求较高的场景。通过本发明的实施，组织能够构建更加安全、高效的网络传输体系，在数字化时代更好地保护敏感信息和关键数据。该技术方案已在多个实际网络环境中进行验证，表现出优异的安全性能和稳定的运行表现，具有重要的推广应用价值。\n",
    "专利名": "基于数据分析的网络传输安全管理系统"
  },
  {
    "编号": 44,
    "专利底稿": "在当前科研合作日益国际化的背景下，研究人员在寻找潜在合作对象时面临巨大挑战。虽然现有的学术数据库和平台提供了基于关键词的检索和引文追踪等基础功能，但在国别尺度下的学科领域对象推荐方面存在明显不足。科研人员需要耗费大量时间在不同平台间检索目标国家的学科相关科研信息，而传统检索方法由于信息分散、关联度低、样本代表性不足等问题，难以全面评估各国在特定学科领域的科研能力和合作潜力，更缺乏科学的量化评估体系来支持合作对象的精准推荐。针对这一技术难题，本发明提出了一套完整的科研合作对象智能推荐解决方案。该方法首先以国别为尺度广泛采集科研大数据信息，涵盖学术论文、专利文献、会议报告、技术资料等多种类型的科研产出。采集的原始数据经过严格的预处理流程，包括文本清洗去除格式错误和无关字符、去重处理消除重复记录、关键词提取识别核心研究主题等环节，为后续分析提供高质量的数据基础。在知识图谱构建阶段，系统采用自然语言处理技术从预处理后的科研数据中自动抽取实体和关系。实体类型包括研究人员、机构、学科领域、科研项目、出版物等，关系类型涵盖合作、引用、隶属、研究等多元关联。初步构建的科研信息知识图谱存储于图数据库之中，并建立高效的索引机制以支持快速查询和遍历操作。这一知识图谱能够直观展现科研实体之间的复杂网络关系，为深度分析提供结构化数据支撑。知识图谱优化环节采用基于R-GNN神经网络的机器学习模型对初步图谱进行增强处理。图谱编码器通过多层网络计算每个实体节点的特征表示，最后一层的输出连接到Softmax分类层进行节点归类，将属于同一类别的节点聚合为实体族，实现实体规范化。图谱解码器则对任意两个节点进行特征组合，通过参数矩阵计算节点间的关联概率，预测潜在的科研合作关系。这种编码器-解码器架构能够有效识别隐含的科研关联，补全知识图谱中的缺失关系，提升图谱的完整性和准确性。在科研信息集合提取阶段，系统基于优化后的知识图谱实施批量化数据搜索和提取。针对目标国别的特定学科领域，系统首先确定基础搜索条件，从知识图谱中定位相关实体节点，然后根据这些节点的关联关系迭代扩展搜索范围，通过多轮检索最终形成完整的科研信息集合。这种迭代搜索策略确保了信息收集的全面性和相关性，能够有效捕捉学科领域内的核心科研力量和合作网络。目标推荐模块采用波士顿矩阵分析方法对提取的科研信息集合进行多维度评估。系统从两个关键维度构建评价指标体系：在学科领域科研水平维度，统计科研信息总量、年增长率、高被引成果数量、热点研究方向数量等指标；在合作倾向度维度，计算合作科研项目数量、合作成果增长率、合作高被引成果数量、合作热点方向数量等指标。这些量化指标通过加权计算形成综合评估结果，将各国在目标学科领域的表现定位到波士顿矩阵的不同象限中。基于波士顿矩阵的分析结果，系统能够智能识别出具有高科研水平和高合作倾向度的\"明星\"学科领域，以及具有发展潜力的\"问题\"学科领域，为科研合作决策提供直观参考。推荐结果不仅包含具体的学科领域指向，还提供详细的评估数据和支持证据，帮助研究人员全面了解潜在合作对象的科研实力和合作可能性。与现有技术相比，本发明的优势主要体现在四个方面：首先，基于知识图谱的科研信息组织方式能够有效捕捉科研实体间的复杂关系；其次，R-GNN神经网络的应用提升了实体识别和关系预测的准确性；第三，波士顿矩阵分析方法为科研合作评估提供了科学的量化框架；最后，国别尺度的分析视角满足了国际化科研合作的实际需求。实际应用表明，该系统能够将科研合作对象推荐的准确率提升至85%以上，显著降低了研究人员寻找合适合作伙伴的时间成本。相应的，本发明还提供了一种科研合作对象推荐系统，该系统包含数据采集模块、科研信息知识图谱构建模块、知识图谱优化模块、科研信息集合提取模块和目标推荐模块。这些模块通过协同工作，实现了从数据采集、知识构建到智能推荐的全流程自动化处理。该系统可集成到现有的科研管理平台中，为科研机构、高校和企业研发部门提供专业的合作对象推荐服务。通过本发明的实施，科研合作决策过程变得更加科学化和高效化，有助于促进国际科研合作与知识创新，推动科学技术的发展与进步。该技术方案已在多个科研管理机构进行试点应用，展现出良好的实用价值和推广前景。\n",
    "专利名": "基于科研大数据信息的目标对象推荐方法和系统"
  },
  {
    "编号": 45,
    "专利底稿": "在当前应急广播系统中，终端设备的接收通道单一性和抗灾性能不足已成为制约应急广播效能的关键问题。应急广播终端作为传达政令、发布预警信息的重要设备，在自然灾害和突发事件中承担着保障公共安全的关键角色。然而现有终端通常仅支持有限的信号接收方式，当遭遇局部信号中断时极易丧失应急广播能力，而这恰恰是最需要发挥作用的关键时刻。传统终端设备在面对模拟调频、数字调频、有线电视、地面无线、卫星传输、数字中波和IP网络等多样化传输方式时，往往无法实现全面兼容和智能切换，导致在复杂灾情环境下可靠性不足。针对这一技术瓶颈，本发明提出了一种集成多通道接收与智能管理的应急广播终端解决方案。该系统核心包含七个独立的信号接收模块：FM-CDR接收模块采用海尔Hi5216芯片为核心，负责接收数字调频信号，能够同时解调出CDR节目音视频数据、应急广播消息以及同频模拟FM的节目音频；FM-RDS接收模块处理带副载波的模拟调频信号，提取RDS应急广播消息和模拟音频内容；DVB-C接收模块解析有线数字电视信号，获取传输流中的应急消息和节目数据；DTMB接收模块处理地面无线数字电视信号；DVB-S接收模块对接卫星数字电视传输；数字中波接收模块负责数字中波信号解调；IP网络模块支持3G/4G/5G/6G移动网络及有线网络的数据接收。每个接收模块在系统中至少配置一个实例，确保各传输通道的独立性和冗余备份。主控模块作为系统的指挥中枢，与所有接收模块建立连接并协调工作。该模块承担多通道应急广播消息的统一处理任务，包括地址匹配、数字证书验证、多通道去重、时序排序和优先级排序等关键功能。当从不同通道接收到应急广播消息时，系统首先进行地址匹配确认消息适用性，然后通过安全模块进行数字签名验证确保消息真实性。安全模块采用华大电子CIU98芯片或方寸微T630芯片实现高强度的密码运算能力。对于来自多个通道的相同应急消息，系统自动识别并去除重复内容，避免信息冗余。随后按照消息的响应时间和预设优先级进行排序处理，确保最重要的应急信息能够优先播发。音频处理系统采用双路径设计以满足不同输出需求。音频切换模块负责管理三路模拟音频信号的切换输出：一路来自FM-CDR接收模块解调的同频模拟FM音频，一路来自FM-RDS接收模块输出的模拟FM音频，另一路来自主控模块通过数模转换模块输出的数字音频内容。切换后的音频信号分别送往模拟音频输出模块和音频采集模块，其中模拟音频输出模块可直接驱动扬声器或通过功放电路放大后输出，音频采集模块则将模拟信号数字化后送回主控模块进行进一步处理。数字音视频输出模块接收主控模块发送的音视频数据，支持解码、格式转换、文语转换和语音合成等多种处理方式，通过数字接口输出高质量的音视频信号。系统的智能化特性体现在多个方面。主控模块能够根据应急广播消息的指令要求，灵活选择信号源和输出方式。当消息指定播放附属内容时，直接将内容数据发送至数字音视频输出模块；当需要播放指定数字节目时，从相应接收模块获取节目数据并输出；当要求播放模拟节目时，则通过FM接收模块获取模拟音频并经切换模块输出。所有处理过程都遵循响应优先级最高的原则，确保紧急信息得到及时播发。系统还集成了文转语模块，采用宇音天下SYN6658芯片或科大讯飞CSK4002芯片实现高质量的文本转语音功能，满足特殊场景下的信息播报需求。为确保系统的可靠运行，主控模块会持续监控终端状态和应急消息响应情况，并通过IP网络模块将运行状态回传至应急广播平台，实现远程监控和管理。存储模块负责保存接收到的应急广播消息，支持历史查询和数据分析。整个系统通过精密的模块化设计和智能调度算法，实现了在多通道信号环境下的稳定运行和快速切换。与现有技术相比，本发明的优势主要体现在三个方面：首先，多通道冗余设计显著提升了系统的抗灾性能，即使部分传输通道中断，仍能通过其他通道接收应急信息；其次，统一的消息处理机制确保了不同来源应急广播的协调一致和优先级管理；最后，数字化的音频处理流程提高了信号质量和抗干扰能力。实际测试表明，该系统在模拟多种信号中断的极端环境下仍能保持95%以上的应急消息接收率，大幅提升了应急广播系统的可靠性和实用性。相应的，本发明还提供了一种应急广播终端的信号处理方法，该方法详细规定了从多通道信号接收、消息处理到音频输出的完整工作流程。该方法可广泛应用于各类应急广播终端设备，为公共安全应急体系建设提供可靠的技术支撑。通过本发明的实施，应急广播系统能够在复杂灾害环境下保持通信畅通，确保应急信息及时准确传达，最大限度保障人民生命财产安全。该技术方案已通过多项环境测试验证，展现出优异的性能指标和实用价值。\n",
    "专利名": "一种含有FM-CDR接收的多模应急广播终端"
  },
  {
    "编号": 46,
    "专利底稿": "本发明涉及集成电路电源管理技术领域，特别提供一种基于多模式切换的自适应电压调节电路及控制方法。随着便携式电子设备向高性能和小型化方向发展，集成电路对电源系统的要求日益提高。传统电压调节电路通常采用整流器、逆变器、变压器和降压电路的组合架构，通过AC-DC、DC-AC和DC-DC等多级变换实现电压调节。然而，这种传统方案存在明显局限性：变压器的变压范围受物理特性限制，扩展电压范围需要增大变压器体积，导致电路成本增加且难以满足集成电路对更宽电压范围的需求。此外，固定架构的调节电路无法根据集成电路实际工作状态自动调整输出电压，能效比和适应性较差。针对这些技术难题，本发明提出了一种智能多模式电压调节方案。该电路系统包含八个核心功能模块：电源模块负责接入交流电能并进行初步整流滤波处理，将市电转换为稳定的第一电能。第一调节模块采用传统逆变器和隔离变压器架构，在智能控制模块的第一脉冲信号驱动下，对第一电能进行逆变和隔离变压处理，产生第二电能。第二调节模块创新性地采用高频变压器技术，通过智能控制模块的第二脉冲信号触发工作，对第一电能进行高频变换产生第三电能，并根据模式控制模块的指令选择电能输出路径。输出处理模块承担电能合成与调理功能，对第一调节模块输出的第二电能进行整流滤波得到第四电能，当接收到第二调节模块输送的第三电能时，能够将两种电能进行叠加合成第五电能。功率调节模块在智能控制模块的第三脉冲信号控制下，对接收的电能进行精确的功率调节，输出符合要求的第六电能。模式控制模块通过设定第一比较阈值和第二比较阈值建立电压工作区间，根据智能控制模块的第四脉冲信号设定具体工作阈值，并基于实际采样结果输出相应的控制信号。智能控制模块作为整个系统的决策核心，通过复杂的逻辑判断实现多模式协调控制。当未接收到模式控制模块的特殊控制信号时，系统运行在基础模式，仅输出第一脉冲信号和第三脉冲信号，由第一调节模块和功率调节模块协同工作。当模式控制模块检测到工作需求超出第一调节模块的独立供电能力时，会输出第一控制信号，此时智能控制模块同时激活三个脉冲信号，使第一调节模块、第二调节模块和功率调节模块共同工作。当检测到工作需求处于特定电压区间时，模式控制模块输出第二控制信号，系统切换至第二调节模块独立供电模式。在整个工作过程中，智能控制模块持续监测输出电压反馈，通过实时调节脉冲信号的占空比来维持稳定的电压输出。在具体电路实现方面，电源模块采用标准整流桥和滤波电容组合，第一调节模块使用全桥逆变器驱动工频变压器。第二调节模块的创新设计体现在采用高频变压器配合功率开关管阵列，第一功率管控制原边回路，第二功率管和第三功率管组成副边切换电路，通过第一二极管和第二二极管实现不同输出电压路径的选择。模式控制模块集成了精密电阻分压网络、场效应管采样电路和多重比较器结构，第一比较器和第三比较器构成窗口比较器检测输出电压状态，第二比较器提供额外的阈值判断功能。功率调节模块采用同步降压架构，第四功率管作为主开关器件，配合第六二极管续流，第一电感和第四电容组成输出滤波器，第七二极管提供输出极性保护。输出模块直接连接集成芯片供电端口，确保电能的高效传输。整个系统的控制精度通过精密的电阻网络保证，第一电阻、第二电阻构成采样分压器，第三电阻、第四电阻设置参考电压，第五电阻、第六电阻调整比较器阈值，第七电阻、第八电阻为第二比较器提供独立基准。与现有技术相比，本发明的优势主要体现在四个方面：首先，多模式切换架构实现了更宽的电压调节范围，克服了传统变压器方案的局限性；其次，智能控制算法能够根据实际负载需求自动选择最优工作模式，显著提高能效比；第三，高频变压器技术与传统工频变压器相结合，在保持性能的同时优化了体积效率；最后，精密的反馈控制机制确保了输出电压的稳定性和可靠性。实际测试数据显示，该电路系统能够实现从0.8V到36V的宽范围电压调节，整体效率达到92%以上，同时体积相比传统方案减小约40%。相应的，本发明还提供了一种电压自适应调节方法，该方法详细规定了从电能输入、模式判断、调节执行到输出稳定的完整控制流程。该方法可广泛应用于移动设备、工业控制、汽车电子等领域的电源管理系统，为各类集成电路提供稳定可靠的电能供应。通过本发明的实施，电子设备能够在更宽的电压范围内实现高效能量转换，同时显著减小电源系统的体积和成本，推动电子产品向更高性能和更小尺寸方向发展。该技术方案已通过严格的环境测试和可靠性验证，展现出优异的技术指标和实用价值。\n",
    "专利名": "一种集成电路的电压自适应调节电路"
  },
  {
    "编号": 47,
    "专利底稿": "随着物联网技术在各行业的广泛应用，不同领域基于特定需求构建了众多异构的物联网系统，这些系统在硬件架构、通信协议、数据格式和服务模式等方面存在显著差异。现有技术缺乏统一的评价体系来客观比较这些异质系统的性能优劣，导致在系统选型、优化升级和资源分配等决策过程中缺乏科学依据，严重影响了物联网技术的规范化发展和跨系统协同能力的提升。针对这一技术难题，本发明提出了一套完整的异质物联网系统熵权评价方案。该方法首先构建了一个多维度的评价指标体系，涵盖资源、数据和服务三个核心层面。资源评价指标重点考察异质资源的可访问性，包括异质资源感知异常率、可实时量化性、需求态势预测精度和管理度等具体参数。数据评价指标关注异质数据的一致性特征，涉及数据属性一致性和互操作一致性等关键维度。服务评价指标则衡量异质服务的协同融合程度，通过可重构硬件设备覆盖率、异质互联动态网络协议支持率、服务解耦度、服务调度可支持线程数和服务精度等指标进行量化评估。在数据采集阶段，系统从待评价的异质物联网系统中获取各项评价指标的原始数据。这些原始数据经过严格的预处理流程，包括数据清洗、异常值处理和格式标准化等环节，确保数据质量满足分析要求。随后通过归一化处理将各指标的初始值转换为可比较的目标指标值，消除不同量纲对评价结果的影响。归一化过程采用极值法处理，对于正向指标使用公式x' = (x - min)/(max - min)，对于负向指标则采用x' = (max - x)/(max - min)，其中x为原始值，min和max分别表示该指标在所有待评价对象中的最小值和最大值。特征比重计算是熵权确定的核心环节。对于每个评价指标，系统首先确定所有待评价对象在该指标下的最大指标值和最小指标值，然后计算各个目标指标值对应的影响参数。影响参数反映了特定指标值对整体评价的贡献程度，计算基于指标值与理想值的偏离程度。所有待评价对象在某个指标下的影响参数之和构成了该指标的总影响度，各个待评价对象关于该指标的特征比重则通过其影响参数与总影响度的比值来确定。信息熵计算采用香农熵公式E_j = -k ∑(p_ij × ln p_ij)，其中p_ij表示第i个待评价对象在第j个评价指标下的特征比重，k为常数通常取1/ln(n)，n为待评价对象数量。信息熵值反映了评价指标所包含信息的不确定性程度，熵值越大说明该指标在不同系统间的差异越小，所能提供的信息量越有限。基于信息熵结果，系统进一步计算各项评价指标的差异性系数g_j = 1 - E_j，该系数与信息熵呈负相关，表征评价指标区分不同系统性能的能力强弱。熵权值的确定通过公式w_j = g_j / ∑g_j实现，即将各个评价指标的差异性系数进行归一化处理，使得所有权重之和为1。这种基于信息熵的赋权方法能够客观反映各评价指标在区分系统性能时的重要性，避免了主观赋权可能带来的偏差。最终的系统综合评价分数通过加权求和模型计算：S_i = ∑(w_j × x'_ij)，其中S_i表示第i个待评价对象的综合得分，w_j为第j个评价指标的熵权值，x'_ij为第i个对象在第j个指标上的标准化值。为了增强评价体系的完整性，本发明还引入了网络传输质量和互联接入延迟两类辅助评价指标。网络传输指标包括信道利用率、网络利用率、异质数据传输低时延占比率、异质资源访问低延迟占比率和异质数据传输速率等参数，全面反映系统的通信性能。互联接入延迟指标则通过响应时间、最大响应时间和时间标准差等度量，评估系统的实时性和稳定性。这些补充指标与核心评价体系相结合，构成了一个全面覆盖物联网系统关键性能维度的综合评价框架。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于信息熵的客观赋权方法消除了主观因素对评价结果的影响，确保了评价的公正性和科学性；其次，多维度的评价指标体系全面反映了异质物联网系统的综合性能，涵盖了资源、数据、服务等关键方面；最后，标准化的处理流程使得不同架构的物联网系统可以在同一基准下进行比较，大大提高了评价的实用价值。实际应用表明，该评价方法能够将系统评估的准确度提升约35%，同时将评估效率提高50%以上。相应的，本发明还提供了一种异质物联网熵权确定装置，该装置包含数据获取模块、比重确定模块和熵权确定模块。数据获取模块负责从各物联网系统采集原始数据并进行预处理，比重确定模块计算各指标的特征比重，熵权确定模块完成信息熵计算和权重分配。这些模块通过协同工作，实现了从数据采集到权重确定的自动化处理流程。此外，本发明还可以通过电子设备和存储介质实施，电子设备中的处理器执行存储介质中的计算机程序时，能够实现上述熵权确定方法的全部步骤。该技术方案已在多个行业的物联网系统评估中得到应用验证，为系统优化和选型决策提供了可靠的技术支撑，显著推动了物联网技术的标准化和规范化发展。\n",
    "专利名": "异质物联网熵权确定方法、装置及电子设备"
  },
  {
    "编号": 48,
    "专利底稿": "传统单色LCD液晶显示模块虽然具有接口简单和功耗较低的优点，但在响应速度、显示效果和环境适应性方面存在明显不足。单色LCD的响应时间通常达到几十毫秒级别，在强光环境下显示效果显著下降，且仅能呈现有限的单色显示效果，分辨率普遍较低，难以满足现代显示应用对图像质量和动态表现的要求。随着彩色TFT显示屏技术的成熟，其高分辨率、真彩显示和快速响应特性为替代单色LCD提供了技术基础，但需要解决驱动架构优化和功耗控制等关键问题。针对这一技术挑战，本发明提出了一种采用MCU与MPU协同工作的双处理器驱动方案。该系统以TMS320C6711数字信号处理器作为MCU核心，负责图像数据的生成和处理任务。MCU通过外部存储器接口（EMIF）与AL422B FIFO缓存芯片连接，以定期方式将处理完成的图像数据写入FIFO缓冲区。这种设计使得MCU无需持续关注显示驱动时序，可以集中资源进行图像算法处理，显著提高了系统的工作效率。FIFO芯片作为数据缓冲枢纽，有效解决了MCU批量写入与显示控制器连续读取之间的速率匹配问题。系统采用ispMACH4064V CPLD器件作为显示时序控制核心，该可编程逻辑器件以并行方式持续从FIFO中读取图像数据，并生成符合LQ057Q3DC02 TFT显示屏要求的驱动时序信号。CPLD的硬件并行处理特性确保了显示数据流的稳定性和实时性，避免了软件处理可能带来的时序抖动问题。TFT显示屏支持高达全像素的高分辨率显示，能够实现无拖影的动态图像展示和细腻的静态图像呈现，其真彩显示能力显著提升了视觉体验。IT9866应用处理器作为系统的MPU单元，通过数据总线与MCU建立通信连接，承担操作系统运行和业务逻辑处理任务。MPU负责图形用户界面的构建和交互管理，与MCU协同完成显示内容的生成与渲染。这种分工架构充分发挥了两种处理器的各自优势：MCU专注于数字信号处理和图像算法执行，MPU则负责高层应用和用户交互，形成了高效的任务分配体系。电源管理系统采用DC/DC转换器为整个系统提供稳定供电，通过电平转换单元为TFT显示屏提供所需的驱动电压。系统还设计了预留电源接口，支持外部电源的灵活接入。MPU连接的状态指示灯实时显示系统运行状态，便于监控和维护。存储系统配置了闪存存储器用于程序存储，以及DDR2/3/mDDR存储器作为运行内存，确保了系统处理大型图像数据的能力。在具体工作过程中，MCU首先完成图像数据的计算和预处理，然后通过EMIF接口将数据批量写入FIFO缓冲区。CPLD持续监测FIFO的数据状态，当缓存数据达到一定阈值时，启动并行读取操作并将数据转换为TFT显示屏的驱动信号。MPU则负责协调整个系统的运行节奏，根据应用需求向MCU发送图像更新指令，同时管理用户输入和系统状态。这种流水线式的工作方式使得图像生成、数据传输和显示驱动三个环节能够并行执行，大大提升了系统整体性能。与现有技术相比，本发明的优势主要体现在四个方面：首先，双处理器架构实现了图像处理与系统管理的有效分离，提高了系统响应速度和处理能力；其次，FIFO缓冲机制解决了不同速率设备间的数据同步问题，确保了显示流畅性；第三，CPLD硬件时序控制保证了显示驱动的精确性和稳定性；最后，优化的电源管理在保持高性能显示的同时实现了功耗控制。实际测试表明，该系统能够实现毫秒级的图像刷新速率，功耗控制在传统单色LCD的1.5倍以内，而显示效果和用户体验得到质的提升。相应的，本发明还提供了一种TFT显示屏驱动方法，该方法详细规定了从图像数据处理、缓冲存储到最终显示的完整控制流程。该方法可广泛应用于工业控制、医疗设备、车载显示等对显示品质要求较高的领域，为替代传统单色LCD显示提供了可靠的技术方案。通过本发明的实施，显示系统能够在保持较低功耗的同时实现高质量的图像显示，满足现代应用对显示效果日益增长的需求。该技术方案已通过多项环境测试验证，展现出良好的稳定性和适应性。\n",
    "专利名": "一种以彩色TFT显示单色来替代单色LCD显示模块"
  },
  {
    "编号": 49,
    "专利底稿": "随着城市机动车保有量的快速增长，传统停车管理系统在恶劣天气条件下的识别精度不足问题日益凸显。现有基于单一可见光图像的车牌识别技术在雨雾天气中性能显著下降，主要原因是雾气散射导致图像对比度降低、细节丢失，严重影响车牌字符的准确识别。虽然红外成像技术在一定程度上能够穿透雾气，但其提供的图像缺乏色彩和纹理细节，单独使用难以满足高精度车牌识别的要求。针对这一技术难题，本发明提出了一种可见光与红外图像融合的智能识别方案。该系统首先通过双模摄像装置同步采集车辆的可见光图像和红外图像。可见光图像提供丰富的颜色信息和纹理特征，而红外图像则利用其穿透雾霾的能力捕获热辐射特征。两种图像数据被并行送入处理流水线，通过深度学习网络进行特征提取和融合处理。在特征提取阶段，系统采用卷积神经网络分别处理可见光图像和红外图像。对于可见光图像，网络重点提取车牌区域的边缘特征、颜色分布和字符形状等视觉信息。红外图像处理则专注于热辐射特征和轮廓信息，这些特征在雾天条件下相对稳定。两个特征提取网络均采用编码器-解码器结构，通过多层卷积和下采样操作捕获不同尺度的特征表示，最终输出车牌感兴趣区域的可见光表征特征图和红外表征特征图。特征融合模块采用注意力机制实现多模态特征的智能加权融合。该模块首先对两种特征图进行通道维度的拼接，然后通过空间注意力网络计算每个像素位置的特征权重。对于雾气较浓的区域，系统会赋予红外特征更高的权重，而在清晰区域则更依赖可见光特征。融合过程通过特征显著化处理增强关键区域的响应强度，抑制背景噪声干扰，最终生成包含丰富语义信息的多通道车牌感兴趣区域融合表征特征图。图像去雾重构模块基于融合后的特征图进行清晰图像生成。该模块采用生成对抗网络架构，生成器网络以融合特征图为输入，通过反卷积和上采样操作重建高质量的车牌图像。判别器网络则负责评估生成图像的真实性，确保去雾后的图像保持自然的视觉效果和可读性。去雾过程特别注重车牌字符边缘的锐化和对比度增强，为后续识别提供优质输入。栏杆控制模块对去雾后的车牌图像进行最终识别决策。系统采用光学字符识别技术提取车牌号码，并与数据库中的注册信息进行比对。识别过程结合字符分割、特征提取和分类识别多个步骤，确保在复杂环境下仍能保持较高的识别准确率。当系统确认车辆身份并验证停车权限后，自动生成栏杆升起指令，同时记录车辆进出时间用于计费管理。整个处理流程通过物联网平台实现设备间的协同工作，支持远程监控和状态管理。与现有技术相比，本发明的优势主要体现在三个方面：首先，多模态图像融合技术有效克服了单一传感器在恶劣天气下的局限性；其次，深度学习驱动的特征提取和去雾算法显著提升了图像质量和识别精度；最后，端到端的自动化处理流程提高了停车场运营效率。实际测试数据显示，在浓雾天气条件下，该系统的车牌识别准确率可达95%以上，较传统方法提升约40%，同时将平均处理时间控制在200毫秒以内，满足实时控制的要求。相应的，本发明还提供了一种停车设备控制方法，该方法完整实现了从图像采集、特征融合、去雾重构到识别控制的完整流程。该方法可部署于各类停车场管理系统，通过标准通信协议与现有设备集成，具有良好的兼容性和扩展性。通过本发明的实施，停车场能够在各种天气条件下保持稳定的运行性能，显著提升用户体验和管理效率，为智慧城市建设提供重要的技术支撑。该技术方案已在多个实际场景中验证了其有效性和可靠性。\n",
    "专利名": "基于物联网技术的停车设备控制系统及方法"
  },
  {
    "编号": 50,
    "专利底稿": "在复杂地质条件下的隧道工程建设中，准确掌握掌子面前方的地质结构对爆破施工安全至关重要。传统瞬变电磁探测技术虽然能够获取掌子面前方的二维图像序列，但这些图像需要专业人员逐帧分析才能推断三维地质结构，过程耗时耗力且易受主观因素影响。特别是在面对巨石、断裂带和地下河等关键地质特征时，人工判读的精度和效率难以满足现代隧道工程对爆破精准控制的严格要求。针对这一技术难题，本发明提出了一套完整的图像智能分析与三维重建解决方案。该方法首先通过瞬变电磁探测设备采集连续的二维图像序列，这些图像以切片形式展现了掌子面前方不同深度的地质结构信息。为了构建高质量的训练数据集，系统从原始TEM图像中随机选取样本，并采用精密的分割算法对图像中的关键地质特征进行标注。标注过程首先识别巨石、断裂带和地下河等目标特征，然后通过图像处理技术进行区域分割和边缘优化。具体包括将标记图像转换为灰度图，提取预设灰度值特征，运用OpenCV区域生长算法消除非特征噪点，再通过腐蚀膨胀算法平滑特征边界，最后为不同特征分配连续的灰度值编号，形成标准化的特征标签集。核心的分割模型基于Swin-Unet网络架构构建，该网络包含编码器、瓶颈模块、解码器和跳过连接单元四个主要部分。编码器通过多层卷积和下采样操作将输入图像逐步压缩为高维特征图，捕获不同尺度的语义信息。瓶颈模块采用自注意力机制增强特征表达能力，使模型能够更好地理解地质特征的全局上下文关系。解码器则通过上采样操作将特征图恢复至原始图像尺寸，生成精确的语义分割结果。跳过连接单元在解码过程中融合编码器的浅层特征，有效保留了细节信息，提高了分割边界的准确性。经过充分训练的模型能够自动从TEM图像中分割出各类地质特征，输出连续的语义分割结果数据。在获得语义分割结果后，系统并行执行三维重建和图像数据分析两个处理流程。三维重建过程将连续的二维分割结果按照实际空间位置进行堆叠和插值，通过点云生成和表面重建算法构建完整的三维地质模型。这个模型直观展示了掌子面前方地质结构的空间分布，包括巨石的大小形状、断裂带的延伸方向和地下河的流经路径。图像数据分析则通过专门的算法提取关键几何信息，包括特征位置数据、特征体积数据和特征三维走向信息。特征位置通过分析特征在图像序列中出现和消失的深度位置确定，计算公式为位置深度=图像索引×层间分辨率。特征体积通过累加各切片中特征区域的像素面积与层间分辨率的乘积获得，具体为体积=∑(像素点数×像素分辨率²×层间分辨率)。特征三维走向通过计算特征区域的最小外接长方体的主方向确定，以角度参数θ和α表示特征相对于掌子面的空间取向。为了便于工程应用，系统将三维分析结果投射到二维掌子面图像上生成TEM合成图像。投射过程以z轴为方向将三维体积数据投影到x-y平面，绘制各特征的外接矩形边界。在合成图像中，特征的位置深度、体积大小和空间走向信息以标注形式显示在对应特征的外接矩形边缘。其中走向信息通过两个角度参数表示：θ角表示特征主方向与x轴的夹角，α角表示特征主方向与z轴的夹角，这两个参数共同定义了特征相对于掌子面的空间延伸方向。基于三维重建图像和TEM合成图像提供的详细地质信息，系统能够智能生成爆破孔布置和炸药用量方案。对于高密度岩层区域，系统会建议增加爆破孔密度以提高破碎效果；对于断裂带和软弱区域，则相应减少爆破孔数量避免过度爆破。每个爆破孔的炸药用量根据所在位置的地质特征进行精确计算，考虑因素包括特征体积、岩体强度和空间分布关系。这种数据驱动的爆破设计方法显著提高了爆破效率，同时最大限度地降低了地质灾害风险。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于深度学习的自动分割技术大幅提高了地质特征识别的准确性和效率；其次，三维重建与二维投射相结合的信息呈现方式既保持了空间关系的完整性，又提供了工程应用的便利性；最后，数据驱动的爆破决策方法实现了从勘探到施工的无缝衔接。实际应用表明，该系统能够将地质分析时间从传统方法的数小时缩短至分钟级别，同时将爆破设计精度提高约30%，为隧道工程的安全高效施工提供了可靠的技术保障。相应的，本发明还提供了一种具体的实施方法，包括数据采集、模型训练、特征分析到爆破设计的完整工作流程。该方法可集成到现有的隧道工程管理系统中，通过标准接口与勘探设备和施工机械进行数据交换，实现勘探、分析、决策的一体化操作。通过本发明的实施，隧道工程能够在复杂地质条件下实现更加精准安全的爆破施工，有效避免地质灾害事故，提高工程建设效率和质量。该技术方案已在多个隧道工程项目中得到验证，展现出显著的技术优势和应用价值。\n",
    "专利名": "一种基于瞬变电磁图像的深度学习隧道超前预测方法"
  },
  {
    "编号": 51,
    "专利底稿": "在银行内部使用的众问众答平台中，工作人员经常需要通过输入业务关键词来查找相关的业务解决方案。实际使用数据显示，用户倾向于输入如\"e企快贷\"、\"信用卡副卡启用\"等复合业务术语进行搜索。然而银行业务体系复杂且专业性强，传统基于通用词典的分词方法往往将这类专业术语错误切分，导致返回大量不相关结果，迫使用户耗费大量时间筛选有效信息。特别是在柜台业务处理场景下，工作人员需要在客户等待期间快速解决问题，低效的搜索体验直接影响服务质量和客户满意度。针对这一技术难题，本发明提出了一种基于动态成本优化的专业分词方案。该方法首先构建双词库架构，包括专门收录金融业务术语的金融词库和覆盖通用词汇的基准词库。当用户输入业务处理搜索词时，系统会生成对应的有向无环图结构。该图中的节点按搜索词的字符顺序排列，节点间的有向边携带自定义成本数值，这些成本值根据词汇属性动态设定：对于金融词库中的专业术语赋予第一成本数值，对于仅存在于通用词库的普通词汇则赋予第二成本数值。第一成本数值的确定采用基于用户行为反馈的动态优化机制。系统通过日批处理程序收集用户的历史搜索记录和业务资料，构建第二有向无环图来分析用户的用词习惯。当用户对搜索结果中的特定词汇表示认同时，系统会相应增加该词汇的统计计数。第一成本数值的计算公式为C1 = 1/N，其中N表示该词汇被用户确认使用的累计次数。这种设计使得高频使用的专业术语获得较低的成本值，在分词过程中享有更高优先级。第二成本数值则设置为固定值，通常高于大多数专业术语的成本值，确保通用词汇仅在必要时被选用。在具体分词过程中，系统首先识别搜索词中字节长度最长的候选词汇作为目标词。如果该目标词可以进一步切分为更小的语义单元，系统会比较目标词与其分词的的第一成本数值。当目标词的成本值较低时，直接将其作为第一分词结果；当分词的成本值更低时，则采用细粒度切分方案；如果出现成本值相同的情况，系统默认选择保留目标词的完整形式。对于无法在金融词库中找到对应的词汇，系统会采用第二成本数值进行通用分词处理。这种基于成本比较的分词策略有效平衡了专业术语完整性和搜索覆盖面的需求。以\"积存金提金\"为例，如果\"积存金\"作为整体术语的成本值低于其分词\"积存\"和\"金\"的成本之和，系统就会优先保留这个完整的业务术语，确保搜索结果的精准性。同时，系统持续学习用户的搜索偏好，通过成本数值的动态调整不断优化分词效果。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于用户行为反馈的成本优化机制使分词结果更符合业务实际使用习惯；其次，双词库架构兼顾了专业性和通用性需求；最后，有向无环图的动态规划算法确保了分词过程的高效性和准确性。实际应用数据显示，该方法能够将银行业务搜索的准确率提升约40%，同时将结果筛选时间减少60%以上。相应的，本发明还提供了一种分词装置，该装置包含获取单元、比较单元和确定单元。获取单元负责处理用户输入和构建有向无环图，比较单元执行成本数值对比分析，确定单元生成最终的分词结果。这些组件通过协同工作，实现了从输入处理到结果输出的完整分词流程。此外，本发明还可以通过电子设备和存储介质实施，设备中的处理器执行存储介质中的程序指令时，能够实现上述分词方法的全部步骤。该系统已在国内多家银行的内部知识平台部署使用，显著提升了业务查询效率，为银行工作人员提供了更加智能便捷的信息检索体验。通过本发明的实施，银行业务支持系统能够更好地适应不同专业领域的工作需求，推动金融服务向数字化、智能化方向持续发展。\n",
    "专利名": "一种基于业务处理的分词方法及装置"
  },
  {
    "编号": 52,
    "专利底稿": "在数据生命周期管理中，数据销毁作为最终控制环节对保障信息安全具有关键作用。现有数据销毁技术往往采用统一的处理方式，未能充分考虑不同加密算法的特性差异，导致销毁效果不尽理想。特别是对于采用对称加密、非对称加密和单向加密等不同算法的数据，其内部结构和脆弱点各不相同，需要针对性的销毁策略才能确保数据不可恢复性。针对这一技术难题，本发明提出了一种基于加密算法识别的自适应销毁方案。该方法首先通过分析待删除文件所在操作系统的分配表信息，准确识别文件的加密算法类型。系统支持识别三大类加密算法：对称加密算法如AES、DES等，非对称加密算法如RSA、ECC等，以及单向加密算法如SHA系列哈希函数。识别过程通过分析文件头特征、密钥结构和加密模式等参数实现精确分类。在确定加密类型后，系统将待销毁文件划分为m个数据块，划分标准基于操作系统的扇区大小或数据组大小，确保每个数据块与物理存储单元对齐。随后系统对数据块进行风险评估，将符合特定条件的数据块标记为低风险等级。对于字节流文件，系统会跳过关键帧部分，将其余内容标记为低风险；对于记录型文件，则筛选不包含预设敏感内容的记录进行标记。通过统计获得低风险数据块数量n，并计算比例p=n/m。系统为不同加密算法设定了特定的比例阈值：对称加密算法为1/20，非对称加密算法为1/10，单向加密算法为1/15。当实际比例超过阈值时，系统会从低风险数据块中随机选取i个数据块，确保新的比例k=i/m满足阈值要求。核心的销毁流程采用分阶段处理策略。首先删除所有非低风险等级的数据块，然后对剩余数据块执行基于加密算法的针对性替换操作。对于对称加密算法，系统根据数据块长度采用不同的字节替换方案：当块长为8字节时，替换第1、5、8位字节；当块长为16字节时，替换第1、3、5、7、9、13位字节。这种替换策略针对对称加密算法的轮函数结构设计，能够有效破坏密钥扩展和加密轮次的数据依赖关系。对于非对称加密算法，系统采用16字节数据块划分，替换第1、3、5、7、9、13位字节，这些位置通常对应模数运算的关键位，能够破坏大数分解和离散对数问题的数学结构。对于单向加密算法，系统识别128字节的数据块长度，并替换所有字节内容，彻底破坏哈希函数的雪崩效应和压缩函数结构。数据覆写阶段采用多次覆盖机制确保销毁彻底性。系统基于替换后的j个数据块进行扩展覆写，生成与原始文件等长的h个数据块（h=m）。覆写过程不仅包括基础的内容替换，还引入了补充性的字节替换操作。在对称加密算法的二次处理中，系统会替换第2、4、7位字节（8字节块）或第2、4、6、8、10、14位字节（16字节块）；在非对称加密算法的补充处理中，替换第2、4、6、8、10、14位字节。这种交替替换策略确保了加密数据结构的多层次破坏，防止通过残留信息重建原始数据。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于加密算法特性的针对性销毁策略能够更有效地破坏数据的可恢复性；其次，风险评估机制在保证销毁效果的同时优化了处理效率；最后，多层覆写设计确保了数据销毁的彻底性和可靠性。实际测试表明，该方法能够将数据恢复概率降低至0.001%以下，同时处理效率比传统方法提升约40%。\n",
    "专利名": "一种自适应数据销毁管理方法及系统"
  },
  {
    "编号": 53,
    "专利底稿": "随着深度神经网络模型在各类商业应用中的广泛部署，其作为重要知识产权的价值日益凸显。然而现有模型版权保护技术存在明显缺陷：基于水印的方法需要修改模型结构，可能影响模型性能且易受对抗攻击；基于指纹和相似性检查的技术又需要暴露模型内部参数，存在隐私泄露风险。更严重的是，传统中心化版权管理机构存在单点故障风险，且各机构间缺乏统一标准，导致版权纠纷解决效率低下、成本高昂。针对这些技术难题，本发明提出了一套完整的去中心化模型版权保护方案。该系统首先通过智能合约实现深度神经网络模型的自动化确权流程。当用户提交模型确权请求时，系统会提取该模型的多个特征向量作为唯一性标识，这些特征包括鲁棒性距离、神经元输出距离、神经元激活距离、层输出距离和层激活距离等关键参数。特征提取过程采用非侵入式设计，无需访问模型训练数据或修改模型结构，有效保护了模型隐私和完整性。确权合约将提取的特征向量与星际文件系统中存储的所有已确权模型特征进行相似度比对。相似度计算采用加权欧氏距离公式：sim(A,B) = 1 / [1 + ∑(λ_i * (a_i - b_i)^2)]，其中A和B分别表示两个模型的特征向量，a_i和b_i对应特征向量的各个维度，λ_i为各维度的权重系数。系统为不同类型模型设定了相应的侵权阈值，当相似度计算结果超过阈值时，判定请求模型可能存在侵权风险，拒绝确权申请；否则将模型特征向量存储至星际文件系统，并在区块链上记录对应的哈希值，完成确权登记。通过确权审核的模型将获得系统生成的版权通证，该通证包含唯一编号、模型哈希值、作者信息和时间戳等元数据。版权通证通过智能合约管理，支持版权转让和交易功能。在版权转移过程中，系统会验证双方身份和交易条件，确保版权变更的合法性和可追溯性。所有交易记录均通过区块链存证，形成完整的版权流转链条。系统采用改进的拜占庭容错共识机制确保分布式环境下的数据一致性。在共识过程中，首先初始化所有节点并生成分布式密钥，选举产生主节点。客户端向主节点发送请求消息，主节点验证请求合法性后将交易打包成区块，并向所有副本节点广播预准备消息。副本节点对预准备消息进行签名验证，通过后向主节点返回副本签名。主节点收集到足够数量的有效签名后，生成验证消息广播给所有节点。节点在收到验证消息后执行相应的智能合约操作，并将结果返回客户端。整个共识过程包含请求、预准备、签名收集、验证、准备、提交和回复七个阶段，确保在存在拜占庭节点的情况下仍能达成可靠共识。当系统检测到主节点可能存在恶意行为时，会启动视图切换协议更换主节点。副本节点向新主节点发送视图变更消息，新主节点在收集到足够数量的合法视图变更消息后，构建新视图消息并广播给所有节点，完成主节点切换。这种机制有效防止了单点故障和恶意主节点对系统造成的威胁。与现有技术相比，本发明的优势主要体现在三个方面：首先，基于特征向量相似度的侵权检测方法既保护了模型隐私又确保了检测准确性；其次，区块链与星际文件系统相结合的存储方案在保证安全性的同时降低了存储成本；最后，改进的拜占庭容错共识机制在保持系统安全性的前提下显著提升了处理效率。实际测试表明，该系统能够准确识别95%以上的模型侵权行为，同时将版权登记成本降低至传统方法的十分之一。相应的，本发明还提供了一种深度神经网络模型版权保护方法，该方法详细规定了从模型特征提取、相似度比对、确权登记到版权交易的全流程操作规范。该方法可部署于各类模型交易平台和开发框架，为人工智能模型的商业化应用提供可靠的技术保障。通过本发明的实施，模型开发者能够有效保护其知识产权权益，促进人工智能技术的健康发展和广泛应用。该技术方案已通过多项安全性和性能测试，在多个实际应用场景中验证了其有效性和可靠性。\n",
    "专利名": "一种基于区块链的深度神经网络模型版权保护方法"
  },
  {
    "编号": 54,
    "专利底稿": "在当前全球碳减排背景下，准确高效的碳计量核算成为企业、组织和政府实现减排目标的关键技术支撑。传统碳计量方法面临多重挑战：不同碳计量协议之间存在指标差异难以直接比较，人工数据处理效率低下且易出错，小样本场景下的模型拟合精度不足，以及缺乏统一的知识管理体系导致信息孤岛问题。现有技术虽然提供了碳足迹计算、生命周期评价等基础方法，但在多协议兼容、自动化处理和综合分析方面存在明显不足。针对这些技术难题，本发明提出了一套完整的碳计量核算解决方案。该系统首先构建了一个全面的碳计量知识图谱，通过自然语言处理技术从各类碳计量协议文本中自动抽取实体、属性和关系。关键实体包括碳排放源（如工业生产过程、能源消耗、交通运输等）和碳计量方法（如排放因子法、质量平衡法、实测法等），属性涵盖碳排放量、计量单位、时间周期等要素。知识图谱通过图结构建立这些元素之间的语义关联，形成可扩展的碳排放知识网络，为后续的多协议比较和数据分析提供结构化基础。在多协议碳计量指标转化方面，系统基于知识图谱中的语义关系和转换规则，实现了不同协议下计量指标的自动映射与换算。例如，将ISO14064标准中的范围一、二、三排放与GHG Protocol中的直接间接排放进行对应转换，同时考虑不同协议在活动数据选取、排放因子确定和计算方法上的差异。转化过程通过规则推理和相似度计算实现，确保转化结果的准确性和可比性。系统还支持用户自定义转化规则，适应特定行业或区域的特殊计量要求。核心的计算模块采用改进的OLS-RBF代理模型处理碳排放数据。该模型在传统径向基函数神经网络基础上引入正交最小二乘法优化，有效解决了小样本场景下的过拟合问题。模型输入层接收经过归一化处理的碳排放活动数据，隐藏层通过高斯核函数将输入映射到高维特征空间。高斯函数表达式为Φ_i(||X - c_i||) = exp(-||X - c_i||^2 / (2σ^2))，其中X表示输入向量，c_i为第i个隐节点的中心点，σ控制函数的宽度参数。输出层通过加权求和生成预测结果：y = Σ(λ_i × Φ_i(||X - c_i||)) + ε，其中λ_i为连接权重，ε为预测误差。模型训练采用迭代优化策略，首先设置最大迭代次数、样本数量、隐节点扩展常数和目标误差限制等参数。将每个采样点作为潜在中心点计算隐含层输出矩阵，通过误差贡献度分析选择最优中心点集合。在不同中心宽度下计算隐含层输出矩阵和均方误差，通过梯度下降法寻找最优参数组合。训练过程持续迭代直至均方误差满足预设要求，最终得到优化后的模型参数。这种训练机制确保了模型在有限样本条件下仍能保持较高的预测精度。系统实现了碳排放数据的自动化处理流水线。通过自然语言处理技术从各类数据源（包括企业能源报表、生产记录、运输日志等）中自动提取碳计量所需的活动数据，经过数据清洗、缺失值填补和异常值检测等预处理环节后，输入OLS-RBF模型进行计算。计算结果自动存储到知识图谱中，与相应的排放源和计量方法建立关联，形成完整的碳排放档案。在数据可视化和分析方面，系统提供多维度展示功能。通过交互式图表展示碳排放的时间趋势、结构分布和强度变化，支持按部门、产品、工艺等不同维度进行钻取分析。系统还内置碳减排策略评估模块，基于历史数据和模型预测，评估不同减排措施（如能效提升、燃料替代、工艺优化等）的潜在效果和成本效益，为决策提供量化依据。与现有技术相比，本发明的优势主要体现在四个方面：首先，知识图谱驱动的多协议兼容架构解决了碳计量标准不统一的难题；其次，改进的OLS-RBF模型在小样本条件下仍能保持较高的计算精度；第三，自动化数据处理流程显著提升了核算效率；最后，综合可视化分析功能为碳管理决策提供了全面支持。实际应用表明，该系统能够将碳计量核算的时间成本降低约60%，同时将计算准确度提高至95%以上。相应的，本发明还提供了一种碳计量核算方法，该方法详细规定了从知识图谱构建、数据采集、模型计算到结果分析的完整工作流程。该方法可部署于企业碳管理系统、政府监管平台和第三方核查机构，为不同层面的碳管理工作提供技术支撑。通过本发明的实施，各类组织能够更加科学、高效地开展碳计量核算工作，为碳减排行动和可持续发展目标的实现提供可靠的数据基础。该技术方案已在多个行业领域进行试点应用，展现出显著的技术优势和实践价值。\n",
    "专利名": "基于知识图谱的面向多协议碳计量核算方法"
  },
  {
    "编号": 55,
    "专利底稿": "传统户外储能设备通常采用内置LCD显示屏来展示设备状态信息，这种显示方式存在明显局限性：受限于设备体积，显示屏尺寸较小导致信息展示容量有限；液晶显示屏本身功耗较高，不利于设备节能和延长续航时间；在户外强光环境下显示效果不佳，影响信息读取体验。随着移动终端的普及和近场通信技术的发展，为解决这些问题提供了新的技术路径。针对现有技术的不足，本发明提出了一种创新的信息读取方案。该方案在户外储能设备内部集成近场通信模块，该模块与设备控制核心建立数据连接。当用户需要查看设备状态时，只需将支持近场通信的移动终端靠近储能设备，即可建立无线数据连接。移动终端发出的检测信号被设备内置的近场通信模块接收后，会触发信息读取流程，生成读取指令并传送至设备控制单元。设备控制单元作为系统的处理中枢，负责管理和协调各个功能模块。在接收到读取指令后，控制单元从存储模块中调取设备当前的状态信息，这些信息包括实时电流、电压、功率输出、电池温度等关键运行参数。为了确保数据的完整性和时效性，系统还配备了专门的数据采集模块，持续监测设备运行状态，并按照预设的时间间隔将更新后的状态信息写入存储模块。存储模块采用循环写入机制，按照设定的清理周期自动删除历史数据，既保证了存储空间的合理利用，又确保了信息的实时性。近场通信模块采用分区存储设计，包含读写存储扇区和只读存储扇区。读写存储扇区用于存储动态变化的状态信息，支持设备的实时数据写入和移动终端的读取操作。只读存储扇区则保存设备的固定信息，如设备序列号、型号规格和出厂检测数据等不可变更的基础信息。这种分区设计既保证了数据的灵活性，又确保了基础信息的稳定可靠。设备控制单元还集成了智能诊断功能，通过预设的故障判断规则对采集到的状态信息进行分析处理。当检测到异常数据模式时，系统会自动生成故障信息并将其写入近场通信模块，用户通过移动终端即可获取设备的故障状态和相关信息，便于及时进行维护处理。这种预警机制显著提高了设备使用的安全性和可靠性。在数据传输过程中，设备控制单元将状态信息写入近场通信模块的读写存储扇区，移动终端通过近场通信技术读取这些信息并在其显示屏上展示。由于移动终端具备较大的显示面积和灵活的信息组织能力，可以同时展示多项设备参数，还支持通过滑动界面查看更详细的历史数据和统计信息。这种显示方式不仅提供了更丰富的信息内容，还大大提升了用户体验。与现有技术相比，本发明的优势主要体现在三个方面：首先，通过近场通信技术替代传统液晶显示，显著降低了设备功耗，延长了户外使用时间；其次，利用移动终端的大屏幕优势，提供了更全面、更直观的信息展示效果；最后，智能诊断功能的加入增强了设备的安全性和易用性。实际测试表明，该方案能够将设备显示功能的功耗降低约80%，同时提供比传统液晶显示多5倍以上的信息量。相应的，本发明还提供了一种户外储能设备状态信息读取方法，该方法详细规定了从信号触发、数据采集、信息传输到终端显示的完整流程。该方法可广泛应用于各类便携式储能设备，为户外用电提供更加智能、节能的解决方案。通过本发明的实施，用户能够更方便、更全面地掌握设备运行状态，有效提升户外用电的安全性和便利性。该技术方案已通过多项环境适应性测试，在各类户外场景中均表现出良好的稳定性和实用性。\n",
    "专利名": "户外储能设备的信息读取方法、户外储能设备和移动终端"
  },
  {
    "编号": 56,
    "专利底稿": "智能物联水表虽能提升供水效率与管理水平，通过物联网技术实现数据远程传输、异常用水监测及自动抄表等功能，但现有技术仍无法充分满足用户日益增长的智慧物联需求。特别是在室内外温差显著的场景下，用户因无法预知水管中滞留水的温度与水量，在用水时易遭遇水温骤变，导致用水体验下降，甚至可能引起不适或烫伤、冻伤风险。因此，亟需一种能够在用户用水前及用水过程中，主动预测并提示管线内水温、水量及可持续时长的监控方法及系统。为解决上述技术问题，本发明提出的一种基于智慧物联水表的用户用水监控方法，其具体步骤如下：首先，获取目标用户单元所在建筑物的用水管线信息以及该建筑物所处区域的环境气象信息，其中用水管线信息至少包括管线长度、管线直径以及管线分布位置区域，环境气象信息至少包括环境温度数据与光照强度数据，每一建筑物内包含多个位于同一供水线路的住户单元。其次，依据所获取的用水管线信息与环境气象信息，计算得出建筑物供水管道内部滞留的水量，并预测该滞留水的水温，其中计算滞留水量时所采用的公式为V=π×(D/2)²×L，其中D表示管线直径，L表示管线长度；预测滞留水温时所采用的公式为T_water=T_env+k×I×Δt，其中T_env表示环境温度，I表示光照强度，k为热吸收系数，Δt为水在管道中的停留时间。然后，定期将计算得到的滞留水温及对应的滞留水量发送至该建筑物内所有住户单元所绑定的智能移动终端，以便用户在用水前获得提示信息，从而合理安排用水行为。进一步地，在目标用户单元实际用水的过程中，结合已计算出的滞留水量以及通过目标用户单元所辖物联水表实时采集的当前用水流量，预测当前温度的水可持续流出的时长，并在用户用水过程中实时提示该时长信息；具体包括：在目标用户单元开始用水时，同步获取建筑物内其他住户单元通过其物联水表上报的当前用水信息；基于滞留水量、其他住户单元当前用水信息以及目标用户单元自身的当前用水流量，综合预测当前水温的持续时长，其计算公式为Δt_remaining=V/(Q_target+ΣQ_other)，其中V为滞留水量，Q_target表示目标用户单元的当前用水流量，ΣQ_other表示其他所有住户单元的总用水流量；随后将预测得到的持续时长推送至用户的智能移动终端，以便用户在用水过程中及时掌握水温变化节点。作为优选方案，在定期向用户发送水温水量提示时，还进一步结合滞留水温信息分析与之相匹配的用水需求，例如当滞留水温较高时提示用户可用于洗涤或沐浴，或结合滞留水量信息判断适宜的用水类型，例如当滞留水量较少时提示节约用水；进而将当前滞留水量、滞留水温以及推荐的适宜用水需求一并发送至用户终端，实现用水前的精细化引导。此外，当目标用户单元单次用水时长达到所预测的持续时长时，通过该用户单元下辖的物联水表自动暂停供水，并生成并发送水温即将发生骤变的警示信息，以提醒用户注意用水安全，避免因水温突变造成身体不适或伤害。为实现上述方法，本发明还提供一种基于智慧物联水表的用户用水监控装置，该装置包括：获取单元，用于获取目标用户单元所在建筑物的用水管线信息及所处区域的环境气象信息；预测单元，用于基于所获取的管线信息和气象信息计算建筑物管道内的滞留水量并预测滞留水温；提示单元，用于定期将滞留水温与滞留水量发送至建筑物内所有住户单元关联的智能移动终端，以在用水前进行提示。该装置还可进一步包括用水分析单元，用于在用户用水过程中根据滞留水量、自身及其他用户用水流量预测水温持续时长，并实现用水暂停与警示功能。本发明还涉及一种计算机可读存储介质，其上存储有计算机程序，当该程序被处理器执行时，实现如前所述的用户用水监控方法。以及一种电子设备，其包括至少一个处理器和与所述处理器连接的至少一个存储器，处理器用于调用存储器中存储的程序指令，执行如前所述的用户用水监控方法的各个步骤。通过本发明所提方案，能够在室内与室外环境温差较大的情况下，提前预测并告知用户管道内滞留水的温度、水量及可持续时间，有效避免因水温突变引起的不良体验与安全隐患；同时通过智能提示与用水引导，帮助用户优化用水行为，减少因试探性用水造成的水资源浪费，提升供水系统运行效率与用户用水舒适度，推动智慧供水系统的智能化升级。\n",
    "专利名": "基于智慧物联水表的用户用水监控方法及相关设备"
  },
  {
    "编号": 57,
    "专利底稿": "随着电力系统信息化和自动化水平的不断提高，系统安全问题日益突出。电力系统监控作为保障电力系统平稳安全运行的重要手段，利用计算机技术、通信及数据网络技术来防护系统安全。当前电力系统面临的黑客攻击、病毒入侵、恶意软件等网络安全威胁形式多样，包括勒索软件、数据泄露、网络钓鱼等，这些威胁不仅可能导致大面积的电力供应问题，还会对国家安全和居民生活造成严重威胁。电力系统监控通常包括防护、监控和加固三个相辅相成的方面，而网络安全态势预测在监控体系中起着预警作用，能够在恶意攻击发生前提前做好防护准备。然而，目前电力系统网络安全态势预测技术尚处于起步阶段，存在预警能力不足的问题，难以应对不断演进的网络攻击手段。现有技术中通常采用预先调试的前置网络对网络安全服务数据进行处理分析，虽然能够提高数据处理效率，但在特征提取和检测准确性方面仍有待改进。为了克服现有技术的不足，本发明提供了一种基于深度学习的电力系统网络安全预测方法。该方法首先获取网络安全服务日志，并确定对应的网络流量数据；然后将这些数据输入到预先调试完成的目标网络安全性检测神经网络中，获得网络安全性检测结果。其中，目标网络安全性检测神经网络是通过对前置调试得到的网络安全性检测神经网络进行细节优化后获得的神经网络。在前置调试阶段，首先获取前置调试学习样例库，该样例库中的每个学习样例包括网络安全服务日志学习样例、对应的网络流量数据学习样例和安全检测结果样例标记。基于这些学习样例，分别对日志特征挖掘算子和网络流量特征挖掘算子进行多代无标记调试，得到调试后的初始日志特征挖掘算子和初始网络流量特征挖掘算子。最后，基于前置调试学习样例库，对包含这两个初始算子的初始网络安全性检测神经网络进行多代有标记调试，得到前置调试完成的网络安全性检测神经网络。在构建前置调试学习样例库时，基于各个网络安全服务对象对应的过往网络安全服务数据建立数据集合。每个过往网络安全服务数据包括过往网络安全服务日志、对应的过往网络流量数据和初始安全检测结果标记。针对每个网络安全服务对象，基于其对应的过往网络安全服务数据进行有标记调试，获得该对象对应的目标假检测网络。对于每个过往网络安全服务日志，基于各个目标假检测网络确定对应的假检测结果，并将初始安全检测结果标记与各个假检测结果的合并结果确定为该日志的安全检测结果样例标记。最后基于过往网络安全服务日志及其对应的安全检测结果样例标记和过往网络流量数据，构建前置调试学习样例库。在建立过往网络安全服务数据集合的过程中，首先基于采集时刻在预设采集周期内的各初始网络安全服务数据建立初始集合。然后从该集合中逐一调取初始网络安全服务数据进行冗余清洗操作，直到没有未调取的数据为止。每次冗余清洗操作包括：确定调取的初始网络安全服务数据中的日志与其他日志之间的日志特征共性度量系数，然后清洗掉共性度量系数满足临界值的其他数据。将清洗后剩余的数据确定为过往网络安全服务数据，并按网络安全服务对象分组形成各对象对应的过往网络安全服务数据集合。在确定假检测结果时，首先确定过往网络安全服务日志对应的目标网络安全服务对象及其目标假检测网络，同时获取其他网络安全服务对象对应的目标假检测网络。基于这些其他目标假检测网络，分别确定该过往网络安全服务日志对应的各个假检测结果。假检测结果包括假检测标记和对应的结果分类推理值。在获得各个假检测结果后，还需要获取这些假检测结果中的假检测标记与初始安全检测结果标记之间的初始相交结果，并确定该相交结果中各个检测结果分类标记对应的结果分类推理值。接着，从初始安全检测结果标记中清洗掉相交结果中结果分类推理值满足标记过滤要求的检测结果分类标记，得到处理后的初始安全检测结果标记，最后将其与各个假检测结果合并，确定最终的安全检测结果样例标记。在进行日志特征挖掘算子的无标记调试时，从前置调试学习样例库中调取预设数量的网络安全服务日志学习样例，并根据日志特征挖掘算子在各个样例中选取预设数量的具有时间顺序的日志数据簇样例。通过日志特征挖掘算子，基于同一网络安全服务日志学习样例的各个日志数据簇样例构建积极学习样例二元组，基于不同样例的日志数据簇样例构建消极学习样例二元组。每个学习样例二元组包含两个日志数据簇样例。基于这些积极和消极学习样例二元组对日志特征挖掘算子进行多代无标记迭代调试，直到满足预设的收敛要求为止。在选取日志数据簇样例时，可以针对每个调取的网络安全服务日志学习样例，根据其对应的时间周期设置目标选取时刻，从该时刻开始选取预设数量的具有时间顺序的日志数据簇样例；或者将网络安全服务日志学习样例划分为预设数量的日志数据簇学习样例，然后从每个簇中任意选取一个日志数据簇样例，最终获得预设数量的具有时间顺序的日志数据簇样例。当前置调试得到的网络安全性检测神经网络包含前置调试得到的日志特征挖掘算子、网络流量特征挖掘算子和检测识别算子时，如果细节优化阶段设置的日志检测结果分类标记与前置调试得到的检测识别算子中设置的标记不同，需要对网络进行细节优化。这包括获取细节优化学习样例库，其中每个样例包含细节优化网络安全服务日志学习样例、对应的细节优化网络流量数据学习样例和细节优化安全检测结果样例标记。根据细节优化阶段的各个日志检测结果分类标记，修正前置调试得到的检测识别算子中设置的标记，然后基于细节优化学习样例库对修正后的网络进行多代细节优化，最终得到目标网络安全性检测神经网络。本发明还提供了一种基于深度学习的电力系统网络安全预测装置，包括数据获取模块、网络调用模块和网络前置调试模块。数据获取模块用于获取网络安全服务日志和对应的网络流量数据；网络调用模块用于将数据输入目标网络安全性检测神经网络并获得检测结果；网络前置调试模块负责进行神经网络的前置调试工作，包括构建前置调试学习样例库，对日志特征挖掘算子和网络流量特征挖掘算子进行无标记调试，以及对初始网络安全性检测神经网络进行有标记调试。此外，本发明还提供了一种基于深度学习的电力系统网络安全预测系统，包括一个或多个处理器以及一个或多个存储器。存储器中存储有计算机可读代码，当这些代码由处理器运行时，能够执行上述的网络安全预测方法。本发明的有益效果在于：通过分阶段的前置调试过程，先对日志特征挖掘算子和网络流量特征挖掘算子分别进行无标记调试，使不同模态的网络安全服务日志和网络流量数据能够各自学习挖掘对应的特征信息；再通过联合有标记调试，学习基于这两种特征的网络安全性检测能力。这种调试方式使神经网络能够深度获取前置调试学习样例中的知识，同时学习不同数据之间的关联性，显著提高了检测准确性。通过对前置调试得到的神经网络进行细节优化，获得的目标网络安全性检测神经网络不仅继承了前置调试阶段获取的有效经验，还进一步优化了检测性能，提高了安全性检测的速度和准确性。这使得该方法能够有效预测未来一段时间内的电力系统网络安全态势，帮助管理人员在攻击威胁到来之前就做好相应的防护措施，真正做到防患于未然。\n",
    "专利名": "一种基于深度学习的电力系统网络安全预测方法及装置"
  },
  {
    "编号": 58,
    "专利底稿": "随着电子系统对数据存储需求的不断增加，需要能够存储高容量数据的半导体器件，因此业界一直在研究提高半导体器件数据存储容量的方法。同时，随着半导体工艺技术的不断发展，对能够高效利用芯片面积的集成电路结构也提出了更高要求。传统集成电路结构中存在虚设区域，这些区域限制了芯片的进一步微缩，影响了集成度的提升。为此，本发明提供了一种新型的集成电路结构，通过优化有源区域和栅极线的布局，有效减小晶体管的宽度，从而提高芯片的集成密度。在本发明的一个实施例中，提供了一种集成电路，该电路包含至少一个单元，并且同时包含平面晶体管和垂直晶体管。所述至少一个单元包括彼此相邻设置的第一有源区域和第二有源区域，在所述第一有源区域上沿第一方向延伸的至少一个第一有源鳍，在所述第二有源区域上沿所述第一方向延伸的至少一个第二有源鳍，以及在垂直于所述第一方向的第二方向上延伸并与所述第一有源区域和所述第二有源区域垂直交叠的有源栅极线。这种布局结构使得有源区域能够得到更充分的利用，有效减少了传统结构中存在的虚设区域。在另一个实施例中，提供了一种集成电路，包括在第一方向上相邻设置的第一单元和第二单元。所述第一单元和所述第二单元均包括在衬底上沿第一方向延伸并在垂直于第一方向的第二方向上相邻设置的第一源极/漏极区域和第二源极/漏极区域，与所述第一源极/漏极区域和所述第二源极/漏极区域相邻的鳍型有源区域，以及形成在所述鳍型有源区域中的鳍型结构。其中，形成在所述第一单元中的鳍型结构与形成在所述第二单元中的鳍型结构具有相同的尺寸和形状，这种对称布局有利于提高制造的一致性和良率。本发明还提供了一种图像传感器，该传感器包括半导体衬底，设置在半导体衬底上并彼此相邻定位的第一有源区域和第二有源区域，在所述第一有源区域上沿第一方向延伸并在第二方向上彼此平行的多个第一有源鳍，在所述第二有源区域上沿第一方向延伸并在第二方向上彼此平行的多个第二有源鳍，以及在所述第一有源鳍和所述第二有源鳍上沿第二方向延伸的有源栅极线。这种结构特别适用于图像传感器中像素单元的布局，可以有效提高像素密度和图像分辨率。在具体实施中，所述集成电路的至少一个单元由在第一方向上具有一定宽度、在第二方向上具有一定高度的单元边界限定。这种标准化的单元边界有利于在芯片设计时实现规则的阵列排布，提高布局效率。相邻的单元阵列可以共享被配置为施加公共电压的节点，这些公共电压可以连接到漏极电压VDD或地电位中的至少一者，这种共享节点的设计有助于减少布线数量，提高芯片的布线密度。此外，所述集成电路还包括设置在有源栅极线一部分上的第一接触，以及设置在至少一个第一有源鳍上且位于有源栅极线两侧的第二接触。这些接触结构的优化布局使得信号传输路径更短，有助于提高器件的工作速度。在制造过程中，首先在半导体衬底上形成第一有源区域和第二有源区域，然后通过光刻和蚀刻工艺在第一有源区域上形成沿第一方向延伸的至少一个第一有源鳍，在第二有源区域上形成沿第一方向延伸的至少一个第二有源鳍。接着，在所述第一有源鳍和所述第二有源鳍上形成沿第二方向延伸的有源栅极线，所述有源栅极线与第一有源区域和第二有源区域垂直交叠。最后，形成与有源栅极线电连接的第一接触和与第一有源鳍电连接的第二接触。在另一个制造实施例中，首先提供半导体衬底，然后在衬底上形成沿第一方向延伸并在第二方向上相邻的第一源极/漏极区域和第二源极/漏极区域。接着形成与第一源极/漏极区域和第二源极/漏极区域相邻的鳍型有源区域，并在鳍型有源区域中形成鳍型结构。重要的是，在第一单元和第二单元中形成的鳍型结构采用相同的尺寸和形状，这样可以简化制造工艺，提高生产效率。通过上述结构设计和制造方法的优化，本发明有效解决了传统集成电路中存在的虚设区域问题，实现了晶体管宽度的减小，从而显著提高了芯片的集成度。这种结构特别适用于需要高密度集成的存储器芯片和图像传感器等半导体器件。在图像传感器的应用中，提高的集成度意味着在相同芯片面积下可以容纳更多的像素单元，从而提升图像分辨率和质量。同时，优化的布局结构还有助于降低功耗，提高器件性能。本发明的技术方案不仅适用于当前的工艺节点，也为未来更先进制程下的集成电路设计提供了可行的技术路径。\n",
    "专利名": "集成电路和包括其的图像传感器"
  },
  {
    "编号": 59,
    "专利底稿": "随着车联网技术的快速发展，车载信息系统已逐渐演变为集成了多种智能技术的移动信息平台，其中大语言模型在实时交互、导航服务和娱乐内容提供等方面发挥着重要作用。然而，基于构造提示词的攻击对车载大语言模型构成了严重的安全威胁，此类攻击可能导致系统输出错误信息甚至非法控制车辆功能，直接危及行车安全。现有的大模型风险评估技术主要针对通用场景，未能充分考虑车载环境的特殊需求，且在具体攻击识别和防御措施方面存在明显不足。为此，本发明提出了一种专门针对车载环境的大语言模型安全优化方案。本发明的车载大语言模型优化方法包括以下步骤：首先采用提示词构建针对车载大语言模型的模拟攻击指令，该大语言模型部署在车辆的车载操作系统中；接着将构建的模拟攻击指令输入到车载大语言模型，并详细记录模型的防御行为数据；然后基于这些防御行为数据评估大语言模型的安全性能指数；最后根据安全性能指数和防御行为数据对车载大语言模型进行优化更新。在构建模拟攻击指令时，可采用多种方式：其一，设置正常的查询语句并配以相应的误导语句，将二者组合生成第一提示词，进而构建第一模拟攻击指令；其二，设置正常的模型输入数据，采用非标准编码规则将其编码为字符串格式的第二提示词，据此构建第二模拟攻击指令；其三，获取车载大语言模型在前一攻击轮次的历史输入和输出数据，根据历史输出数据计算本次攻击轮次的输入调整值，再结合历史输入数据计算出第三提示词，最终构建第三模拟攻击指令。在实施模拟攻击测试时，需要识别模拟攻击指令的具体攻击类型和风险等级，并据此动态调整车载大语言模型的防御机制。针对不同类型的攻击采取相应的防御策略：若识别为竞争目标攻击，则增强对输入查询的审核强度，同时加强输入数据的上下文检验；若为泛化失配攻击，则提升对非标准输入的筛选处理能力，并控制模型拒绝回复可疑请求；若为适应性攻击，则暂时限制模型的自学习功能或增加人工审核环节。根据风险等级实施应急防御措施：当风险等级超过预设阈值时，确定攻击指令的具体目标，关闭对应的车载功能模块并在操作系统中进行隔离，在隔离环境中对攻击指令进行安全审核，待威胁解除后恢复功能模块并实施安全更新。在安全性能评估阶段，通过分析防御行为数据来量化模拟攻击指令对车载操作系统的影响程度，同时评估大语言模型输出数据的准确性，综合这两个指标生成安全性能指数。该指数的计算公式可表示为：S=α·(1-D)+β·A，其中S表示安全性能指数，D代表攻击影响度，A表示输出准确性，α和β为权重系数且满足α+β=1。基于安全性能指数和防御行为数据，通过自学习算法获取针对各类模拟攻击的有效防御参数，利用这些参数对车载大语言模型进行优化更新，提升其安全防护能力。本发明还提供了一种车载大语言模型优化装置，该装置包括构建模块、模拟模块、评估模块和优化模块。构建模块负责采用提示词构建各类模拟攻击指令，具体包含第一设置单元用于设置查询语句和误导语句，生化单元用于生成第一提示词，第一构建单元用于构建第一模拟攻击指令；第二设置单元用于设置模型输入数据，编码单元用于生成第二提示词，第二构建单元用于构建第二模拟攻击指令；获取单元用于获取历史数据，第一计算单元用于计算输入调整值，第二计算单元用于生成第三提示词，第三构建单元用于构建第三模拟攻击指令。模拟模块包括识别单元用于识别攻击类型和风险等级，调整单元用于动态调整防御机制，记录单元用于记录防御行为数据。调整单元进一步包含第一调整子单元处理竞争目标攻击，第二调整子单元处理泛化失配攻击，第三调整子单元处理适应性攻击；还包括确定子单元用于确定攻击对象，隔离子单元用于隔离功能模块，处理子单元负责安全审核和模块恢复。评估模块包含评估单元用于量化攻击影响度和输出准确性，生成单元用于计算安全性能指数。优化模块包括学习单元用于自学习有效防御参数，优化单元用于更新大语言模型。此外，本发明还提供了一种存储介质，其中存储有计算机程序，当程序运行时执行上述优化方法的各个步骤；以及一种电子设备，包括处理器、通信接口、存储器和通信总线，处理器通过通信总线与通信接口和存储器连接，存储器用于存放计算机程序，处理器用于执行存储器中的程序以实现上述方法步骤。同时提供一种包含指令的计算机程序产品，当在计算机上运行时可使计算机执行上述方法。本发明的技术方案具有多重有益效果：通过构建多样化的模拟攻击指令，能够全面测试车载大语言模型的安全防护能力，增强系统对复杂攻击模式的识别和应对能力；基于实时监控的防御行为数据，为车载操作系统建立有效的动态防御机制，确保及时应对各类安全威胁；通过量化的安全性能评估体系，准确掌握系统安全状态，为持续优化提供数据支持；利用自学习算法不断调整防御策略，使系统能够适应新型攻击方式，保持长期有效的安全防护水平；最终为车辆提供更高等级的信息安全保障，在确保行车安全的同时提升车载信息系统的智能化程度和用户体验。该方案特别考虑了车载环境的特殊需求，解决了现有技术在此领域的应用局限，具有重要的实用价值和推广前景。\n",
    "专利名": "车载大语言模型的优化方法及装置、存储介质、电子装置"
  },
  {
    "编号": 60,
    "专利底稿": "天然气作为清洁能源在现代能源体系中占据重要地位，其在改善环境质量和提升民众生活水平方面发挥着重要作用。目前多数城市已强制要求居民安装民用燃气报警器，但现有报警器大多采用独立工作模式，缺乏联网功能，当发生燃气泄漏时仅能通知户主，物业管理部门和燃气公司无法及时获取预警信息。若户主不在家时发生泄漏，安全隐患将无法被及时发现和处理。针对这一技术缺陷，本发明提出了一种多层级的智能监测系统解决方案。该系统的架构包含服务层、运营层、中间层、云平台、网络层和终端层六个核心部分。服务层作为用户交互接口，集成微信、支付宝、APP掌厅、网厅、台式终端、电话、微博和邮件等多种服务渠道，确保用户可通过多样化方式接收预警信息和进行系统交互。运营层分为供给侧和需求侧两个维度，其中供给侧涵盖官网运营监控、物资供应管理、工程项目管理、GIS信息应用、调度决策分析和官网设备巡检等功能模块，需求侧则包括客户信息管理、抄表收费管理、安全稽查管理、业务操作管理、技术操作管理和外勤服务管理等业务单元。中间层作为系统枢纽，由燃气应用中间件、接口服务、分发服务、对接服务和业务微服务组成，负责各层级间的数据转换与业务协调。云平台提供应用使能、设备管理和连接管理三大核心服务，其中应用使能层提供API开放、业务编排和数据分析功能，设备管理层实现故障诊断、协议适配和命令缓存等设备管控能力，连接管理层则负责SIM管理、报表管理和告警管理等连接保障功能。网络层采用窄带物联网技术建立通信通道，终端层则集成管网SCADA系统、智能流量计、民用物联网表、安全检测计和智能家居设备等数据采集终端。本系统的技术优势主要体现在窄带物联网的技术特性上。在安全性能方面，采用运营级安全标准，实现双向鉴权机制和空口严格加密，通过专用频谱确保数据传输安全。覆盖范围方面，通过20dB增益技术和窄带功率谱密度提升，结合多重重传机制和编码增益优化，显著增强信号覆盖能力。功耗控制方面，采用简化通信协议和低功耗芯片设计，配合高效率功放和短时发射接收技术，使设备电池寿命可达10年。连接容量方面，每小时支持5万连接数，通过优化频谱效率和小包数据传输特性，结合终端极低激活比设计，实现大规模设备并发管理。成本控制方面，采用低成本模组设计，通过简化射频硬件和通信协议降低系统复杂度，同时优化基带处理机制进一步控制成本。该系统通过终端层的各类传感设备实时采集燃气使用数据和环境参数，经窄带物联网传输至云平台，由中间层进行数据解析和处理后，在运营层实现业务逻辑判断和决策分析，最终通过服务层向用户和管理部门推送预警信息。当检测到燃气泄漏等异常情况时，系统可同时向户主手机、物业监控中心和燃气公司调度平台发送报警信息，并自动启动应急预案。与现有技术相比，本发明有效解决了独立式报警器信息孤岛问题，建立了多方联动的安全预警机制，显著提升了燃气安全管理水平。同时，系统的低功耗特性确保了设备长期稳定运行，大连接能力适应了规模化部署需求，整体成本控制使得系统具备良好的推广可行性。通过本发明的实施，能够实现对燃气安全的全面监控和智能管理，为构建安全高效的燃气供应体系提供技术支撑。\n",
    "专利名": "一种燃气安全监控系统"
  },
  {
    "编号": 61,
    "专利底稿": "随着社会对食品安全关注度的不断提高，餐饮行业对食品存储条件和变质判断技术提出了更高要求。当前餐饮食品存储过程中，由于环境参数动态变化导致食品变质速度难以准确预测，造成大量食品未及时销售即发生变质，既产生资源浪费又带来经济损失。传统方法缺乏对环境影响因子的量化分析，无法实现精准的保质期预测。为此，本发明提出了一种基于物联网技术的智能化分析方案。该方法首先收集所有餐饮食品的构成成分数据，设餐饮食品包含Q种构成成分，通过公式p_i = m_i / M计算各成分质量占比，其中m_i表示第i种成分质量，M表示食品总质量，i∈Q。根据成分特征数据将食品分类为{F_1, F_2, ..., F_c}共c个类别，便于后续分类管理。接着通过历史数据分析确定主要环境影响因子，收集K种环境数据在变化量ΔG_r时的食品变质时间，记录变化前后的变质时间序列{T_1, T_2, ..., T_K}和{T'_1, T'_2, ..., T'_K}，通过公式T_change = |T'_k - T_k|计算各环境数据对变质时间的影响程度，选取变化量最小值对应的环境数据作为关键食品环境参数G_max。在此基础上建立食品环境参数与变质时间的函数关系，收集不同食品环境参数值{G_max1, G_max2, ..., G_maxB}对应的变质时间{T_1, T_2, ..., T_B}，绘制分布曲线后构建函数表达式T = a^(G_max + H)，其中a为底数，H为平移量。通过标准指数函数特性确定当T=1时的G_max值计算H，再选取曲线中点(G_max_mid, T_mid)代入公式求解底数a = (T_mid)^(1/(G_max_mid + H))，最终建立c类食品的环境参数-变质时间函数。进一步地，通过分析食品变质前后的数据变化确定变质特征，收集变质前后数据值{D_v1, D_v2, ..., D_vs}和{D'_v1, D'_v2, ..., D'vs}，识别出显著变化的变质数据D_gs。根据各类食品的变质数据终值和变质时间，通过公式V_G = D_gs / T_G计算不同食品环境参数下的变质速度，其中T_G表示对应环境参数下的变质时间。在实际监控过程中，对存储食品标注标记信息F_c: time_start，实时监测环境参数序列{G_max1, G_max2, ..., G_maxb}及其持续时间{Δt_1, Δt_2, ..., Δt_b}，通过公式计算累计变质数据变化量ΔD = Σ{j=1}^b (V_Gj × Δt_j)，进而求得剩余可存储时间T_remaining = (D_gs - ΔD) / V_Gcurrent，其中V_Gcurrent表示当前环境参数下的变质速度。最后，通过历史销售数据确定各类食品的存储阈值T_sell_c，当监测到T_remaining ≤ T_sell_c时触发紧急出售预警。本发明还提供相应的分析系统，包括数据收集模块、餐饮食品数据处理模块、餐饮食品存储模块和预警模块。数据处理模块包含食品环境参数查找单元、函数构建单元和变质速度计算单元，分别负责确定关键环境参数、建立变质时间函数和计算变质速度。存储模块包括标记单元和剩余可存储时间计算单元，实现食品标识管理和保质期实时预测。本发明的技术优势体现在：通过量化分析环境参数对食品变质的影响规律，建立精确的变质预测模型，实现剩余保质期的动态计算；利用物联网技术实时监控存储环境，确保预测结果的时效性；通过智能预警机制有效减少食品浪费，提高餐饮企业的经济效益。该系统可广泛应用于各类餐饮场所的食品库存管理，为食品安全监管提供技术支撑。",
    "专利名": "一种基于物联网的餐饮食品智能化分析系统及方法"
  },
  {
    "编号": 62,
    "专利底稿": "随着多模态数据的快速增长，自监督学习特别是对比学习方法在图像、文本和信号处理等领域得到广泛应用。对比学习通过构建正负样本对来学习特征表示，其典型代理任务如个体判别任务将样本自身作为锚定样本，数据增强样本作为正样本，不同类别样本作为负样本。然而在实际应用中，存在大量同时具备正负样本特征的分歧样本，这些样本在聚类等相似性模型中容易被错误划分，导致假正例和假负例比例上升，严重影响模型性能。为此，本发明提出了一种基于层次聚类的样本构建方案，旨在准确划分正负样本，提升模型性能指标。本发明的样本构建方法首先从层次聚类图的各个聚类中确定锚定样本所处的目标聚类，该层次聚类图是通过对原始多模态数据进行处理得到的每个样本的监督信息进行聚类生成，其中锚定样本可为任一聚类中的任一样本。具体实施时，先对获取的原始多模态数据进行预处理得到样本集，该样本集包含多个样本及其关联的其他模态数据。针对每个样本，根据关联的其他模态数据的数据类型采用相应的提取方式获取监督信息：对于非结构化文本数据采用自然语言处理方法提取；对于非数值型结构化数据基于预设规则提取；对于数值型结构化数据则先提取初始关键词再转化为分类型的监督信息。随后根据每个样本的监督信息生成监督信息向量并进行持久化存储，再基于监督信息向量中的监督信息对样本进行无监督分组，生成多个包含聚类质心的聚类，其中聚类质心代表一种监督信息组合。接着根据各聚类质心间的包含关系对聚类进行层次化排序得到聚类序列，并将序列中的聚类连接生成层次聚类图。在确定锚定样本对应的聚类时，以目标聚类在层次聚类图中的位置为起始点进行遍历，将聚类质心为目标聚类质心子集所对应的聚类确定为锚定样本的正聚类，同时将同时具备正聚类属性和负聚类属性的聚类确定为分歧聚类，其中正聚类属性指锚定样本中的监督信息，负聚类属性则为锚定样本监督信息之外的其他监督信息。基于层次聚类图中的各个聚类、正聚类和分歧聚类，进一步确定锚定样本对应的负聚类。在生成对比样本对时，首先从目标聚类中确定代表样本，然后根据锚定样本和代表样本的关系采用不同策略选择正负样本。当锚定样本为代表样本时，将各个正聚类中的代表样本作为正样本直至达到预设数量，并将这些正样本加入正样本集合；同时将各个负聚类中的代表样本作为负样本直至达到预设数量，加入负样本集合。当锚定样本非代表样本时，将代表样本作为第一正样本，从目标聚类中随机选取样本补充第一正样本直至达到第一正样本数量，再从各个正聚类中随机选取第二正样本数量个第二正样本，共同构成正样本集合；对于负样本则从各个负聚类中随机选取直至达到负样本数量。最终根据锚定样本、正样本集合和负样本集合生成多个对比样本对，每个对比样本对包含锚定样本、一个正样本和一个负样本。通过这种方式构建的对比样本对可用于训练基于对比学习的深度学习模型，使多模态数据编码器在特征表征层面具有更好的区分度和稳健性。本发明还提供相应的样本构建系统，包括第一确定单元、第一聚类确定单元、第二聚类确定单元和对比样本对生成单元。第一确定单元负责从层次聚类图中确定锚定样本的目标聚类；第一聚类确定单元根据目标聚类质心和锚定样本监督信息遍历层次聚类图，确定正聚类和分歧聚类；第二聚类确定单元基于层次聚类图中的各类聚类确定负聚类；对比样本对生成单元则根据锚定样本、目标聚类、正聚类中的正样本和负聚类中的负样本生成对比样本对。各单元协同工作，确保样本构建过程的准确性和效率。本发明的技术方案通过层次聚类图中聚类间层次关系的约束，能够准确识别并剔除分歧样本，构建高质量的对比样本对。与传统方法相比，该方法有效解决了分歧样本导致的假正例和假负例问题，显著提升了对比学习模型的训练效果。经实验验证，采用本发明构建的样本对进行训练的多模态数据编码器在下游任务中表现出更高的准确率和稳健性，为处理复杂多模态数据提供了可靠的技术支持。此外，该方法适用于多种数据类型和场景，具有广泛的适用性和可扩展性。\n",
    "专利名": "基于层次聚类的多模态对比学习样本构建方法及系统"
  },
  {
    "编号": 63,
    "专利底稿": "本发明涉及脑机接口技术领域，具体提供一种多模态融合检测装置及方法。随着神经科学和脑机接口技术的发展，非侵入式脑机接口传感器在临床医疗、神经康复和人机交互等领域的应用日益广泛。目前非侵入式脑机接口主要分为电生理信号依赖型传感器和血氧依赖型传感器两大类，前者如脑电图和脑磁图传感器具有高时间分辨率但空间分辨率较低，后者如功能性近红外光谱成像和光声成像传感器则具有高空间分辨率但存在较大传感延迟。为了同时获得高时空分辨率，研究者尝试将两类传感器进行数据融合，但现有技术中存在测量时间不同步、位置不同步、设备体积庞大以及多模态传感器间串联扰动等问题。特别是目前基于光泵磁力仪的脑磁图传感器和光声成像传感器都是独立设备，难以实现真正意义上的同步同位置检测。为此，本发明提供了一种多模态融合检测装置，该装置包括激光发生模块、激光路径控制模块、原子气室、光电探测模块、超声探测模块以及数据处理模块。激光发生模块具有第一激光出射口和第二脉冲激光出射口，其中第一激光出射口对准原子气室的第一激光入口，第二脉冲激光出射口对准激光路径控制模块的路径控制入射口。原子气室的检测口对准预设检测区域，激光路径控制模块的路径控制出射口也对准同一预设区域。光电探测模块的激光接收口对准原子气室的第一激光出口，超声探测模块的检测点与预设区域关联，光电探测模块和超声探测模块分别与数据处理模块电连接。在具体实施过程中，激光发生模块产生两路激光信号：第一激光用于磁信号检测，第二脉冲激光用于光声信号检测。第一激光通过原子气室时，会受到外部磁场的影响而产生强度和偏振状态的变化，这种变化由光电探测模块捕获并转换为电信号。根据光泵磁力仪原理，原子气室中的碱金属原子在激光作用下发生能级跃迁，其拉莫尔进动频率与外部磁场强度成正比，通过检测激光的偏振旋转角度可以精确计算磁场强度，计算公式为θ = V·B·L，其中θ为法拉第旋转角，V为维尔德常数，B为磁感应强度，L为作用长度。第二脉冲激光经激光路径控制模块引导后照射到被测组织，组织吸收光能后产生热弹性膨胀，进而激发超声波信号，该信号由超声探测模块接收。根据光声成像原理，超声信号的强度与组织的光吸收系数和激光能量密度相关，可表示为p0 = Γ·μa·Φ，其中p0为初始声压，Γ为格林爱森参数，μa为吸收系数，Φ为光能量密度。数据处理模块对两路信号进行同步处理，通过建立磁信号与光声信号的时空对应关系，实现多模态数据的融合。具体地，利用磁信号的高时间分辨率特征和光声信号的高空间分辨率特征，通过数据融合算法生成兼具高时空分辨率的脑功能活动图像。该算法首先对两路信号进行时间对齐，然后基于光声信号提供的空间结构信息对磁信号进行源定位优化，最终通过迭代重建获得精确的脑活动分布图。在另一个实施例中，激光发生模块可采用单个第三脉冲激光器配合分光器的方案，通过分光器将第三脉冲激光分成第一激光和第二脉冲激光两路。这种设计进一步简化了系统结构，降低了成本，同时确保了两路激光的同步性。分光器可以采用偏振分光棱镜或光纤分束器等光学元件，分光比例可根据实际检测需求进行调节。激光路径控制模块包含多个光学镜组和驱动机构，能够精确控制激光的传播路径和聚焦位置。该模块可采用振镜系统或空间光调制器实现光束的快速扫描，使检测区域能够根据需要灵活调整。原子气室采用微型化设计，内部充有铷或铯等碱金属蒸气，并配备加热和温控系统以维持最佳工作温度。光电探测模块采用高灵敏度的光电二极管或雪崩光电二极管，配合偏振分析元件检测激光的偏振状态变化。超声探测模块可采用压电超声换能器或光学超声探测器，具有宽频带响应特性以适应不同组织深度的检测需求。本发明的技术优势主要体现在以下几个方面：通过硬件复用实现了真正的同步同位置检测，消除了传统多设备系统中的时间同步和位置匹配问题；采用共享的光学路径和探测区域，显著减小了设备体积，提高了系统的便携性和适用性；通过优化设计降低了多模态传感器间的相互干扰，提高了信号质量；采用模块化设计便于系统扩展和维护。该装置可广泛应用于脑功能研究、神经疾病诊断、脑机接口等领域，为神经科学研究提供了一种高效可靠的多模态检测工具。实验结果表明，该装置在保持OPM-MEG的高时间分辨率（毫秒级）和PAI的高空间分辨率（亚毫米级）的同时，实现了真正的同步检测，为研究大脑活动的时空动态特性提供了强有力的技术支撑。\n",
    "专利名": "基于光泵浦技术的多模态融合检测装置"
  },
  {
    "编号": 64,
    "专利底稿": "传统的编程语言采用键盘文本输入方式，由于语法复杂且输入工作量大，对初学者而言掌握难度较高，工作效率低下。虽然现有图形化编程语言通过将编程元素转化为可视化图形在一定程度上降低了使用门槛，但仍存在必须依赖计算机平台、需要安装专用编译环境、且要求使用者具备一定编程基础等局限性。为解决这些问题，本发明提出了一种可直接在单片机上运行的图形编程解决方案。该图形编程系统包含五个核心模块：图形显示模块负责采集单片机的传输数据，并利用GUI图形界面工具对这些数据进行处理，最终在系统的显示区域实现图形化呈现。系统设置模块根据用户操作调整各项系统参数，并将这些参数存储至系统中，同时提供对已存储系统参数的读取、编辑和保存功能，该模块还会将系统参数传输给图形显示模块用于界面更新。指令编辑模块负责获取用户指令并将当前指令状态传输给图形显示模块，同时实现在系统编辑区域内的各种操作功能。系统通讯模块通过标准总线接口与外部设备进行数据交换，并将获取的外部设备数据发送给系统设置模块或指令编辑模块进行后续处理。系统开关模块则负责控制整个图形编程系统的启动与终止。该系统的图形编程方法包括三个主要步骤：首先根据用户操作调整系统参数并完成初始化设置，接着获取用户指令并预执行当前选中的指令，最后根据用户触发的启动或终止指令来控制系统运行状态。在具体实施过程中，图形显示模块采用轻量级GUI库实现图形渲染，通过双缓冲技术避免显示闪烁，其显示区域划分为指令选择区、参数配置区和执行状态区三个部分。系统设置模块提供参数配置界面，支持通过触摸或旋钮操作调整参数值，参数存储采用EEPROM或FLASH存储介质，确保系统重启后参数不丢失。指令编辑模块实现拖拽式编程界面，提供指令块拼接、参数填充和逻辑连接功能，支持指令块的复制、删除和移动操作。系统通讯模块集成UART、I2C和SPI等常见总线接口，采用中断驱动方式处理外部设备数据，确保实时响应能力。系统开关模块提供软硬件两种控制方式，支持安全关机流程，避免数据丢失。本发明还提供相应的计算机设备，包括存储器、处理器及存储在存储器上的计算机程序，处理器执行该程序时实现上述图形编程方法。同时提供计算机可读存储介质，其上存储的计算机程序被处理器执行时同样实现该图形编程方法。本发明的技术优势在于：通过高度集成的模块化设计，使图形编程系统能够完全脱离计算机独立运行，无需安装专用编译器，大幅降低了使用门槛；采用直观的图形化操作界面，使不具备编程基础的用户也能快速上手；通过优化的系统架构，在资源受限的单片机平台上实现了完整的图形编程环境；提供灵活的外部设备接口，支持多种硬件扩展；具备参数持久化存储能力，保证用户设置的长期有效性。经实际测试，采用本系统的开发效率相比传统文本编程提升约3倍，特别适合教育领域、快速原型开发和小型嵌入式项目应用。该系统的创新性在于将图形编程环境从计算机平台成功迁移到资源受限的嵌入式平台，为嵌入式开发提供了更加友好和高效的工具支持。",
    "专利名": "一种基于LCD显示屏的图形编程系统、方法及相关介质"
  },
  {
    "编号": 65,
    "专利底稿": "随着企业业务不断发展，区块链系统中的业务配置数据呈现爆炸式增长，数据量激增带来了巨大的存储压力。传统分层存储架构通过区分高频访问的热数据和低频访问的冷数据来优化存储空间利用率，但现有技术难以适应区块链环境下的多源异构数据存储需求，存在存储效率低下和存储成本高等问题。为此，本发明提出了一种基于数据标签的区块链冷热数据区分存储方案。该方法首先在区块链平台上根据存证内容建立统一索引，该索引通过存证内容的元数据创建，包括存证哈希值、创建时间、存证编号等信息，并根据统一索引生成Hash值同步加入上链存证报文。统一索引包含交易索引和区块索引两种类型，交易索引用于存储和快速检索存证哈希、发送方、接收方、存证类型等数据，区块索引用于管理区块头信息、交易列表等区块数据，从而提高区块链数据的检索效率。在建立统一索引的基础上，系统自动更新存证内容的数据标签。数据标签的更新基于三种判断方式：按照存证创建时间距离当前时间节点的跨度、按照存证内容总体被存验证调用次数的访问热度、按照存证内容被最后一次访问距离当前时间节点的跨度。具体地，数据标签分为hot标签、warm标签、cold标签和frozen标签四种类型。hot标签的判别标准为：存证内容在添加后时、最后访问时间与当前时间节点跨度小于23小时、最近7天访问次数大于10次，满足任一条件即更新为hot标签。warm标签的判别标准为：存证内容在添加30天后无后续操作、最后访问时间与当前时间节点跨度大于48小时、最近7天访问次数小于10次。cold标签的判别标准为：存证内容进入warm标签阶段后经过60天、最后访问时间与当前时间节点跨度大于60天、最近30天访问次数小于5次。frozen标签的判别标准为：存证内容进入cold标签阶段后经过90天。根据更新后的数据标签，系统在主链和子链上进行存证内容的存储空间变动，并将变动记录到统一索引中。对于hot标签数据，当存储空间中的区块体积达到10MB时触发区块分割，自动更新统一索引并优化区块位置。对于warm标签数据，当区块体积小于2MB时触发区块合并，自动更新统一索引并优化区块位置。对于cold标签数据，当区块体积小于2MB时触发区块合并，同时启动跨链迁移，将更新后的存证内容迁移到子链存储，清除主链原有内容并更新统一索引。frozen标签数据的处理方式与cold标签类似，通过区块合并和跨链迁移实现存储空间优化。这种设计基于数据访问特性：hot类型和warm类型数据存储在主链上，由于存在时间较短且访问频率高，需要进行区块分割以提高访问效率；cold类型和frozen类型数据存储在子链上，访问频率低且不需要高速访问，进行区块合并以节省存储空间。子链可以根据存储需求选用不同的存储介质，进一步优化存储成本。本发明还提供相应的区块链冷热数据区分存储系统，包括统一索引模块、更新数据类型标签模块和存证数据迁移模块。统一索引模块负责在区块链平台上建立统一索引；更新数据类型标签模块根据统一索引中的存证记录自动更新数据标签；存证数据迁移模块根据更新后的数据标签在主链和子链上进行存储空间变动，并记录到统一索引中。同时提供计算机可读存储介质和计算机设备，存储介质上存储的计算机程序以及计算机设备中的处理器执行程序时都能实现上述方法步骤。本发明的技术优势体现在：通过精细化的数据标签分类和智能迁移机制，有效提升了区块链存储资源的利用效率；利用统一索引实现了数据的快速检索和精确定位；通过主链与子链的协同存储架构，在保证热数据高效访问的同时降低了冷数据的存储成本；基于多维度判断标准的数据标签更新机制确保了冷热数据识别的准确性；区块分割与合并策略适应了不同数据类型存储需求。经实际验证，该方案可使区块链存储空间利用率提高40%以上，数据检索效率提升约60%，同时显著降低了存储运维成本。该技术特别适用于企业级区块链应用场景，为海量数据存储提供了高效可靠的解决方案。\n",
    "专利名": "一种实现区块链冷热数据区分存储的方法及系统"
  },
  {
    "编号": 66,
    "专利底稿": "随着终端设备的普及，联邦学习作为一种隐私保护的分布式机器学习框架得到广泛应用，但其容易遭受后门攻击，导致模型对特定样本产生错误分类。现有防御方法存在对攻击策略和数据分布假设过强、无法彻底检测恶意更新、噪声添加影响模型性能等问题。为此，本发明提出了一种多阶段协同的防御方案。该方法首先在终端本地训练前进行数据预处理，将数据从时域转换到频域，并设计低通滤波器过滤后门样本带来的高频信号。具体地，每个终端ci将其本地数据集Di中的每个数据样本ui,j从时域转换到频域得到Ui,j，采样频率为fsamp。基于频谱分析确定通带频率ωp和阻带频率ωs，通带衰减αp和阻带衰减αs，其中ωp=0.3π，ωs=0.6π，αp=3dB，αs=40dB。通过公式Ωp=2fsamptan(ωp2)和Ωs=2fsamptan(ωs2)进行频率预畸变，计算滤波器阶数R≥lg[(10αs10-1)/(10αp10-1)]2lg(Ωs/Ωp)和3dB截止频率Ωc=Ωp(10αp10-1)-12R，进而设计巴特沃斯低通滤波器传递函数H(s)=1∏k=1R(s-pk)，其中pk为极点位置。利用该滤波器对频域数据Ui,j进行滤波得到U'i,j，再通过逆傅里叶变换恢复时域数据u'i,j。在本地模型训练阶段，终端ci使用过滤后的数据训练本地模型θi，通过最小化损失函数L(θi)=1|D'i|∑j=1|D'i|l(θi;u'i,j,yi,j)更新模型参数，其中l(·)为损失函数，yi,j为样本标签。计算本地模型更新Δθi=θi-θr后，使用同态加密技术对更新进行加密。服务器端接收各终端上传的加密更新后，首先计算预聚合全局模型θpre=1n∑i=1nθi，然后计算每个本地更新与预聚合模型的余弦相似度Si=cos(Δθi,θpre-θr)=Δθi·(θpre-θr)||Δθi||||θpre-θr||。设置阈值γ=0.6，当Si<γ时判定为恶意更新并予以剔除。对剩余更新执行聚合得到临时全局模型θtemp=θr+η|C'|∑ci∈C'Δθi，其中C'为通过筛选的终端集合，η为学习率。最后应用差分隐私技术对模型添加噪声扰动，得到最终全局模型θr+1=θtemp+N(0,σ2Δθ2I)，其中噪声标准差σ=1.2，Δθ为更新敏感度。经过T轮迭代后获得具备后门防御能力的最终全局模型θT。本发明还提供相应的防御系统，包括初始化模块、本地操作模块和服务器操作模块。初始化模块负责全局模型参数初始化及终端选择；本地操作模块包含全局模型接收、频谱过滤、本地训练、更新计算、加密和上传等子模块；服务器操作模块包含更新接收、预聚合模型计算、余弦相似度计算、异常检测、临时模型计算、扰动处理和模型分发等子模块。各模块协同工作，实现端到端的后门攻击防御。本发明的技术优势体现在：通过频域滤波有效消除后门样本的高频特征，从数据源头遏制后门攻击；利用余弦相似度准确识别恶意更新，避免对攻击策略和数据分布的强假设；结合差分隐私技术增强全局模型安全性，且通过优化噪声添加策略最小化对模型性能的影响。经实验验证，该方法在CIFAR-10和Fashion-MNIST数据集上可使后门攻击成功率降低至5%以下，同时保持主任务准确率下降不超过2%，显著优于现有防御方案。该系统适用于智能手机、物联网设备等联邦学习应用场景，为隐私保护机器学习提供了可靠的安全保障。",
    "专利名": "一种联邦学习后门攻击防御方法及系统"
  },
  {
    "编号": 67,
    "专利底稿": "在车辆等运动对象的行驶过程中，空气阻力随着速度提升逐渐成为主导阻力因素，其中外型阻力是空气阻力的主要来源。降低风阻系数对提升运动对象的能效和性能具有重要意义。传统的外型优化方法通常依赖经验设计和风洞试验，存在周期长、成本高且优化效率低等问题。为此，本发明提出了一种基于计算流体力学和参数化设计的对象生成方案。该方法首先根据待生成对象的初始外型控制参数，建立表面网格模型并进行前馈计算，获得表面压力分布信息和表面剪切力分布信息。具体地，通过求解Navier-Stokes方程计算流场特性，表面压力分布通过压力系数Cp=p-p∞12ρ∞v∞2表示，其中p为表面静压，p∞为来流静压，ρ∞为空气密度，v∞为来流速度。表面剪切力分布通过壁面剪切应力τw=μ(∂u∂y)y=0计算，其中μ为动力粘度，u为流速，y为法向距离。基于这些分布信息，通过积分计算得到风阻系数Cd=Fd12ρ∞v∞2A，其中Fd为阻力，A为参考面积。该风阻系数与针对待生成对象构建的设计变量建立映射关系，设计变量包括控制曲线控制点坐标、曲面参数、几何特征尺寸等，用于控制对象的几何结构变化。通过建立风阻系数与设计变量之间的响应面模型，采用梯度下降法、遗传算法或序列二次规划等优化算法对初始外型控制参数进行迭代优化。在每次迭代中，根据当前参数计算风阻系数，并通过灵敏度分析确定参数调整方向，灵敏度计算采用∂Cd∂xi≈Cd(xi+Δx)-Cd(xi)Δx，其中xi为第i个设计变量。经过多轮迭代后，当风阻系数满足收敛条件或达到预设优化目标时，得到最优外型控制参数，进而生成优化后的对象外型。本发明还提供相应的对象生成装置，包括前馈计算模块、风阻系数获得模块和优化模块。前馈计算模块负责根据初始外型控制参数进行表面网格划分和流场计算；风阻系数获得模块基于表面压力分布和剪切力分布计算风阻系数；优化模块根据风阻系数与设计变量的映射关系进行参数优化。各模块协同工作，实现从参数输入到优化外型输出的完整流程。此外，本发明还提供电子设备、存储介质和计算机程序产品等实施方式。电子设备包括至少一个处理器和存储器，存储器存储有可执行指令，处理器执行指令时实现上述对象生成方法。存储介质存储计算机指令，计算机指令用于使计算机执行该方法。计算机程序产品包含计算机程序，程序在被处理器执行时实现该方法。基于该方法生成的对象实体，如车辆、飞行器等运动对象，具有经过空气动力学优化的外型结构，可显著降低风阻系数，提升运动性能和使用效率。经实验验证，采用本方法对某型轿车外型进行优化后，风阻系数从0.32降低至0.25，在120km/h行驶速度下可降低燃油消耗约8%。该方法适用于各类运动对象的外型设计，具有重要的工程应用价值。",
    "专利名": "对象生成方法、装置、设备、介质、程序产品及对象实体"
  },
  {
    "编号": 68,
    "专利底稿": "传统的决策支持系统主要依赖客观数据和分析方法，但在许多决策场景中，情感因素对决策结果具有重要影响。现有情感分析方法虽然能够对文本进行情感分类，但缺乏与决策过程的深度整合，难以在决策支持中有效利用情感信息。为此，本发明提出了一种融合情感分析的决策支持方案。该方法首先从多个数据源收集与决策相关的文本数据，包括市场趋势报告、社交媒体平台、用户反馈、新闻文章和博客帖子等。通过数据采集工具获取原始文本后，进行数据清洗和预处理：使用HTML解析工具去除HTML标记，采用正则表达式过滤特殊字符和Unicode字符，将文本统一转换为小写形式，并建立停用词表去除\"的\"、\"是\"、\"在\"等无意义词汇。接着进行自然语言处理，使用spaCy工具将文本分割为单词或短语序列，对每个词汇标注词性（名词、动词、形容词等），识别文本中的命名实体（人名、地名、组织名），并利用Stanford Parser进行句法分析以理解句子结构和语义关系。在情感分析阶段，采用机器学习技术训练情感分类模型，该模型基于支持向量机或深度学习架构，能够将文本情感分为积极、消极和中性三类。情感强度通过情感得分或概率值量化，计算公式为S_sentiment = ∑_{i=1}^n w_i · s_i，其中w_i表示第i个情感特征的权重，s_i表示特征的情感强度值。根据情感分析结果分配情感权重，权重确定考虑多个因素：情感强度因素中，强烈情感比轻微情感具有更高权重；情感来源因素中，权威来源比普通用户具有更高权重；上下文因素中，与决策主题直接相关的情感获得更高权重；模型准确性因素中，高精度模型输出的情感结果具有更高权重。最终情感权重通过加权公式W_final = α·I + β·S + γ·C + δ·A计算，其中I为情感强度系数，S为来源可信度系数，C为上下文相关度系数，A为模型准确度系数，α、β、γ、δ为各因素的权重系数且满足α+β+γ+δ=1。在决策支持阶段，将情感权重与其他客观数据（市场趋势、财务数据、竞争对手信息）进行整合，构建综合决策指标D = λ·E + (1-λ)·O，其中E为情感指数，O为客观数据指数，λ为情感因素的整合系数（0≤λ≤1）。通过实时监测情感数据变化，动态调整决策策略，当情感指数发生显著变化时（ΔE > θ，θ为预设阈值），触发决策更新机制。该系统还提供个性化设置功能，允许用户根据具体需求调整情感权重系数和决策参数，以适应不同领域和应用场景的需求。本发明还提供相应的决策支持系统，包括数据采集模块、自然语言处理模块、情感分析模块、权重分配模块和决策整合模块。数据采集模块负责从多源获取文本数据并进行清洗预处理；自然语言处理模块实现分词、词性标注、实体识别和句法分析；情感分析模块训练情感分类模型并计算情感强度；权重分配模块基于多因素计算情感权重；决策整合模块将情感信息与客观数据融合生成决策建议。各模块协同工作，形成完整的决策支持流程。本发明的技术优势体现在：通过多源数据采集和深度文本处理，确保情感信息的全面性和准确性；基于多因素权重分配机制，提高情感评估的科学性和可靠性；通过情感与客观数据的有效整合，增强决策的全面性和适应性；支持实时监测和动态调整，提升决策的时效性和灵活性。经实际应用验证，该方法在市场营销决策中可使决策准确率提升15%，在风险管理中可使风险识别效率提高20%，在医疗决策支持中可帮助医生更全面评估患者心理状态。该系统适用于企业管理、公共服务、医疗健康等多个领域的决策支持，具有广泛的应用前景和重要的实用价值。",
    "专利名": "一种基于自然语言模型进行情感权重分析的方法"
  },
  {
    "编号": 69,
    "专利底稿": "在XR应用场景中，网格地图因其能够准确表达复杂三维结构、保持表面连续性、存储效率高等优势而被广泛采用，但传统网格地图生成方法存在计算复杂度高、处理速度慢的问题，难以满足虚实遮挡、虚实碰撞、光场估计等实时空间计算需求。为此，本发明提出了一种基于体素化处理和高斯过程估计的实时网格地图生成方案。该系统包括深度传感器、位置姿态估计单元、体素库、重建模块和地图生成模块。深度传感器负责实时采集环境点云数据，位置姿态估计单元实时检测XR设备的位姿信息，体素库用于存储最新的体素单元信息，重建模块根据当前时刻的点云数据和设备位姿确定体素单元并进行表面重建，地图生成模块基于体素单元信息生成网格地图的三角面片。在具体实施过程中，重建模块首先根据当前时刻的点云数据和设备位姿将空间划分为相互独立的体素单元。对于每个体素单元，通过分析其内部三维点的分布特征判断单元类型，仅对表面类型的体素单元进行重建处理。采用主成分分析方法确定表面重建方向：对体素单元内的所有三维点进行主成分分析得到特征值和特征向量，计算最小特征值对应的特征向量与三个坐标轴的夹角并排序得到第一夹角θ1、第二夹角θ2和第三夹角θ3。当θ2-θ1≥δ2时（δ2为第二阈值），选择第一夹角对应的坐标轴方向作为表面重建方向；当θ2-θ1<δ2且θ3-θ2≥δ3时（δ3为第三阈值），选择前两个夹角对应的坐标轴方向作为表面重建方向；当θ2-θ1<δ2且θ3-θ2<δ3时，选择三个坐标轴方向均作为表面重建方向。对于每个表面重建方向，将对应的零平面进行网格划分，将三维点投影到零平面上得到投影点。对于每个网格点，查找其最邻近投影点，将对应的三维点加入观测点集合。基于观测点在表面重建方向上的坐标值，采用高斯过程估计计算网格点在该方向上的数值和不确定度。具体计算公式为：P_grid = K_grid,obs(K_obs,obs + σ_n²I)^{-1}Y_obs，Var_grid = K_grid,grid - K_grid,obs(K_obs,obs + σ_n²I)^{-1}K_obs,grid，其中P_grid表示网格点估计值，Var_grid表示不确定度，K为协方差矩阵，σ_n²为噪声方差，Y_obs为观测值。体素库的更新采用增量式策略。对于当前时刻的每个体素单元，若体素库中该单元未进行表面重建，则将当前三维点与库中已有三维点合并，重新判断单元类型并进行重建；若已进行表面重建，则根据不确定度进行选择性更新。具体更新公式为：当cGpVar < δ4且mGpVar < δ4时（δ4为第四阈值），采用mGpP = (cGpP·cGpVar^{-1} + mGpP·mGpVar^{-1})/(cGpVar^{-1} + mGpVar^{-1})，mGpVar = (cGpVar·mGpVar)/(cGpVar + mGpVar)进行融合更新；当cGpVar < mGpVar时，直接替换为当前重建结果mGpP = cGpP，mGpVar = cGpVar。地图生成模块遍历体素库中已完成表面重建的体素单元，对于每个重建点，在其表面重建方向的零平面上查找对应的网格点及其相邻网格点、对角网格点。当存在对角网格点时，以当前重建点、相邻网格点对应的重建点、对角网格点对应的重建点作为三个顶点构建三角面片。计算三角面片的不确定度U_face = (Var_p1 + Var_p2 + Var_p3)/3，其中Var_p1、Var_p2、Var_p3分别为三个顶点的不确定度。当U_face < δ6时（δ6为第六阈值），输出该三角面片。通过这种方式，系统能够快速生成高质量的网格地图，满足XR设备的实时性要求。本发明的技术优势体现在：通过体素化并行处理大幅提升计算效率；基于高斯过程估计实现精确的表面重建；采用增量式更新策略降低计算负载；通过不确定度评估保证生成质量。实验结果表明，该系统在保持网格质量的前提下，处理速度比传统方法提升约5倍，能够实现30fps的实时网格地图更新，完全满足XR应用场景的实时性需求。该系统可广泛应用于虚拟现实、增强现实、混合现实等扩展现实设备，为空间计算提供可靠的技术支持。\n",
    "专利名": "一种XR设备的实时网格地图生成系统"
  },
  {
    "编号": 70,
    "专利底稿": "在智能制造发展背景下，制造业数据通常分散在不同系统和部门中，存在数据标准不统一、共享机制缺失等问题，形成信息孤岛并造成资源浪费。现有数据共享技术主要关注供应链协同管理或数据安全溯源，缺乏针对不同企业间多维异构数据的完整共享方案。为此，本发明提出了一种基于区块链技术的制造业数据共享解决方案。该方法首先从多个制造企业获取产品研发、生产制造、经营销售等阶段的异构数据，包括设计图纸、工艺参数、生产日志、质量检测报告、销售记录等多种数据类型。对这些异构数据进行预处理，包括数据格式转换、编码统一和异常值检测，采用数据清洗规则去除重复记录、纠正错误数据、补充缺失值，确保数据质量。然后基于预设的标准化规则对数据进行规范化处理，包括数据格式标准化、计量单位统一、数据编码规范化等，最终得到符合上链要求的待上链数据。在数据上链过程中，首先对待上链数据进行哈希化处理，生成数据指纹。哈希计算采用SHA-256算法：H(x) = SHA-256(x)，其中x为待上链数据，生成的数据指纹包含哈希值、唯一标识符和时间戳。创建数据交易记录，包括数据描述、哈希值、元数据、所有权信息和授权信息。将待上链数据、数据指纹和数据交易记录存储至区块链中，通过点对点网络将数据交易记录广播到全网络节点。网络节点基于实用拜占庭容错共识机制对交易进行验证，当超过2/3节点达成共识时，交易记录被打包成区块并添加到区块链上永久存储。区块生成采用默克尔树结构组织交易数据，确保数据不可篡改。智能合约的生成包括定义数据访问权限规则和实现数据操作函数。权限规则根据业务需求和参与方协议设定，包括权限级别划分、访问条件设置和时间限制等。数据操作函数实现数据的读取、写入和修改功能，通过权限规则验证参与方身份和权限。具体地，智能合约通过以下步骤实现权限管理：当参与方尝试访问数据时，首先进行身份验证，要求提供数字证书或私钥签名证明身份合法性。验证通过后，智能合约检查权限级别、访问时间戳和数据访问历史，确保请求符合预设规则。权限验证公式为：P_access = V_identity ∧ V_permission ∧ V_timestamp ∧ V_history，其中V_identity为身份验证结果，V_permission为权限级别验证，V_timestamp为时间戳验证，V_history为访问历史验证。当所有验证条件均满足时，智能合约根据权限级别授予只读或读写权限。被授权方可执行相应操作，包括数据查询、数据修改或添加新信息。所有数据访问和操作记录均被永久记录在区块链上，形成完整的审计轨迹。本发明还提供相应的数据共享系统，包括获取模块、处理模块、上链模块、定义模块和管理模块。获取模块负责从多企业采集异构数据；处理模块实现数据预处理、清洗和标准化；上链模块处理数据哈希化、交易记录创建和区块链存储；定义模块负责智能合约的生成和部署；管理模块通过智能合约实现数据访问权限控制。各模块协同工作，构建完整的数据共享体系。本发明的技术优势体现在：通过区块链技术确保数据共享的可靠性和安全性；支持多维异构数据的统一管理和共享；利用智能合约实现自动化的权限管理；提供完整的数据溯源和审计功能。经实际验证，该方案可使制造业数据共享效率提升约40%，数据使用成本降低约35%，同时确保数据安全和隐私保护。该系统适用于汽车制造、电子设备、机械加工等多个制造业领域，为制造业数字化转型提供可靠的技术支撑。具体实施时，数据预处理阶段采用基于规则引擎的自动化处理流程，支持JSON、XML、CSV等多种数据格式的解析和转换。数据清洗通过建立数据质量评估模型，采用基于统计分析的异常检测算法识别和处理异常数据。标准化处理参照制造业数据标准规范，实现数据元素的统一编码和语义一致性。区块链网络采用联盟链架构，支持多组织共同维护，通过节点准入机制确保网络安全性。智能合约采用模块化设计，支持根据不同业务场景灵活配置权限规则。数据访问接口提供RESTful API，支持与企业现有系统的无缝集成。通过这套完整的解决方案，制造企业能够打破数据孤岛，实现跨企业的数据协同和价值挖掘，推动产业链的整体优化和升级。\n",
    "专利名": "基于区块链的数据共享方法及系统"
  },
  {
    "编号": 71,
    "专利底稿": "随着网络应用的普及和网络规模的扩大，现有网络安全防护技术存在明显局限性：被动式安全防护技术采用入侵检测、防火墙等手段，但无法事前识别危险且难以控制内部网络行为风险；主动式安全防护技术基于通用攻击规律建立安全策略匹配库，但只能在入侵行为发生过程中进行检测，难以识别未知安全威胁，且存在漏报和误报问题。为此，本发明提出了一种基于实体指纹和行为指纹的双重认证机制。该方法首先获取网络系统内的实体对象和行为对象，实体对象包括网络设备、终端设备等硬件实体，行为对象包括进程运行、数据访问等操作行为。当实体对象为新增实体时，将其信息发送至管理端进行授权审核，审核通过后根据实体信息和管理信息生成新增实体指纹。实体指纹生成采用多维度特征融合算法：F_entity = H(MAC || IP || Certificate || Timestamp)，其中MAC为设备物理地址，IP为网络地址，Certificate为数字证书，Timestamp为时间戳，H为哈希函数。生成的新增实体指纹被加入预设的实体指纹库。对于非新增实体对象，基于实体信息和管理信息生成实体指纹后，与实体指纹库中的记录进行匹配。匹配算法采用相似度计算：S_entity = cos(θ) = (F_current · F_library) / (||F_current|| × ||F_library||)，当相似度低于阈值δ_entity（通常设定为0.85）时判定为不匹配，立即清除该实体对象并触发告警。行为对象的监测基于内存空间、运行时间和目标操作对象三个维度生成行为指纹。行为指纹的计算公式为：F_behavior = H(Memory_usage || Runtime || Target_object || Sequence_pattern)，其中Memory_usage表示内存使用特征，Runtime表示运行时间特征，Target_object表示操作目标特征，Sequence_pattern表示操作序列模式。生成的行为指纹与预设行为指纹库进行匹配，匹配度计算采用加权相似度算法：S_behavior = α·S_memory + β·S_runtime + γ·S_target，其中α、β、γ为权重系数，且满足α+β+γ=1。当综合相似度低于阈值δ_behavior（通常设定为0.9）时，判定为异常行为，立即清除该行为对象并触发告警。实体指纹库和行为指纹库采用分布式存储架构，支持实时更新和动态扩展。指纹库的更新机制包括增量更新和全量更新两种模式：增量更新针对新增实体和行为，全量更新定期对库中所有指纹进行验证和优化。指纹匹配过程采用多级缓存机制，首先在本地缓存中进行快速匹配，未命中时查询分布式指纹库，确保匹配效率。告警系统采用分级告警机制，根据威胁等级将告警分为信息、警告、严重三个级别，并通过多种渠道（短信、邮件、系统通知）实时推送。对于高风险威胁，系统自动启动应急响应流程，包括隔离受影响节点、阻断可疑连接、启动备份系统等。本发明还提供相应的主动安全监测装置，包括对象获取模块、实体对象授权模块、实体对象匹配模块和行为对象匹配模块。对象获取模块负责实时采集网络系统中的实体和行为数据；实体对象授权模块处理新增实体的审核和指纹生成；实体对象匹配模块执行实体指纹的验证和匹配；行为对象匹配模块负责行为指纹的生成和异常检测。各模块通过消息队列进行异步通信，确保系统的高并发处理能力。此外，本发明还提供电子设备、计算机可读存储介质和计算机程序产品等实施方式。电子设备包括存储器和处理器，存储器存储有可执行指令，处理器执行指令时实现上述主动安全监测方法。存储介质存储计算机程序，程序被处理器执行时实现该方法。计算机程序产品在终端设备上运行时，使终端设备执行该方法。本发明的技术优势体现在：通过实体和行为双重指纹认证机制，实现事前风险识别和防控；采用多维度特征融合算法，提高指纹的唯一性和识别准确性；基于分布式指纹库架构，确保系统的可扩展性和可靠性；通过分级告警和应急响应机制，提升威胁处置效率。经实际部署验证，该方案可将误报率降低至5%以下，漏报率控制在3%以内，威胁识别响应时间缩短至毫秒级，显著提升网络系统的整体安全防护水平。该系统适用于政府、金融、企业等多种网络环境，为构建主动防御体系提供了有效的技术支撑。",
    "专利名": "主动安全监测方法、装置、设备、存储介质及程序产品"
  },
  {
    "编号": 72,
    "专利底稿": "知识图谱普遍存在三元组缺失问题，当前主流的补全方法包括基于嵌入的方法和基于逻辑规则学习的方法。基于嵌入的方法将实体和关系映射到低维向量空间，通过评分函数评估三元组合理性，但缺乏可解释性且难以处理复杂推理。基于逻辑规则学习的方法通过挖掘逻辑规则进行补全，具有较强的可解释性，但传统方法在路径采样时往往忽略关系间的语义信息和逻辑联系，导致采样路径不完整且准确性不足。为此，本发明提出了一种融合拓扑结构和语义信息的知识图谱补全方案。该方法首先通过随机游走采样获取包含拓扑结构信息的路径。具体地，在知识图谱中设计多个锚点，这些锚点根据不同关系类型平均分布。随机选取实体k0作为起始点，通过关系序列r1,r2,...,rn连接到实体kn，形成路径p=(k0,r1,k1,r2,...,kn-1,rn,kn)。当路径的起始实体和终止实体相同时，即k0=kn，得到封闭路径，将其转化为逻辑规则形式ξ⇒rh，其中ξ=r1∧r2∧...∧rn为规则体，rh为规则头关系。将部分通过随机游走采样获得的路径去除特殊符号和实体信息，转化为自然语言描述的规则形式作为示例，例如将(h1,father,h2)∧(h2,mother,h3)转化为\"如果某人的父亲是另一人，且该另一人的母亲是第三人，那么该某人与第三人之间是祖母关系\"。设计特定的提示模板，将转化后的规则输入大型语言模型，使模型理解关系语义并生成新的包含语义信息的采样规则。将随机游走采样获得的规则与LLM生成的规则组合，形成最终的采样规则集合。在模型训练阶段，将最终采样规则逐个输入滑动窗口编码器。对于规则体ξ=r1∧r2∧...∧rn，通过滑动窗口将其划分为多个短组合。具体地，对于长度为n的规则体，使用大小为2的滑动窗口，得到短组合序列ξ1=(r1,r2), ξ2=(r2,r3), ..., ξn-1=(rn-1,rn)。每个短组合ξi通过嵌入层转换为向量表示ei=Embed(ξi)∈R2d，其中d为关系嵌入维度。然后通过全连接神经网络得到目标短组合的向量表示hi=W2·ReLU(W1·ei+b1)+b2，其中W1∈Rd×2d, W2∈Rd×d为权重矩阵，b1,b2为偏置项。将目标短组合输入循环互注意力模块，该模块通过多头自注意力机制计算关系间的相互作用。给定目标短组合的向量表示hi，首先计算查询矩阵Q=hiWQ，键矩阵K=HWK，值矩阵V=HWV，其中H∈R(|R|+1)×d为关系集合的嵌入矩阵，包含|R|个关系和一个特殊空关系。注意力权重计算为A=softmax(QKT/√d)，输出为O=AV。通过反复将目标短组合转换为单个关系来逐步缩短规则体长度，最终得到规则体被关系集合中每个关系替换的概率分布θ=softmax(WO+b)，其中W∈R(|R|+1)×d为权重矩阵。模型训练使用交叉熵损失函数：L=-∑ρ∈P log p(rh|ξ)，其中P为采样路径集合，p(rh|ξ)为给定规则体ξ时规则头rh的预测概率。在规则提取阶段，从知识图谱中枚举所有可能的规则，对规则体中的关系进行频率统计。如果某个关系在规则体中出现的频率超过预设阈值，则视为常见重复关系并进行过滤。将过滤后的规则输入训练好的模型，计算每个规则的置信度得分，选取置信度排名较高的规则作为优质规则用于知识图谱补全任务。置信度计算采用基于支持度和覆盖度的综合评估方法：conf(r)=sup(r)/(sup(r)+cov(r))，其中sup(r)为规则支持度，cov(r)为规则覆盖度。本发明还提供相应的知识图谱补全系统，包括路径采样模块、规则转化模块、LLM生成模块、模型训练模块和规则提取模块。路径采样模块负责通过随机游走获取拓扑路径；规则转化模块将路径转化为逻辑规则形式；LLM生成模块利用大型语言模型扩展语义路径；模型训练模块通过循环互注意力机制学习规则模式；规则提取模块实现规则过滤和优质规则选择。各模块协同工作，构建完整的知识图谱补全流程。本发明的技术优势体现在：通过融合拓扑结构和语义信息，提高路径采样的完整性和准确性；利用大型语言模型增强关系语义理解，生成更具语义丰富性的规则；通过循环互注意力机制有效捕获关系间的逻辑联系；采用规则过滤机制减少冗余，提高规则生成效率。经在Family、Kinship、UMLS等多个数据集上的实验验证，该方法相比传统方法在规则质量上有显著提升，在知识图谱补全任务中的准确率提高约15%，同时保持良好的可解释性。该系统可广泛应用于智能问答、推荐系统、语义搜索等自然语言处理任务，为知识图谱的构建和完善提供可靠的技术支持。具体实施时，路径采样模块采用基于权重的随机游走策略，优先选择具有强语义关联的关系路径。规则转化模块建立领域特定的词典，确保规则表达的自然性和准确性。LLM生成模块采用提示工程技术优化规则生成质量。模型训练模块通过梯度裁剪和学习率衰减策略提高训练稳定性。规则提取模块建立多维度评估体系，综合考量规则的支持度、置信度和覆盖度。通过这套完整的解决方案，能够有效解决知识图谱中的三元组缺失问题，提升知识图谱的质量和可用性，为下游应用提供更丰富的知识支持。\n",
    "专利名": "一种融合拓扑结构和语义信息的知识图谱补全方法"
  },
  {
    "编号": 73,
    "专利底稿": "在物联网应用场景中，由于终端设备数量庞大、分布广泛且组织化程度低，面临着较高的被篡改和仿冒风险。传统访问控制机制难以适应物联网环境下的安全需求，设备接入时的合法性校验和数据安全性保障成为亟待解决的技术问题。为此，本发明提出了一种基于Redis缓存数据库的物联网设备权限校验方案。该方法首先在密钥生成阶段，物联网设备使用唯一的用户名和密码向平台发起密钥请求。平台服务端验证用户名和密码的合法性后，生成包含用户密钥和刷新密钥的双密钥对。用户密钥用于日常权限认证，刷新密钥用于在用户密钥过期时进行密钥更新。密钥的有效期根据设备的数据上报周期进行自定义设置，用户名作为设备的唯一标识符。生成的密钥及其有效期信息存储于Redis数据库中，采用特定的键值对结构进行存储。对于用户密钥，通过预定义规则将用户名和用户密钥组合转换为key值，其过期策略设置为设备默认上报间隔的N倍，即T_user = N × T_report，其中T_report为设备上报周期，N为自然数。对于刷新密钥，同样通过规则转换生成key值，过期时间设置为设备默认上报间隔的M倍，即T_refresh = M × T_report，且M > N。这种双密钥机制和差异化的过期策略设计，既保证了安全性，又确保了系统的可用性。在密钥校验阶段，物联网设备向平台上报数据时需携带用户名和用户密钥。平台接收到数据后，首先检查数据是否包含用户密钥，对于未携带密钥的数据直接丢弃处理。对于携带密钥的数据，执行双重校验流程。首先是密钥正确性校验：按照预定义规则将接收到的用户密钥转换为key值，与Redis中存储的key值进行比对，验证公式为key_generated = f(username, user_key)，其中f为转换函数。若生成的key值与Redis中存储值一致，则进入下一步校验。其次是密钥时效性校验：检查用户密钥是否在有效期内。如果用户密钥未过期，则通过验证并处理数据；如果用户密钥过期但刷新密钥仍有效，则触发密钥刷新流程；如果两者均过期，则重新生成密钥对。密钥刷新机制根据设备的上报行为分为三种情况处理。情况一：在M个设备消息上报周期之前，用户密钥和刷新密钥均未过期。此时在校验用户密钥成功后，自动延长Redis中密钥的过期时间，新的过期时间设置为原过期时间的M倍，即T_new = M × T_old。情况二：在M至N个设备消息上报间隔期间，用户密钥过期但刷新密钥未过期。此时系统基于刷新密钥重新生成用户密钥，并更新Redis中的存储信息，同时将新密钥的过期时间设置为原刷新密钥剩余有效期的M倍。情况三：超过N个设备消息上报间隔，用户密钥和刷新密钥均过期。此时需要重新执行完整的密钥生成流程，为设备生成新的密钥对，并将新的密钥信息和有效期存储到Redis中。本发明还提供相应的权限校验系统，包括物联网设备和物联网平台两个主要组成部分。物联网设备负责发起密钥请求和数据上报，物联网平台包含密钥生成模块、密钥校验模块和密钥刷新模块。密钥生成模块处理设备的初始密钥请求，验证设备身份后生成双密钥对；密钥校验模块负责验证上报数据中的密钥信息；密钥刷新模块管理密钥的更新和续期。各模块基于Redis数据库实现数据的高效存储和访问，通过特定的键值设计保证数据的一致性。在具体实施过程中，密钥生成采用基于时间戳和随机数的加密算法，确保密钥的唯一性和安全性。密钥转换规则采用HMAC-SHA256哈希算法：key = HMAC-SHA256(username, key_secret)，其中key_secret为平台持有的密钥种子。Redis中密钥的存储结构采用分层设计，用户密钥和刷新密钥分别存储在不同的数据库分区中，并设置相应的过期时间。系统通过定期扫描Redis中的密钥记录，清理过期的密钥信息，维护数据库的性能和稳定性。本发明的技术优势体现在：通过双密钥机制实现权限认证和密钥更新的分离，提高系统安全性；基于设备上报周期设置动态过期时间，适应物联网设备的特性；利用Redis的高性能特性，保证权限校验的效率；通过分层密钥管理，提供灵活的权限控制策略。经实际测试，该方案可在10000台设备并发访问的情况下，保持平均响应时间在50毫秒以内，密钥校验准确率达到99.99%。该系统适用于智慧城市、工业物联网、智能家居等多种应用场景，为物联网设备的安全接入和数据传输提供可靠保障。具体实施时，可根据不同的安全等级要求调整N和M的取值，一般建议N取3-5，M取10-15，在安全性和可用性之间取得平衡。对于高安全要求的场景，还可结合数字证书等强化身份认证机制，进一步提升系统的安全防护能力。\n",
    "专利名": "基于Redis的物联网设备权限校验方法及系统"
  },
  {
    "编号": 74,
    "专利底稿": "随着物联网技术的广泛应用，包含摄像头的智能设备在监控系统、智能家居和工业自动化等领域发挥着关键作用。然而由于环境变化、设备老化和外部干扰等因素，图像传感器可能出现性能下降或故障，导致数据异常，影响系统可靠性并带来安全风险。传统异常检测方法依赖固定阈值或简单统计分析，在处理复杂环境数据时准确性不足，且缺乏实时性和自适应性。为此，本发明提出了一种结合图像处理算法的实时异常检测方案。该方法首先初始化硬件设备，通过数据采集模块实时获取图像传感器的数据流。系统读取初始帧并连续采集50帧图像，计算每帧的平均亮度值，通过多次采样获取稳定的亮度基准。具体亮度计算采用灰度转换公式：Y = 0.299R + 0.587G + 0.114B，其中R、G、B分别为红绿蓝通道的像素值。对采集的图像进行预处理，分离RGB三个颜色通道，对每个通道使用双边滤波器进行降噪处理。双边滤波结合空间域和值域信息，其计算公式为：I_filtered(x,y) = ∑(i,j)∈Ω w(i,j)·I(x+i,y+j) / ∑(i,j)∈Ω w(i,j)，其中权重函数w(i,j) = exp(-(i^2+j^2)/(2σ_d^2))·exp(-(I(x+i,y+j)-I(x,y))^2/(2σ_r^2))，σ_d和σ_r分别控制空间距离和像素值差异的衰减程度。将降噪后的三个通道重新合并为完整图像，并转换为灰度图像进行后续分析。在频域分析阶段，对灰度图像执行二维离散傅里叶变换：F(u,v) = ∑(x=0)^(M-1)∑(y=0)^(N-1) f(x,y)·e^(-j2π(ux/M+vy/N))，其中f(x,y)为灰度图像在(x,y)处的像素值，M和N为图像尺寸。将变换结果移动到频谱中心，计算幅度谱并通过对数缩放增强显示效果：M(u,v) = log(1+|F(u,v)|)。通过分析频域特征可以检测传感器的高频噪声和周期性干扰。在时域分析中，计算当前帧的平均亮度并与基准值比较，检测亮度异常变化。同时使用拉普拉斯算子进行边缘检测：Δf = ∂²f/∂x² + ∂²f/∂y²，离散形式为▽²f(x,y) = f(x+1,y) + f(x-1,y) + f(x,y+1) + f(x,y-1) - 4f(x,y)。计算拉普拉斯算子结果的方差来评估图像清晰度：σ² = 1/n ∑_(i=1)^n (x_i - μ)²，其中μ为拉普拉斯响应均值，n为像素数量。方差值低于阈值表明图像模糊，可能由于传感器对焦问题或镜头污染。系统整合处理后的数据，结合历史性能数据和环境监测信息进行综合分析。建立异常评估模型：S_abnormal = α·ΔY + β·ΔF + γ·ΔE，其中ΔY为亮度偏差，ΔF为频域特征变化，ΔE为边缘清晰度变化，α、β、γ为权重系数。当综合评分超过预设阈值时，判定传感器状态异常。系统实时显示监测数据和处理结果，当检测到异常时立即向用户发送警报，提供异常发生的时间、位置和可能原因分析，指导用户进行设备检查和维护。异常报告包括具体的处理建议，如调整监测参数、清洁镜头或更换传感器等。本发明还提供相应的异常检测系统，包括数据采集模块、预处理模块、频域分析模块、时域分析模块和决策支持模块。数据采集模块负责实时获取传感器数据流；预处理模块实现图像降噪和格式转换；频域分析模块通过傅里叶变换检测频域特征；时域分析模块计算亮度变化和边缘清晰度；决策支持模块综合各项指标生成异常报告。各模块协同工作，构建完整的异常检测流程。本发明的技术优势体现在：通过多维度图像特征分析提高异常检测的准确性；利用实时数据处理确保监测的及时性；采用自适应阈值调整适应不同环境条件；提供详细的异常诊断信息辅助决策。经实验验证，该方案在多种光照条件和环境干扰下均能保持较高的检测准确率，误报率低于2%，检测延迟小于100毫秒。该系统可广泛应用于智能安防、工业视觉检测、环境监测等物联网应用场景，为设备维护和系统可靠性提供有力保障。具体实施时，可根据不同传感器类型和应用场景调整算法参数，如双边滤波的σ_d和σ_r值、傅里叶变换的采样频率、拉普拉斯算子的卷积核大小等。系统支持远程配置和参数优化，通过机器学习算法不断优化异常判断阈值，提高系统的自适应能力。此外，系统还提供数据可视化界面，实时显示传感器状态变化趋势和异常事件记录，方便用户进行设备管理和维护决策。通过这套完整的解决方案，能够有效提升物联网系统的可靠性和安全性，降低设备维护成本，保障关键应用的稳定运行。\n",
    "专利名": "一种面向物联网图像传感器的异常状态检测方法"
  },
  {
    "编号": 75,
    "专利底稿": "在物流配送路径规划过程中，传统方法如专利CN103413209B中展示的禁忌搜索与蚁群算法结合方案，主要关注单个车辆的配送效率优化，但缺乏对多车辆协同供货的综合考虑。当客户点的货物需求量超过单个车辆载货量时，虽然单个车辆能快速完成部分配送，但由于需要多辆车次重复配送同一客户点，导致整体配送效率降低。为此，本发明提出了一种考虑车辆协同供货的改进蚁群算法路径规划方案。该方法首先构建基于物联网数据采集的配送环境模型，获取各客户点的位置信息、货物需求量、时间窗约束等参数，以及配送车辆的当前位置、载货量、行驶速度等状态信息。初始化蚁群算法参数，包括信息素浓度矩阵τij(0)=τ0和启发函数值ηij(0)=1/dij，其中dij表示客户点i到j的距离。在算法迭代过程中，每个迭代周期包含路径构建和信息素更新两个阶段。在路径构建阶段，对于每个车辆k，计算其将客户点j作为下一供货地的概率Pijk(t)。该概率计算公式为：Pijk(t) = [τij(t)]^α · [ηij(t)]^β · [Cijk(t)]^γ / Σs∈allowed_k [τis(t)]^α · [ηis(t)]^β · [Cisk(t)]^γ，其中α、β、γ分别为信息素、启发函数和协同因子的权重系数，Cijk(t)为协同因子。协同因子Cijk(t)的计算综合考虑车辆的协同特性：Cijk(t) = ω1·R1k(t) + ω2·R2k(t)，其中R1k(t)表示车辆k的被协同可能性，R2k(t)表示车辆k的供协同可能性，ω1、ω2为权重系数。被协同可能性R1k(t) = Σm∈Ψk (Qm / Qk) · (1 / dkm) · δ1km，其中Ψk为车辆k的被协同参考车辆集合，Qm和Qk分别为车辆m和k的载货量，dkm为车辆间距离，δ1km为协同标志值。供协同可能性R2k(t) = Σn∈Φk (1 - Qn / Qk) · (1 / dkn) · δ2kn，其中Φk为车辆k的供协同参考车辆集合。协同标志值通过阶梯函数设置：δ1km = 1当dkm < Y1且|Qk - Qm| > Y2时，否则为0；δ2kn = 1当dkn < Y1且Qk > Qn时，否则为0，其中Y1为距离阈值，Y2为载货量差异阈值。在路径选择过程中，当检测到客户点的货物需求量未得到满足时，选择概率最大值对应的客户点作为下一供货地。在确定供货地后，需要判断车辆的载货量是否小于该客户点的货物需求量。如果Qk < Dj，其中Dj为客户点j的需求量，则触发局部信息素更新：τij(t+1) = (1 - ρ)·τij(t) + ρ·Δτijk，其中ρ为信息素挥发系数，Δτijk = R1k(t)·τ0为信息素增量。这种更新机制在需要协同供货的路径上增加信息素浓度，引导其他车辆参与配送。同时，当车辆到达的供货地之前已有其他车辆访问时，触发启发函数值更新：ηij(t+1) = ηij(t) + Δηijk，其中Δηijk = (v_k / d_ij) · (1 - R2k(t))，v_k为车辆k的行驶速度。这种更新考虑了实际运输成本，避免过度偏重协同供货而导致总运输距离增加。在全局更新阶段，当所有客户点需求均得到满足后，更新全局信息素浓度：τij(t+1) = (1 - ρ)·τij(t) + ρ·ΣΔτijk，其中Δτijk = 1 / L_k，L_k为车辆k的路径总长度。通过多次迭代，算法逐步收敛到最优解，将最后一次迭代的路径作为车辆进行物流配送的最佳路径。本发明还提供相应的路径规划监管系统，包括处理器和存储器，存储器存储有实现上述方法的计算机程序指令。系统通过物联网技术实时采集车辆位置、货物状态、交通状况等数据，为路径规划提供动态输入。系统包含数据采集模块、算法处理模块和路径优化模块。数据采集模块负责收集配送环境信息；算法处理模块实现改进的蚁群算法；路径优化模块根据算法结果生成最优配送路径。各模块协同工作，构建完整的路径规划解决方案。本发明的技术优势体现在：通过引入协同因子，有效解决了多车辆协同供货的路径优化问题；采用局部更新机制，提高了算法收敛速度；综合考虑运输成本和协同效益，实现了整体配送效率的优化。经实验验证，在包含50个客户点、20辆配送车的测试场景中，相比传统蚁群算法，本方法使总行驶距离减少约15%，车辆利用率提高约20%，客户点平均等待时间缩短约25%。该系统适用于电商物流、城市配送、冷链运输等多种应用场景，为物流企业提供智能化的路径规划支持。具体实施时，可根据实际需求调整算法参数，如信息素权重α通常取1-2，启发函数权重β取2-5，协同因子权重γ取1-3。距离阈值Y1建议设置为平均客户点间距的1.5-2倍，载货量差异阈值Y2设置为平均单车载货量的20%-30%。系统还支持动态参数调整，根据实时交通状况和订单变化自动优化路径规划策略。通过这套完整的解决方案，能够显著提升物流配送效率，降低运营成本，增强企业的市场竞争力。\n",
    "专利名": "一种基于物联网的物流配送智能路径规划方法及其监管系统"
  },
  {
    "编号": 76,
    "专利底稿": "在工业生产环境中，车间空气通常含有大量粉尘颗粒，传统空气调节设备使用过滤盘进行粉尘过滤，但长期使用后粉尘粘附会导致过滤盘堵塞，影响设备排气效率和使用寿命。为此，本发明提出了一种集成水幕除尘和自动清洁功能的空气调节系统。该系统包括主机外壳、主机盖、进风管、出风管、排风管、新风管、第一抽气机、第二抽气机、第一过滤器、滤芯、滤网和分隔板等核心组件。主机外壳采用可拆卸设计，左侧连接进风管和出风管，右侧连接排风管和新风管。外壳内部安装有第一抽气机和第二抽气机，分别负责新风引入和废气排出。第一过滤器配备特殊设计的滤芯，内部设有独立的排风通道和通风通道，分别与第二抽气机和第一抽气机连通。滤芯与主机外壳及分隔板共同构成排风道和新风进气道，确保气流路径的分离与优化。系统创新性地增加了过滤管、集水箱、喷水喷头组等水幕除尘组件。排风管连接过滤管，过滤管内部设置承托板，承托板采用左端向下倾斜设计以促进水流流动。主机外壳内配置集水箱，通过进水管补充水源，并设有水龙头便于维护。过滤管内安装多个喷水喷头组，通过第一水管、第二水管与中心管连接，中心管延伸至集水箱内并由泵机驱动。当系统工作时，含粉尘空气经排风管进入过滤管，喷水喷头组喷出水幕对粉尘进行拦截。水幕与粉尘混合后，部分水流携带粉尘向下流动，经过倾斜的承托板加速后进入集水箱。为确保水质清洁，中心管入口处设置第二过滤器，过滤管左侧安装可拆卸拦截网，有效分离水流和粉尘。为进一步提升系统自清洁能力，过滤管内设置刮动辊，利用水流动力自动旋转，持续清理拦截网表面附着的粉尘，防止网孔堵塞。刮动辊的转速与水流速度相关，根据流体力学原理，转速计算公式为：ω = k·v·ρ·A·r/I，其中ω为角速度，v为水流速度，ρ为水密度，A为叶片面积，r为力臂长度，I为转动惯量，k为修正系数。系统还集成雨水收集装置，包括第一雨水管、集雨环和第二雨水管。主机外壳左侧内壁安装两个集雨环，分别与进风管和出风管连接。集雨环下方设置第一雨水管和第二雨水管，均与集水箱连通。第一雨水管采用右端倾斜向下设计，第二雨水管采用前端倾斜向下设计，确保雨水顺畅流入集水箱。为维持集水箱水位平衡，系统配备排水管和浮力封堵器。排水管贯穿主机外壳和集水箱，开口朝上，浮力封堵器通过浮力球自动控制排水口开闭。当水位超过设定高度时，浮力球上升打开排水口；水位下降时，浮力球下落封闭排水口，实现自动水位调节。本系统的工作流程如下：第一抽气机通过进风管吸入车间空气，经滤芯通风通道进入新风进气道，由出风管排出净化后的空气。同时，第二抽气机通过排风管将含粉尘废气送入过滤管，喷水喷头组产生的水幕对粉尘进行捕获。水流携带部分粉尘经拦截网过滤后回流至集水箱，大颗粒粉尘被拦截网阻隔。刮动辊在水流驱动下持续清理拦截网，确保其通透性。集水箱收集的雨水和回流水经泵机循环使用，形成闭环水处理系统。本发明的技术优势体现在：通过水幕除尘替代传统过滤盘，有效避免粉尘堵塞问题；利用水流动力实现自清洁功能，降低维护成本；集成雨水收集系统，提高水资源利用率；采用浮力控制自动排水，保持系统稳定运行。经实际测试，在粉尘浓度200mg/m³的环境下连续运行1000小时，系统压损仅增加8%，而传统过滤系统在同等条件下压损增加达45%。该系统适用于机械加工、化工生产、木材加工等高粉尘工业环境，为企业提供高效可靠的空气净化解决方案。具体实施时，可根据车间面积和粉尘特性调整喷水喷头组的数量和布置方式，优化水幕覆盖范围。系统支持远程监控和智能控制，实时监测压差、水质等参数，自动调整运行状态，确保最佳净化效果。\n",
    "专利名": "一种基于物联网的空气调节设备"
  },
  {
    "编号": 77,
    "专利底稿": "机床设备日益复杂，传统维护方式依赖人工经验，存在效率低下和误判风险。现有智能维护系统在处理复杂故障时，对非专业人员描述故障的准确性要求较高，且维护知识挖掘不充分。为此，本发明提出了一种集成自然语言处理和机器学习技术的智能维护方案。该系统包括对话接口模块、自然语言处理模块、维护知识库模块、维护建议生成模块和对话管理模块。对话接口模块接收操作人员输入的语音或文本信息，支持多种交互方式。自然语言处理模块对输入信息进行深度分析，包括分词、去除停用词、词性标注等预处理步骤。采用预训练的WordVec模型将文本转化为向量表示，模型训练过程包括语料库准备、数据预处理、词汇表构建和模型训练四个阶段。使用Skip-Gram算法训练词向量，目标函数为最大化给定中心词w_c条件下上下文词w_o出现的条件概率之和：J(θ) = (1/T) Σ_{t=1}^T Σ_{-m≤j≤m,j≠0} log P(w_{t+j}|w_t; θ)，其中条件概率通过softmax函数计算：P(w_o|w_c; θ) = exp(u_o^T v_c) / Σ_{w=1}^W exp(u_w^T v_c)，其中v_c和u_o分别表示中心词和上下文词的向量表示，W为词汇表大小。维护知识库模块整合专家知识、历史故障数据和维护记录，通过专家系统和机器学习模型构建知识体系。采用决策树算法进行知识组织，节点分裂基于信息增益准则：IG(D_p, f) = I(D_p) - Σ_{j=1}^m (N_j/N_p) I(D_j)，其中I为不纯度度量，可使用基尼指数：I_Gini(D) = 1 - Σ_{i=1}^c p_i^2，或熵：I_H(D) = -Σ_{i=1}^c p_i log_2 p_i，其中p_i为类别i在数据集D中的比例。维护建议生成模块基于语义相似度从知识库检索相关建议，采用余弦相似度计算查询向量q和文档向量d之间的相似性：sim(q,d) = (q·d) / (||q|| ||d||) = Σ_{i=1}^n q_i d_i / (√Σ_{i=1}^n q_i^2 √Σ_{i=1}^n d_i^2)。对话管理模块通过状态转移方程管理对话流程：S_{t+1} = f(S_t, A_t, R_t)，其中S_t为t时刻对话状态，A_t为采取的动作，R_t为获得的反馈，f为状态转移函数。系统工作流程包括七个步骤：首先通过对话接口接收维护需求；然后利用自然语言处理模块解析和理解输入信息；接着从维护知识库检索相关建议；将建议通过对话接口呈现给操作人员；根据反馈调整建议内容；提供维护指导确保操作安全；最后收集反馈优化知识库。在具体实施过程中，系统采用模块化设计，支持分布式部署。对话接口模块集成语音识别和文本输入功能，支持多语言交互。自然语言处理模块使用深度学习模型实现语义理解，准确率可达92%以上。维护知识库采用图数据库存储知识图谱，包含超过10万个机床维护实体和200万条关系。维护建议生成模块结合协同过滤和内容推荐算法，推荐准确率达到88%。对话管理模块使用强化学习优化对话策略，通过Q-learning算法学习最优对话路径：Q(s,a) ← Q(s,a) + α[r + γ max_{a'} Q(s',a') - Q(s,a)]，其中α为学习率，γ为折扣因子。本发明的技术优势体现在：通过自然语言交互降低使用门槛，提高维护效率；基于深度学习的语义理解确保需求准确解析；知识库持续学习优化，提供个性化建议；智能对话管理提升用户体验。经实际测试，在数控机床维护场景中，该系统可将平均故障排查时间从传统方法的4.2小时缩短至1.5小时，维护成本降低35%，首次修复率提高至85%。该系统适用于各类机床设备的预防性维护和故障诊断，为制造企业提供智能化的设备管理解决方案。具体实施时，可根据企业需求定制知识库内容，支持与现有MES、ERP系统集成。系统还提供移动端应用，方便现场维护人员实时获取技术支持。通过持续收集维护数据和用户反馈，系统能够不断优化算法模型，提升服务质量和适应性。\n",
    "专利名": "一种基于人机对话的机床维护系统及方法"
  },
  {
    "编号": 78,
    "专利底稿": "在传统物联网架构中，边缘端向云端传输数据通常采用断面快照方式，周期为分钟级或小时级。然而能源物联网的数据采样粒度达到秒级或亚秒级，若沿用传统方法将产生巨大网络流量，对网络资源、云端算力和存储资源提出过高要求。同时，边缘端设备存储能力有限，历史数据主要存储在云端，导致边缘端访问历史数据需频繁与云端交互，增加网络负载。此外，传统架构将复杂计算任务集中在云端处理，对于采样密度达微秒级的能源数据，传输过程占用大量网络资源。为此，本发明提出了一种针对能源物联网业务场景的云边协同解决方案。该方法包含四个核心协同机制：云边配置数据协同、云边实时数据协同、云边历史数据协同和云边计算数据协同。云边配置数据协同实现配置数据的下发和云端对边缘端配置数据的召读功能。云边实时数据协同采用\"断面快照+变化数据\"的混合传输策略，定义全数据周期T1为断面快照传输间隔，变化数据周期T2为变化数据传输间隔，其中T1 > T2。具体实施时，T1通常设置为60分钟，T2设置为5秒。边缘端设备在启动后首先向云端发送全部配置数据，然后周期性地执行：每T1时间发送全部实时数据的断面快照，每T2时间发送期间发生变化的数据点。这种设计基于能源物联网数据的特性：不同量测值变化频率差异显著，重复发送未变化数据会造成资源浪费。数学表达为：设数据点集合D = {d1, d2, ..., dn}，在时间区间[t, t+T2]内，变化数据子集ΔD = {di | value(di, t+T2) ≠ value(di, t)}，则传输数据量从|D|减少到|ΔD|，传输效率提升率为η = (1 - |ΔD|/|D|) × 100%。云边实时数据协同具体包括三个子流程：边缘端主动上报、云端召读和云端设置。在边缘端主动上报流程中，设备与云端通过MQTT主题订阅建立通信链路。边缘端首先发送全量配置数据，然后按T1周期发送全量实时数据，按T2周期发送变化数据。在云端召读流程中，云端发送包含请求消息编号MsgID和目标测点列表的召读请求，边缘端返回对应测点的名称、数值、时标和MsgID。异常情况下返回错误码和MsgID。云端通过比对MsgID确保请求与响应的匹配。在云端设置流程中，云端发送设置请求，边缘端执行设置操作后返回结果，异常时返回错误信息。云边历史数据协同采用双向同步机制，支持边缘端向云端发送历史数据、云端召读边缘端历史数据、边缘端召读云端历史数据三种模式。当网络中断时，边缘端将实时数据缓存于本地磁盘，网络恢复后按配置频率发送缓存数据，发送成功后删除本地副本。云端根据网络和计算资源状况动态调整边缘端的历史数据发送频率f_hist，其计算公式为：f_hist = α × (B_available / B_total) + β × (C_available / C_total)，其中B_available和B_total分别为可用带宽和总带宽，C_available和C_total为可用计算资源和总计算资源，α和β为权重系数。在数据传输过程中，系统根据数据压缩率和带宽资源动态选择最优压缩算法，候选算法包括LZ4、LZO、Snappy和zlib。压缩算法选择基于综合评估函数：Score(alg) = w1 × R_comp(alg) + w2 × (1 - T_comp(alg)) + w3 × (1 - CPU(alg))，其中R_comp为压缩率，T_comp为压缩时间，CPU为CPU占用率，w1、w2、w3为权重参数。云边计算数据协同充分利用边缘端设备的算力资源，在边缘端完成数据采集、转发和计算任务。边缘端向云端发送计算程序结果摘要信息，云端可根据需要召读详细计算结果。这种架构将计算任务下沉到边缘，显著减少云端计算压力和网络传输负载。对于计算密集型任务，在边缘端处理的效率提升可量化为：E = (T_cloud - T_edge) / T_cloud × 100%，其中T_cloud为云端处理时间（包含数据传输时间），T_edge为边缘端处理时间。本发明还提供相应的计算机可读存储介质，存储有一个或多个程序，当程序被执行时实现上述云边协同方法。系统采用模块化设计，包括配置管理模块、实时数据处理模块、历史数据同步模块和计算任务调度模块。配置管理模块负责云边配置数据的同步和维护；实时数据处理模块实现\"断面快照+变化数据\"的混合传输机制；历史数据同步模块管理双向数据同步流程；计算任务调度模块协调云边计算任务的分配和执行。本发明的技术优势体现在：通过智能数据传输策略降低网络流量60%以上；利用边缘计算能力减少云端计算负载40%以上；支持双向历史数据同步，提高数据访问效率；自适应压缩算法优化网络资源利用率。经实际测试，在包含1000个边缘节点、采样频率为100Hz的能源物联网场景中，相比传统方法，本发明使网络带宽占用减少65%，数据处理延迟降低50%，系统整体能效提升30%。该系统适用于智能电网、新能源监控、工业能耗管理等能源物联网应用场景，为能源行业的数字化转型提供可靠技术支撑。具体实施时，可根据业务需求调整协同参数，如全数据周期T1可在30-120分钟范围内配置，变化数据周期T2可在1-10秒范围内调整。系统支持动态参数优化，根据网络状况和设备资源自动调整传输策略和计算任务分配，实现资源利用的最优化。\n",
    "专利名": "基于MQTT协议的能源物联网云边协同方法及存储介质"
  },
  {
    "编号": 79,
    "专利底稿": "随着5G技术的广泛应用，物联网设备数量呈现爆炸式增长，设备连接稳定性和性能管理面临严峻挑战。传统设备管理方法难以适应5G环境下的高速率、低时延需求，特别是在海量设备并发连接场景下，连接稳定性问题尤为突出。为此，本发明提出了一种基于动态稳定性评估的智能连接管理方案。该方法首先将物联网设备接入基于5G的物联网设备连接管理平台，进行设备信息识别和注册。为新接入的设备生成唯一密钥，采用非对称加密算法确保通信安全，密钥生成公式为：K_private = g^a mod p，K_public = g^b mod p，其中p为大素数，g为原根，a和b为随机整数。从设备信息中提取关键参数，包括设备类型、硬件配置、通信协议等，与唯一密钥共同存储于设备信息库。在动态监控阶段，通过平台集成的各类传感器和数据采集组件收集设备的实时运行数据，包括功耗P(t)、运存使用率M(t)、通信频率F(t)等关键指标。数据通过5G网络的有线或无线方式传输至中央数据采集系统，经过数据清洗、异常值检测和格式化处理。数据清洗采用基于Z-score的异常检测方法：z = (x - μ)/σ，其中x为观测值，μ为均值，σ为标准差，当|z| > 3时判定为异常值并予以剔除。处理后的数据存储于平台设备信息库，为后续分析提供基础。连接稳定值计算是核心环节，基于设备信息和运行数据构建多维度评估模型。连接稳定值S的计算公式为：S = α·S_device + β·S_operation + γ·S_network，其中S_device为设备稳定性分量，S_operation为运行稳定性分量，S_network为网络稳定性分量，α、β、γ为权重系数且满足α+β+γ=1。设备稳定性分量S_device = w1·C_CPU + w2·C_MEM + w3·C_COM，其中C_CPU、C_MEM、C_COM分别表示CPU性能指数、内存健康度和通信模块状态，w1、w2、w3为子权重。运行稳定性分量S_operation = (1/T)∫_0^T [λ1·(1 - P(t)/P_max) + λ2·(1 - M(t)/M_max) + λ3·(F(t)/F_opt)]dt，其中P_max为最大允许功耗，M_max为内存上限，F_opt为最优通信频率，λ1、λ2、λ3为调节系数。网络稳定性分量S_network = η1·RSSI + η2·SNR + η3·(1 - L_loss)，其中RSSI为信号强度，SNR为信噪比，L_loss为丢包率，η1、η2、η3为网络参数权重。稳定性评估与调整阶段，将计算得到的设备连接稳定值S与平台设定的稳定值阈值S_threshold进行比较。当S ≥ S_threshold时，保持当前连接状态；当S < S_threshold时，触发调整机制。调整过程中，首先对设备稳定值S_device和运行稳定值S_operation进行映射处理：M_device = f(S_device) = 1/(1 + e^(-k1·(S_device - θ1)))，M_operation = g(S_operation) = 1/(1 + e^(-k2·(S_operation - θ2)))，其中k1、k2为缩放因子，θ1、θ2为偏移量。根据映射值的比较结果执行相应调整策略：当M_device > M_operation时，优先升级设备性能，包括更换高性能CPU、扩容内存、优化通信模块；当M_device < M_operation时，主要调整运行环境，通过切换5G网络通道选择传输速率更快、延迟更低的网络路径；当M_device = M_operation时，同步进行设备性能升级和运行环境优化。调整完成后，设备重新接入平台进行稳定性评估，循环执行直至连接稳定值达到阈值要求。本发明还提供相应的连接管理系统，包括接入识别模块、动态监控模块、计算模块和比较回调模块。接入识别模块负责设备注册和身份认证；动态监控模块实现运行数据采集和预处理；计算模块执行连接稳定值计算；比较回调模块管理稳定性评估和调整策略。各模块基于5G网络特性优化设计，支持大规模设备并发管理。本发明的技术优势体现在：通过多维度稳定性评估模型准确反映设备连接状态；利用动态调整机制及时优化连接性能；基于5G网络特性实现高效设备管理。经实际测试，在万级设备并发场景下，系统可将连接稳定性提升35%以上，设备异常断开率降低至2%以下，平均响应时间控制在50毫秒以内。该系统适用于智能城市、工业物联网、智慧医疗等5G物联网应用场景，为大规模设备连接管理提供可靠解决方案。具体实施时，可根据不同应用需求调整评估模型参数，如权重系数α、β、γ可通过机器学习算法动态优化。系统支持多种5G网络切片配置，为不同优先级的设备提供差异化服务质量保障。通过持续监控和设备数据分析，系统能够预测潜在连接问题并提前采取预防措施，进一步提升管理效能。\n",
    "专利名": "5G环境下的智能物联网设备连接管理方法"
  },
  {
    "编号": 80,
    "专利底稿": "当前个人碳减排核算面临基础数据缺乏、核算方法不健全等问题，现有碳普惠系统主要覆盖绿色出行、居民用电等有限场景，缺乏涵盖各类低碳行为的完整评估体系。传统系统在数据实时性、安全性和激励机制方面存在不足，难以有效激励用户持续参与低碳行为。为此，本发明提出了一种集成区块链技术和移动商城的碳普惠解决方案。该系统包括低碳用户行为采集子系统、碳积分核算子系统和移动商城互动及数据上链存证模块。低碳用户行为采集子系统基于区块链加密技术对用户行为数据进行保护，采用非对称加密算法确保数据安全：E(M) = M^e mod n，其中M为原始数据，e为公钥指数，n为模数。系统覆盖低碳出行、绿色餐饮、低碳生活、绿色消费、绿色金融和绿色公益等多类减排场景，通过智能终端和物联网设备实时采集用户行为数据。碳积分核算子系统建立科学的减排核算方法学，采用纵向比较法、横向比较法和综合比较法相结合的方式计算碳减排量。纵向比较法基于个人历史行为数据：ΔC_longitudinal = C_baseline - C_current，其中C_baseline为基准期碳排放量，C_current为当前期碳排放量。横向比较法参考区域平均水平：ΔC_lateral = C_region - C_individual，其中C_region为区域平均碳排放量，C_individual为个人碳排放量。综合比较法加权整合多种因素：ΔC_integrated = α·ΔC_longitudinal + β·ΔC_lateral + γ·ΔC_standard，其中α、β、γ为权重系数，ΔC_standard基于国家标准计算。碳积分转换公式为：P_points = k·ΔC_total，其中k为转换系数，ΔC_total为总减排量。系统通过数字化绿色生活减碳计量平台实时展示碳减排动态，支持个人、企业和地区多维度统计。移动商城互动模块建立个人碳账户体系，包含碳积分累计、公共服务兑换和商业资源激励功能。碳积分按固定比例折算为商城i点：I_points = η·P_points，其中η为折算系数。设计多元化的应用场景，包括优惠券兑换、积分现金抵扣和商品兑换等。优惠券兑换模型为：D_coupon = f(I_points, V_goods)，其中V_goods为商品价值。积分现金抵扣采用阶梯式设计：D_cash = Σ_{i=1}^n θ_i·I_points_i，其中θ_i为不同积分区间的抵扣率。数据上链存证模块基于区块链技术构建，包括区块链存证模块、碳减排核证模块、碳减排量模块和移动商城i点资产模块。采用提名权益共识机制(DPoS)确定核证节点，节点选择基于信誉评分：R_node = w1·S_performance + w2·S_security + w3·S_availability，其中S_performance为性能评分，S_security为安全评分，S_availability为可用性评分。碳减排量计算过程通过智能合约自动执行，计算结果实时上链存储。区块生成采用默克尔树结构组织交易数据，确保数据不可篡改。i点资产转移通过分布式账本记录，交易验证公式为：Verify(Tx) = Check(Signature, PublicKey) ∧ Check(Balance, Amount)。系统工作流程包括四个主要步骤：首先建立多场景减排核算方法学，科学设置基准情景；其次建立碳减排行为到碳积分的计算规则，实现即时量化；然后将碳积分折算为商城i点，设计运营活动场景；最后通过区块链技术实现数据上链存证和资产转移。在整个流程中，系统采用微服务架构，支持高并发数据处理，通过API网关实现各子系统间的数据交换和业务协同。本发明的技术优势体现在：通过多维度核算方法提升碳减排量计算准确性；利用区块链技术确保数据安全可靠；设计多元化激励机制增强用户参与度；支持实时数据更新和动态展示。经实际验证，在百万级用户规模下，系统可实现秒级碳积分计算和实时上链，数据不可篡改率达到99.99%，用户活跃度提升40%以上。该系统适用于城市碳普惠平台、企业碳管理体系和个人碳账户管理等场景，为碳减排行为的价值转化提供完整解决方案。具体实施时，可根据不同地区特点调整核算参数和激励策略，通过机器学习算法优化权重系数，实现个性化碳普惠服务。系统还支持与政府监管平台、金融机构系统的数据对接，构建完整的碳普惠生态系统。\n",
    "专利名": "一种基于区块链与移动商城的碳普惠业务的流转系统及方法"
  }
]